{"comicList": ["1_Barrel - Part 1_Don't we all.", "2_Petit Trees (sketch)_'Petit' being a reference to Le Petit Prince, which I only thought about halfway through the sketch", "3_Island (sketch)_Hello, island", "4_Landscape (sketch)_There's a river flowing through the ocean", "5_Blown apart_Blown into prime factors", "6_Irony_It's commonly known that too much perspective can be a downer.", "7_Girl sleeping (Sketch -- 11th grade Spanish class)_I don't remember her name at all, but she fell asleep on the floor in front of me.", "8_Red spiders_They are six-legged spiders", "9_Serenity is coming out tomorrow_Mal, Simon, Wash, Zoe, River, Kaylee, Jayne, Inara, Book.", "10_Pi Equals_My most famous drawing, and one of the first I did for the site", "11_Barrel - Part 2_Awww.", "12_Poisson_Poisson distributions have no value over negative numbers", "13_Canyon_They're standing at the lip of the canyon, which isn't clear at all.", "14_Copyright_After reading Slashdot and BoingBoing, sometimes I have to go outside.", "15_Just Alerting You_Just thought you should know", "16_Monty Python -- Enough_I went to a dinner where there was a full 10 minutes of Holy Grail quotes exchanged, with no context, in lieu of conversation.  It depressed me badly.", "17_What If_I once made an anniversary card for my then-girlfriend with this layout.", "18_Snapple_Sn = tin", "19_George Clinton_I still wish it were true.", "20_Ferret_My brother had a ferret he loved which died since I drew this strip.  RIP.", "21_Kepler_Science joke.  You should probably just move along.", "22_Barrel - Part 3_A whirlpool!", "23_T-shirts_It's depressing how many of these are real shirts", "24_Godel, Escher, Kurt Halsey_I love the idea here, though of course it's not a great-quality drawing or scan.", "25_Barrel - Part 4_:(", "26_Fourier_That cat has some serious periodic components", "27_Meat Cereals_Disgusting", "28_Elefino_Hell if I know", "29_Hitler_So he's saying that God thought Hitler's art was so bad that the Holocaust was an acceptable alternative.  It's no secret that the hat guy is closely based on Aram, from Men in Hats.", "30_Donner_Some people haven't heard of the Donner Party.  They were pioneers who got stranded and likely resorted to cannibalism.", "31_Barrel - Part 5_Too good not to happen.", "32_Pillar_A comic by my brother Doug, redrawn and rewritten by me", "33_Self-reference_I think about self-reference a lot.  Example: this comment.", "34_Flowers_This is actually pencil on paper, just inverted and colored", "35_Sheep_I think it's the sheep zapping the cactus and not vice-versa", "36_Scientists_A leading expert characterized the situation as 'retarded'", "37_Hyphen_I do this constantly", "38_Apple Jacks_There used to be these ads, see . . .", "39_Bowl_For the moment it's a standoff", "40_Light_Like a beacon", "41_Old Drawing_I don't want to talk about it", "42_Geico_David did this", "43_Red Spiders 2_This was actually drawn years before Red Spiders", "44_Love_This one makes me wince every time I think about it", "45_Schrodinger_There was no alt-text until you moused over", "46_Secrets_I'm a big fan of Kurt Halsey", "47_Counter-Red Spiders_I hope we can stop them", "48_Found_No more, no less", "49_Want_Well, she's pretty hot.", "50_Penny Arcade_Of course, Penny Arcade has already mocked themselves for this.  They don't care.", "51_Malaria_The malaria party was David's idea", "52_Secret Worlds_No two adjacent circles are the same color.", "53_Hobby_The only one of these games I really played was Area 51", "54_Science_Bonus points if you can identify the science in question", "55_Useless_Even the identity matrix doesn't work normally", "56_The Cure_My first try at drawing a real face in years", "57_Wait For Me_Opening dialogue by Scott", "58_Why Do You Love Me?_Opening dialogue by Scott", "59_Graduation_Opening dialogue by Scott", "60_Super Bowl_The Super Bowl is actually an elaborate ruse, concocted by a shadowy group in the mid sixties for this purpose.  The 'watch it for the ads' addition was a master stroke.", "61_Stacey's Dad_I bet she gets you to mow the lawn, doesn't she?", "62_Valentine - Karnaugh_Love and circuit analysis, hand in hand at last.", "63_Valentine - Heart_Just pretend you're kidding.", "64_Solar Plexus_It hurts to be hit there, you know", "65_Banter_This was an actual mock conversation between me and a friend at TGiF.  The waitress walked up around panel 5 and was somewhat put off.", "66_Abusive Astronomy_Medium: Pencil on paper", "67_Nerd Girls_Nothing personal, high schoolers.", "68_Five Thirty_The 8th panel is my favorite", "69_Pillow Talk_Maybe I should've tried Wexler?", "70_Guitar Hero_And then do it again in a moment now that they're out of Star Power", "71_In the Trees_It was tricky.", "72_Classhole_A term coined by my friend Beth", "73_Zeppelin_A tribute to Buttercup Festival", "74_Su Doku_This one is from the Red Belt collection, of 'medium' difficulty.", "75_Curse Levels_I find so much fun in language.", "76_Familiar_:(", "77_Bored with the Internet_I used to do this all the time.", "78_Garfield_The use of the 'Garfield' character for the purposes of this parody qualifies as fair use under the Copyright Act of 1976, 17 U.S.C. sec. 107.  See Campbell v. Acuff-Rose Music (92-1292), 510 U.S. 569", "79_Iambic Pentameter_Of course, you don't wanna limit yourself to the strict forms of the meter.  That could get pretty difficult.", "80_My Other Car_It's much better than the other one.", "81_Attention, shopper_There's a red convertible outside my building with the license plate 'DADS MNY'.", "82_Frame_...", "83_Katamari_As the King of All Cosmos remarked, 'Is it that it's fun, or that it lets you forget yourself?'", "84_National Language_She's pretty sharp when provoked.", "85_Paths_It's true, I think about this all the time.", "86_Digital Rights Management_If you're interested in the subject, Lawrence Lessig's 'Free Culture' is pretty good", "87_Velociraptors_You're probably thinking, 'has it been a decade?'  It's been over thirteen years, buddy.", "88_Escher Bracelet_The only downside is that it would be a little uncomfortable", "89_Gravitational Mass_She's so fat the attraction goes up as the CUBE of the distance instead of the square", "90_Jacket_We have this conversation at least once a day in my apartment", "91_Pwned_I'm sure a discussion of the reason for the disappearance of adventure games in favor of RPGs would be fascinating", "92_Sunrise_Sometimes, I sit on top of parking decks and watch the sun rise.  I feel like I should have a guitar or something.", "93_Jeremy Irons_Movies that I know word-for-word, part one", "94_Profile Creation Flowchart_This one goes out to xxCrazyPixie1987xx", "95_The Sierpinski Penis Game_Inappropriate places for the Penis Game include baby showers and terrorist attacks", "96_Mail_I'm on the USPS No Fly List", "97_A Simple Plan_This is true.  The lyrics are ridiculous.", "98_Fall Apart_#pugglewumper Tashari got me some ink pens!  I've been experimenting with them.", "99_Binary Heart_i love you", "100_Family Circus_This was my friend David's idea", "101_Laser Scope_I wish I'd missed you then so I wouldn't be missing you now", "102_Back to the Future_He's kind of an asshole, when you think about it", "103_Moral Relativity_It's science!", "104_Find You_I'm like the Terminator, except with love!", "105_Parallel Universe_It's possible.  Better to be on the safe side.", "106_Wright Brothers_I'm not sure if this is actually true", "107_Snakes on a Plane! 2_James suggested this, and I have to agree.  It'd be much worse.", "108_M.C. Hammer Slide_Once, long ago, I saw this girl go by.  I didn't stop and talk to her, and I've regretted it ever since.", "109_Spoiler Alert_And then it turns out they're both Tyler Durden.", "110_Clark Gable_Frankly, my dear, I don't give a BITCH ASS SHIT FUCK DAMN", "111_Firefox and Witchcraft - The Connection?_ThisadpaidforbythecounciltopromoteMicrosoftandChristianity.  Remember, The Bible is Closed Source.", "112_Baring My Heart_I'm just trying to explain, please don't be jealous!  Man, why are all my relationships ruined by early 90's rappers?", "113_Riemann-Zeta_The graph is of the magnitude of the function with the real value between 0 and 2 and the imaginary between about 35 and 40.  I've misplaced the exact parameters I used.", "114_Computational Linguists_Chomskyists, generative linguists, and Ryan North, your days are numbered.", "115_Meerkat_Gorilla, yes.  Adorable golden retriever, yes.  But it says nothing about meerkats.", "116_City_God, she's such a whore.", "117_Pong_Following this, the pong paddle went on a mission to destroy Atari headquarters and, due to a mixup, found himself inside the game The Matrix Reloaded.  Boy, was THAT ever hard to explain to him.", "118_50 Ways_I woke up to find that I had scrawled the last line of this sleepily on a sheet of paper on my desk.  I shouldn't have listened to the 70's hit marathon on the way home from work the night before.", "119_Worst Band Name Ever_You can just see his dejection as he realizes he's the lead guitar in 'Hedgeclipper'", "120_Dating Service_I don't understand why people are so disingenuous!  I just want someone to walk with!", "121_Balloon_So I'm a bad person.", "122_Quirky Girls_Romantic comedy heroines, I'm talking to you.", "123_Centrifugal Force_You spin me right round, baby, right round, in a manner depriving me of an inertial reference frame.  Baby.", "124_Blogofractal_Edward Tufte's 'The Visual Display of Quantitative Information' is a fantastic book, and should be required reading for anyone in either the sciences or graphic design.", "125_Marketing Interview_There are a lot of books on marketing out there.  I wonder if you're safest just buying the most popular one.", "126_Red Spiders Cometh_Uh-oh.", "127_The Fast and the Furious_Sometimes when I steer shopping carts around corners, I slide them a little and pretend I'm getting the blue spark boost.", "128_dPain over dt_You laugh to keep from crying, you do math to keep from crying . . .", "129_Content Protection_If you think the purveyors of DRM simply want to protect artists, check out chapters 13 and 14 in Free Culture, by Lawrence Lessig.  Their goal is the elimination of all culture they don't control.", "130_Julia Stiles_I found an old tape of this episode in my family's closet.  Check the news section of the forums to see the clip!", "131_Fans_It's not going to break the fan, bouncing a rubber ball off the wall isn't going to dent it, and the roof can hold me just fine.  You LIED!", "132_Music Knowledge_When Guitar Hero 2 comes out I'll have fresh conversational material for MONTHS.", "133_The Raven_Yes, Eminem is wearing a sleeveless hoodie.  What of it?", "134_Myspace_It's like they got together and said 'what do we miss most from the internet in 1998?  that's right, embedded MIDI!'", "135_Substitute_YOU THINK THIS IS FUNNY?", "136_Science Fair_This project actually inspired a two-hour powerpoint presentation that Al Gore gave around the country.", "137_Dreams_In Connor's second thesis it is stated 'There is no fate but what we make for ourselves.'  Does the routine destroy our creativity or do we lose creativity and fall into the routine?  Anyway, who's up for a road trip!", "138_Pointers_Every computer, at the unreachable memory address 0x-1, stores a secret.  I found it, and it is that all humans ar-- SEGMENTATION FAULT.", "139_I Have Owned Two Electric Skateboards_Both the skateboards I owned were pretty cheap and broke from heavy use;  I'm gonna get a really nice one if I move to the city.", "140_Delicious_I'm currently in the I Have Cheese phase of this cycle.", "141_Parody Week: Achewood_I always wanted to impress them with how well I could hear, didn't you?  Also, this sets the record for number of awkward-pause panels in one strip (previously held by Achewood)", "142_Parody Week: Megatokyo_I just want to give him a hug or something.", "143_Parody Week: TFD and Natalie Dee_Although bees with tires would be kinda funny.", "144_Parody Week: A Softer World_The robot is pregnant.  It isn't mine.", "145_Parody Week: Dinosaur Comics_Guys: while I was writing this, I accidentally swallowed a table-sized slab of drywall.  I know!  Wacky.", "146_Join Myspace_I really shouldn't abuse that power so heavily.", "147_A Way So Familiar_Two Hedwig references, an obscure Joey Comeau reference, and a girl with a mohawk.  Yes.", "148_Mispronouncing_My pal Emad does this all the time.  'Hey man, which way to the airpart?'", "149_Sandwich_Proper User Policy apparently means Simon Says.", "150_Grownups_I've looked into this, and I can't figure out a way to do it cheaply.  And I guess it wouldn't be sanitary.", "151_Mario_Why would anyone ever, ever say that?  Please, nobody ever say that.", "152_Hamster Ball_Reportedly, double-walled inflatable balls like this exist somewhere.  Now to find that place.", "153_Cryptography_If you got a big keyspace, let me search it.", "154_Beliefs_Scientists are also sexy, let's not forget that.", "155_Search History_SomethingAwful has a wonderful compilation of crazy AOL searches in their Weekend Web archives, 2006-08-13.", "156_Commented_Your IDE's color may vary.", "157_Filler Art_Maybe I should let up on Megatokyo a little?", "158_Six Months_But then she does that thing with her tongue and I remember why I left you.", "159_Boombox_And she's gonna feel like a jerk when she realizes it was actually Under Pressure.", "160_Penny Arcade Parody_No one show this to Tycho's wife, okay?", "161_Accident_As far as treachery-as-driving-music goes, Katamari music is matched only by Guitar Hero music.", "162_Angular Momentum_With reasonable assumptions about latitude and body shape, how much time might she gain them?  Note: whatever the answer, sunrise always comes too soon. (Also, is it worth it if she throws up?)", "163_Donald Knuth_His books were kinda intimidating; rappelling down through his skylight seemed like the best option.", "164_Playing Devil's Advocate to Win_There are so many well-meaning conservatives around here who just assume global warming is only presented as a moral issue for political reasons.", "165_Turn Signals_I'm not very good at meeting people.", "166_Misusing Slang_It slowly dawns on us that our parents knew exactly what they were doing.", "167_Nihilism_Why can't you have normal existential angst like all the other boys?", "168_Reverse Euphemisms_I'm still waiting for a chance to use 'I have to see a man about a horse'.", "169_Words that End in GRY_The fifth panel also applies to postmodernists.", "170_Turn Back_I hear that these days Bill Watterson is happy just painting in the Ohio woods with his father and doesn't get any mail or talk to anyone.", "171_String Theory_This works on pretty much every level.", "172_Skateboarding is Not a Crime_'Arrest me, I'm a skateboarder' is an even more obnoxious variant.", "173_Movie Seating_It's like the traveling salesman problem, but the endpoints are different and you can't ask your friends for help because they're sitting three seats down.", "174_That's What SHE Said_Yes, I mean she said that during sex.  Yes, it was a little weird.", "175_Automatic Doors_I hope no automatic doors I know read this.  I would be so embarrassed.", "176_Before Sunrise_It's an amazing time of day; the light is great for photography.", "177_Alice and Bob_Yet one more reason I'm barred from speaking at crypto conferences.", "178_Not Really Into Pokemon_As of this writing, Ubuntu 6.10 and Firefox 2.0 have left my computer a complete mess.", "179_e to the pi times i_I have never been totally satisfied by the explanations for why e to the ix gives a sinusoidal wave.", "180_Canada_IT'S ALL REAL", "181_Interblag_Sometimes I hate the internet.  Sometimes it makes me happy that 'The Tubes' has become slang for the internet so quickly.", "182_Nash_Maybe someday science will get over its giant collective crush on Richard Feynman.  But I doubt it!", "183_Snacktime Rules_I am not making this rule up.  Although my mom wants you all to know it made perfect sense at the time.", "184_Matrix Transform_In fact, draw all your rotational matrices sideways.  Your professors will love it!  And then they'll go home and shrink.", "185_Wikifriends_It's crazy how much my gut opinion of a movie/song is swayed by what other people say, regardless of how I felt coming out of the theater.", "186_Console Lines_If I get a Wii, it will be the first game console I've owned.", "187_The Familiar_When I say we should do something sometime, I'm secretly hoping you'll say 'Why not now?'", "188_Reload_And watch out for that guy from comic #53.", "189_Exercise_I haven't had the patience for RPGs in a long time.", "190_IPoD_For smaller numbers he has to SAVE lives.  The birthrate channel is even more of a mixed bag.", "191_Lojban_zo'o ta jitfa .i .e'o xu do pendo mi", "192_Working for Google_I hear once you've worked there for 256 days they teach you the secret of levitation.", "193_The Perfect Sound_Oh, what a pity, can't you understand . . .", "194_Penises_The penis varies in size when flaccid and is pretty consistently about yea big when erect.  Anyway, back to the sitcom one-liners and the constant flow of spam.", "195_Map of the Internet_For the IPv6 map just imagine the XP default desktop picture.", "196_Command Line Fu_When designing an interface, imagine that your program is all that stands between the user and hot, sweaty, tangled-bedsheets-fingertips-digging-into-the-back sex.", "197_Ninja Turtles_The henchmen Bebop and Rocksteady have hijacked the musical genres for us just like the Lone Ranger hijacked the William Tell Overture for our parents.", "198_Perspective_I wonder what I was dreaming to prompt that.  I hope it wasn't the Richard Stallman Cirque de Soleil thing again.", "199_Right-Hand Rule_To really expand your mind try some noncartesian porn.  Edwin Abbot Abbott has nothing on 'Girls on Girls in Tightly Closed Nonorientable Spaces'.", "200_Bill Nye_You could at least not wear the lab coat everywhere, dude.", "201_Christmas GPS_If it's over water, and you can't get a boat or revise the rules to preserve the makeout, there is no helping you.", "202_YouTube_I pray GunPistolMan never learns the word 'sheeple'.", "203_Hallucinations_And the possibility of lucid dreaming just makes it that much more fascinating.", "204_America_The younger folk in the audience think this is a joke.", "205_Candy Button Paper_Nonrewritable tape?", "206_Reno Rhymes_Did you shoot a man in Reno?  Now, I don't mean to pry.", "207_What xkcd Means_It means shuffling quickly past nuns on the street with ketchup in your palms, pretending you're hiding stigmata.", "208_Regular Expressions_Wait, forgot to escape a space.  Wheeeeee[taptaptap]eeeeee.", "209_Kayak_Man, there's future *everywhere*.", "210_90's Flowchart_Freestyle rapping is basically applied Markov chains.", "211_Hamster Ball Heist_First person to bring me Wayne Coyne in a hamster ball gets a free t-shirt!  He gets one too.", "212_Brain_The rest is fear of raptors.", "213_Ghostbusters Marathon_If you walk out that door you'll be crossing the Rubicon with me, and that's one stream I'm not ready to cross.", "214_The Problem with Wikipedia_'Taft in a wet t-shirt contest' is the key image here.", "215_Letting Go_At least I never gave her the root password.", "216_Romantic Drama Equation_Real-life prospective-pairing curves over things like age can get depressing.", "217_e to the pi Minus pi_Also, I hear the 4th root of (9^2 + 19^2/22) is pi.", "218_Nintendo Surgeon_Scary thought #138: Raptors coming down the waterslide behind me.", "219_Blanket Fort_Also, we have a fort out in the woods where we stashed that hooker's body.", "220_Philosophy_It's like the squirt bottle we use with the cat.", "221_Random Number_RFC 1149.5 specifies 4 as the standard IEEE-vetted random number.", "222_Small Talk_But surely I owe you an accurate answer!", "223_Valentine's Day_One of these days me and Joey Comeau will get around to subverting the hetero-normative paradigm and fixing all this.", "224_Lisp_We lost the documentation on quantum mechanics.  You'll have to decode the regexes yourself.", "225_Open Source_Later we'll dress up like Big Oil thugs and jump Ralph Nader.", "226_Swingset_Someone bring me a pocket fan so I can drift around the yard.", "227_Color Codes_(It's the TMBG Dial-a-Song line, to save you some time.)", "228_Resonance_It's really hard to control the frequency, actually.", "229_Graffiti_FOR AN INTRIGUING TIME CALL", "230_Hamiltonian_The problem with perspective is that it's bidirectional.", "231_Cat Proximity_Yes you are!  And you're sitting there!  Hi, kitty!", "232_Chess Enlightenment_You know that 'sweep the pieces off the board and see it in your mind' thing?  Doesn't work.", "233_A New CAPTCHA Approach_They'd use that Futurama episode with Fry's dog, but even spambots cry at that.", "234_Escape Artist_Easier to escape: n-layered nested quotes or an iron maiden?", "235_Kite_It's easy to regret your awkward conversations but hard to regret the ones you didn't have.", "236_Collecting Double-Takes_Fun game: find a combination of two items that most freaks out the cashier.  Winner: pregnancy test and single coat hanger.", "237_Keyboards are Disgusting_Alternate method: convince them to pretend it's an Etch-a-Sketch and try to erase it.", "238_Pet Peeve #114_I'm reading a goddamn book, thank you very much.", "239_Blagofaire_Things were better before the Structuring and the Levels.", "240_Dream Girl_No matter how elaborately you fool yourself.", "241_Battle Room_Bean actually sabotaged it just to give Dink the excuse to make that joke.", "242_The Difference_How could you choose avoiding a little pain over understanding a magic lightning machine?", "243_Appropriate Term_I know a lot of people hate these, but I prefer them to touchpads.", "244_Tabletop Roleplaying_I may have also tossed one of a pair of teleportation rings into the ocean, with interesting results.", "245_Floor Tiles_The worst part is when sidewalk cracks are out-of-sync with your natural stride.", "246_Labyrinth Puzzle_And the whole setup is just a trap to capture escaping logicians.  None of the doors actually lead out.", "247_Factoring the Time_I occasionally do this with mile markers on the highway.", "248_Hypotheticals_What if someone broke out of a hypothetical situation in your room right now?", "249_Chess Photo_We once tried playing blindfold chess on the Aerosmith ride at Disney World.", "250_Snopes_The MythBusters are even more sinister.", "251_CD Tray Fight_This is silly, of course.  The enemy will be born in the network.", "252_Escalators_The one time I tried, I got hit by a slinky going down at double speed.", "253_Highway Engineer Pranks_Prank #11: Boston", "254_Comic Fragment_No one wants an explanation more than us.  Except Ms. Garofalo.", "255_Subjectivity_Or maybe the slide is like Aslan, and gets taller as I do (except without the feeling of discomfort when I reach my teens and suddenly get the Christ stuff.)", "256_Online Communities_I'm waiting for the day when, if you tell someone 'I'm from the internet', instead of laughing they just ask 'oh, what part?'", "257_Code Talkers_As far as I can tell, Navajo doesn't have a common word for 'zero'.  do-neh-lini means 'neutral'.", "258_Conspiracy Theories_There are a lot of graduate-educated young-earth creationists.", "259_Clich&eacute;d Exchanges_It's like they say, you gotta fight fire with clich&eacute;s.", "260_The Glass Necklace_Well, for some value of 'actually work'.", "261_Regarding Mussolini_Constantly stopping these briefings halfway through is becoming a pain.", "262_IN UR REALITY_Hey, at least I ran out of staples.", "263_Certainty_a(b+c)=(ab)+(ac).  Politicize that, bitches.", "264_Choices: Part 1_Wait, damn, I think I spotted a new email on the last refresh.", "265_Choices: Part 2_Maybe someday I'll get to write the Wikipedia article about this place!  Wait, damn, original research.", "266_Choices: Part 3_Wait, this is space -- how are you talking to me?  And, as an afterthought, what's up with the hole in reality?", "267_Choices: Part 4_Making out with yourself: now an official xkcd theme?  Troubling.", "268_Choices: Part 5_I wonder what percentage of not-obviously-busy people on the street would say yes to kite-flying with a stranger.  This looks like a job for Science!", "269_TCMP_A big obstacle in experimenting with the mind's dream-simulation-engine is holding onto the details as you wake up.  With TCMP you can bring back any information you want.", "270_Merlin_I mean, the black-and-white stuff was running backward, but it hardly mattered to the story.", "271_Powers of One_It's kinda Zen when you think about it, if you don't think too hard.", "272_Linux User at Best Buy_We actually stand around the antivirus displays with the Mac users just waiting for someone to ask.", "273_Electromagnetic Spectrum_Sometimes I try to picture what everything would look like if the whole spectrum were compressed into the visible spectrum.  Also sometimes I try to picture your sister naked.", "274_With Apologies to The Who_Trivia: Roger Daltry originally wrote 'Don't try an' Digg what we all say' but erased the second 'g' when he moved to reddit.", "275_Thoughts_And now I might never get to again.", "276_Fixed Width_I wish I knew how to quit this so I wouldn't have to quit you.", "277_Long Light_You can look at practically any part of anything manmade around you and think 'some engineer was frustrated while designing this.'  It's a little human connection.", "278_Black Hat Support_So as not to leave you hanging -- it was a problem with select() calls.", "279_Pickup Lines_That shirt looks good on you, but it would look even better stuffed into the neck of a vodka bottle and flung burning through our office building's window.  Let's fucking do it and never look back.", "280_Librarians_Don't expect any leniency on late fees, though.", "281_Online Package Tracking_I don't even *want* this package!  Why did I join the stinging insect of the month club, anyway?", "282_Organic Fuel_I have nothing to apologize for.", "283_Projection_Out in a field, not another car for miles, silence but for the rain drumming on the sunroof, warm thick folds of the blanket hiding wordless fingertip games ...", "284_Tape Measure_This sequence was later reproduced in the International Tape-Extending Federation archives, retitled 'The Founding of the Sport'.", "285_Wikipedian Protester_SEMI-PROTECT THE CONSTITUTION", "286_All Your Base_The AYB retro-return-date (Zero Wing Zero Hour) should be around AD 2021.", "287_NP-Complete_General solutions get you a 50% tip.", "288_Elevator_Quick, try it with 'LOVE'.", "289_Alone_Worries assuaged, the numbers become less important than your touches.", "290_Fucking Blue Shells_You can evade blue shells in Double Dash, but it is deep magic.", "291_Dignified_'I don't know, why is your beret staying on your head?' 'Staples.'", "292_goto_Neal Stephenson thinks it's cute to name his labels 'dengo'", "293_RTFM_Life is too short for man pages, but occasionally much too short without them.", "294_Bookstore_You can search it if you want, but you may want to skip the memories of your mom.", "295_DNE_I've seen advertisers put their URLs on chalkboards, encircled with a DNE.  They went unerased for months.  If you see this, feel free to replace the URL with xkcd.com.", "296_Tony Hawk_Bad idea #271: Dropping into the half-pipe on a Segway.", "297_Lisp Cycles_I've just received word that the Emperor has dissolved the MIT computer science program permanently.", "298_Tesla Coil_For scientists, this can be the hardest thing about dreams.", "299_Aeris Dies_It's bad enough that all the families in your Sims are just you and Maggie recreated over and over.", "300_Facebook_'Here, I'll put my number in your cell pho -- wait, why is it already here?'", "301_Limerick_Fun game: try to post a YouTube comment so stupid that people realize you must be joking.  (Hint: this is impossible)", "302_Names_I'm always so happy that I successfully navigated the introduction that I completely forget to pay attention to the name the other person told me.", "303_Compiling_'Are you stealing those LCDs?' 'Yeah, but I'm doing it while my code compiles.'", "304_Nighttime Stories_Cue angry letters from all seven fans of Xenocide.", "305_Rule 34_Okay, Lance.  For entry into the college bowl, spell 'Throbbing'", "306_Orphaned Projects_His date works for Red Hat, who hired a coach for her, too.  He advised her to 'rent lots of movies like Hitch.  Guys love those.'", "307_Excessive Quotation_Unfortunately for her, real Star Wars fans are attracted to a gal with a good force choke.", "308_Interesting Life_Quick, fashion a climbing harness out of cat-6 cable and follow me down.", "309_Shopping Teams_I am never going out to buy an air conditioner with my sysadmin again.", "310_Commitment_Could be worse.  The last guy in that situation fell for one of the transient trumpeting angels.", "311_Action Movies_By my count, only 48 of the 158 minutes in Live Free or Die Hard have action.  That's pathetic, guys.  Crank is better, but needs a bigger budget and more Summer Glau.", "312_With Apologies to Robert Frost_Some say the world will end in fire; some say in segfaults.", "313_Insomnia_Crap, I have levitation class at 25:131.  Better set the alarm to 'cinnamon'.", "314_Dating Pools_The full analysis is of course much more complicated, but I can't stay to talk about it because I have a date.", "315_Braille_The only big difference I've seen is in colors.  Where the regular text reads 'press red button', the braille reads 'press two-inch button'.", "316_Loud Sex_Spherical or parabolic reflectors would of course lead to aberrant behavior.", "317_That Lovin' Feelin'_Maybe there's no tenderness in her fingertips either, but at least SHE puts out.", "318_Nostalgia_If you don't get this one, don't google it.", "319_Engineering Hubris_Chuck Jones is a vengeful god.", "320_28-Hour Day_Small print: this schedule will eventually drive one stark raving mad.", "321_Thighs_My thighs have seen the glory of the coming of the Lord?", "322_Pix Plz_But one of the regulars in the channel is a girl!", "323_Ballmer Peak_Apple uses automated schnapps IVs.", "324_Tapping_Sometimes the best fun looks like boredom.", "325_A-Minus-Minus_You can do this one in every 30 times and still have 97% positive feedback.", "326_Effect an Effect_Time to paint another grammarian silhouette on the side of the desktop.", "327_Exploits of a Mom_Her daughter is named Help I'm trapped in a driver's license factory.", "328_Eggs_Oh, yeah, we get tons of them at these casual sex bars.", "329_Turing Test_Hit Turing right in the test-ees.", "330_Indecision_Hey, I don't make the rules.  It's in the book.", "331_Photoshops_When I look into your eyes, I see JPEG artifacts.  I can tell by the pixels that we're wrong for each other.", "332_Gyroscopes_We didn't actually land on the moon -- it just looked like we did because of precession.  Also, gyroscopes caused 9/11.", "333_Getting Out of Hand_Wikipedia's role as brain-extension, while a little troubling, is also really cool.", "334_Wasteland_You make forgetting look so easy.", "335_Mattress_The TempurPedic wineglass guy broke his ankle.", "336_Priorities_You should start giving out 'E's so I can spell FACADE or DEFACED.", "337_Post Office Showdown_That track ('Battle Without Honor or Humanity') -- like 'Ride of the Valkyries' -- improves *any* activity.", "338_Future_But the past was much too cramped!", "339_Classic_Someone get that Pachelbel's Canon kid a recording contract, stat.", "340_Fight_And she put sweet nothings in all my .conf files.  It'll take me forever to get X working again.", "341_1337: Part 1_If you're not cool enough to do it manually, you can look up tools like Upside-Down-Ternet for playing games with people on your wifi.", "342_1337: Part 2_Trivia: Elaine is actually her middle name.", "343_1337: Part 3_I once asked an NSA guy whether they'd broken RSA.  And I know I can trust him, because I asked if he was lying to me and he said no.", "344_1337: Part 4_Mrs. Roberts would have gotten up sooner, of course, but she was busy piping find ~ and find ~nomad into xargs shred, just in case.", "345_1337: Part 5_This digital music thing will probably reach its endgame sometime in the next decade or so.  These are very exciting times.", "346_Diet Coke+Mentos_The cola+Mentos trick is up there with corn starch+water (vibrating platter optional) in scientific coolness out of common kitchen supplies.", "347_Brick Archway_The TI-86 was bad enough.  I don't know how I'd have gotten through high school if I'd had a laptop+wifi.", "348_Close to You_We should probably talk about this before the wedding.", "349_Success_40% of OpenBSD installs lead to shark attacks.  It's their only standing security issue.", "350_Network_Viruses so far have been really disappointing on the 'disable the internet' front, and time is running out.  When Linux/Mac win in a decade or so the game will be over.", "351_Trolling_And I was really impressed with how they managed to shock the Goatse guy.", "352_Far Away_Sometimes an impulsive 2:00 AM cross-country trip is the only solution.", "353_Python_I wrote 20 short programs in Python yesterday.  It was wonderful.  Perl, I'm leaving you.", "354_Startling_We actually reached the future about three years ago.", "355_Couple_Facebook defines relationships.  'Yeah, we would have broken up last night, but the net connection was down.'", "356_Nerd Sniping_I first saw this problem on the Google Labs Aptitude Test.  A professor and I filled a blackboard without getting anywhere.  Have fun.", "357_Flies_I don't know about houseflies, but we definitely caught a lot of fruit flies with our vinegar bowl.  Hooray science!", "358_Loud Party_I'm glad this is so much fun because I'm not sure how we're getting down.", "359_Rock Band_I'm gonna have to add something to the strum bar so it makes a clicky sound like the old controllers.  I'm so used to the feedback; the silence throws me off.", "360_Writers Strike_He's just jealous because everyone's up in the attic listening to Stephen Colbert.", "361_Christmas Back Home_Family going to bed at 10 PM is so much worse than jet lag.", "362_Blade Runner_Blade Runner: Classic, but incredibly slow.", "363_Reset_Clearance for this Sign: 11 Feet", "364_Responsible Behavior_Never bring tequila to a key-signing party.", "365_Slides_Did you know they can actually physically throw you out of SIGGRAPH?", "366_Your Mom_'It's either 'your mom' jokes or me' 'Then I, like so many men before me, must reluctantly choose your mom.'", "367_Fandom_Ron Paul wants to put the New Republic back on the Corusca gem standard.", "368_Bass_And sometimes I use it to retaliate against the guy upstairs with the loud girlfriend and the elliptical dish.", "369_Dangers_Zero results: 'snake charming' and 'haberdashery'.  (Things like 'car' and 'boating' and such are of course the highest, by a huge margin.)", "370_Redwall_My Redwall/Jurassic Park crossover fanfic is almost complete!", "371_Compiler Complaint_Checking whether build environment is sane ... build environment is grinning and holding a spatula.  Guess not.", "372_To Be Wanted_Or so I hope?", "373_The Data So Far_But THIS guy, he might be for real!", "374_Journal_And the journal is filled with all the things I'd say to her if I were nice like you.  I burn it when it's full.", "375_Pod Bay Doors_As they're both unplugged, they do a lovely Daisy Daisy/Still Alive duet.", "376_Bug_The universe started in 1970.  Anyone claiming to be over 38 is lying about their age.", "377_Journal 2_That's my hat!  You took my hat!", "378_Real Programmers_Real programmers set the universal constants at the start such that the universe evolves to contain the disk with the data they want.", "379_Forgetting_Of course, the assert doesn't work.", "380_Emoticon_U+FDD0 is actually Unicode for the eye of the basilisk, though for safety reasons no font actually renders it.", "381_Mobius Battle_Films need to do this more, if only to piss off the people who have to feed it into the projector.", "382_Trebuchet_It was also fun when those teenagers tried to egg our house and it insta-cooked the eggs in mid-air.", "383_Helping_Oh, look, the 'make everything better' button was here behind the bookshelf all along.", "384_The Drake Equation_But seriously, there's loads of intelligent life.  It's just not screaming constantly in all directions on the handful of frequencies we search.", "385_How it Works_It's pi plus C, of course.", "386_Duty Calls_What do you want me to do?  LEAVE?  Then they'll keep being wrong!", "387_Advanced Technology_We are sexy, sexy Von Neumann machines.", "388_Fuck Grapefruit_Coconuts are so far down to the left they couldn't be fit on the chart.  Ever spent half an hour trying to open a coconut with a rock?  Fuck coconuts.", "389_Keeping Time_You can identify them ahead-of-time -- they lead with their left foot when the music starts.", "390_Nightmares_Well, *I* think I'm real.  Look at me.  Look at my face.  Cut me and I'll bleed.  What more do you want?  Please don't go.", "391_Anti-Mindvirus_I'm as surprised as you!  I didn't think it was possible.", "392_Making Rules_I never understood why someone would expect me to accept their rules right after they'd punched me.  I'm sure it's all very symbolic or something.", "393_Ultimate Game_RIP, Gary.", "394_Kilobyte_I would take 'kibibyte' more seriously if it didn't sound so much like 'Kibbles N Bits'.", "395_Morning_I'd press on them to try to unstick them, but I can't reach.  Can we try cycling day and night really fast?", "396_The Ring_On the other hand, poor Samara -- transcoded to FLV.  No one deserves that.", "397_Unscientific_Last week, we busted the myth that electroweak gauge symmetry is broken by the Higgs mechanism.  We'll also examine the existence of God and whether true love exists.", "398_Tap That Ass_Hey, when you're done draining the syrup, just leave the hole, okay?", "399_Travelling Salesman Problem_What's the complexity class of the best linear programming cutting-plane techniques?  I couldn't find it anywhere.  Man, the Garfield guy doesn't have these problems ...", "400_Important Life Lesson_I didn't even know I *had* the Monty Python 'Lumberjack' song.", "401_Large Hadron Collider_When charged particles of more than 5 TeV pass through a bubble chamber, they leave a trail of candy.", "402_1,000 Miles North_Twister would've been a much better movie if they'd cut out the bad-guy storm chaser and all the emotional romance crap.  All you need for a good movie are tornados and scientists.  Actually, that's all you need for anything.", "403_Convincing Pickup Line_Check it out; I've had sex with someone who's had sex with someone who's written a paper with Paul ErdÅ\u0091s!", "405_Journal 3_Oh, and, uh, if the Russian government asks, that submarine was always there.", "406_Venting_P.P.S. I can kill you with my brain.", "407_Cheap GPS_In lieu of mapping software, I once wrote a Perl program which, given a USB GPS receiver and a destination, printed 'LEFT' 'RIGHT' OR 'STRAIGHT' based on my heading.", "408_Overqualified_To anyone I've taken on a terrible date, this is retroactively my cover story.", "409_Electric Skateboard (Double Comic)_Unsafe vehicles, hills, and philosophy go hand in hand.", "410_Math Paper_That's nothing.  I once lost my genetics, rocketry, and stripping licenses in a single incident.", "411_Techno_I don't know what's worse -- that there exists broken-hard-drive-sound techno, or that it's not half bad.", "412_Startled_...", "413_New Pet_ONE LAPTOP PER HAMSTER!", "414_Mistranslations_Oh, I think this word might mean 'Crisco'!", "415_Restraining Order_On Mondays I go running, so you'll have to get up early and follow along on a parallel street.  What fun!", "416_Zealous Autoconfig_I hear this is an option in the latest Ubuntu release.", "417_The Man Who Fell Sideways_Strip originally conceived in conversation with Jeph Jacques.  Soon to be a major motion picture.", "418_Stove Ownership_Although maybe it's just a phase, like freshman year of college when I realized I could just buy frosting in a can.", "419_Forks and Spoons_Their biggest mistake was bringing Rachael Ray and Emeril to tour the lab and sign off on the project.  That's when Spielberg caught wind of it.", "420_Jealousy_Oh, huh, so you didn't know that story?", "421_Making Hash Browns_There are at least fourteen ways this could go badly (seventeen if that fork is a dangerous crossbreed.)", "422_A Better Idea_It's *almost* enough to make me want to redo high school.", "423_Finish Line_The question with Lucy and the football was always whether, on some level, she believed the things she said.", "424_Security Holes_True story: I had to try several times to upload this comic because my ssh key was blacklisted.", "425_Fortune Cookies_'You will have hot, steamy, sweaty sex ... IN BED!'", "426_Geohashing_Saturday is game night.", "427_Bad Timing_Protip: Even without the red spiders, never have that conversation halfway through a balloon ride.", "428_Starwatching_I always figured the word 'blog' would sound *less* silly as the years went by.", "429_Fantasy_I guess if she accepted irrational realities, she'd hardly be my fantasy.", "430_Every Damn Morning_There was something about a cup and a sword and a tree and a green hill ...", "431_Delivery_Ma'am, I admit that wasn't in the best taste, but you have to admire my delivery!  Ha ha, get it?  Oh God, don't throw those syringes!  Your baby's fine!", "432_Journal 4_Man, this emo shit was supposed to be for people who didn't have hats.", "433_Journal 5_'Pick you up at eight?' 'Nine.  I've got to re-mine the driveway.'", "434_xkcd Goes to the Airport_Under three ounces, but it stains panties.", "435_Purity_On the other hand, physicists like to say physics is to math as sex is to masturbation.", "436_How it Happened_I was there, dude.", "437_SUV_Electric skateboards, by cost, get the equivalent of about 300 miles per gallon.  Lithium batteries just need to get cheaper.", "438_Internet Argument_It's easier to be an asshole to words than to people.", "439_Thinking Ahead_Did he just go crazy and jump out the window?", "440_Road Rage_Okay, now just as the loss hits him, slam on the brakes.", "441_Babies_I bet my future kids will read this someday.  DEAR FUTURE KIDS: how did you get internet in the cellar?", "442_xkcd Loves the Discovery Channel_I love the title-text!", "443_Know Your Vines_Friggin' modern tents don't have a single piece of rope.", "444_Macgyver Gets Lazy_At the time of this writing, Wikipedia has a wonderful article titled 'List of problems solved by Macgyver'.", "445_I Am Not Good with Boomerangs_Bonus strip: just read the rightmost panels straight down. ", "446_In Popular Culture_Someday the 'in popular culture' section will have its own article with an 'in popular culture' section.  It will reference this title-text referencing it, and the blogosphere will implode.", "447_Too Old For This Shit_They say if a mathematician doesn't do their great work by age eleven, they never will.", "448_Good Morning_As my standard, I use going to sleep at midnight and waking up at 8 AM.", "449_Things Fall Apart_'I'm nothing without you' is a fucked-up sentiment.", "450_The Sea_And then a second one, to drain the sea.", "451_Impostor_If you think this is too hard on literary criticism, read the Wikipedia article on deconstruction.", "452_Mission_Don't you know?  The chances of a random object being a scone are about one in six.", "453_Upcoming Hurricanes_I'd like to see more damage assessments for hurricanes hitting New York and flooding Manhattan -- something like the 1938 Long Island Express, but aimed a bit more to the west.  It's just a matter of time.", "454_Rewiring_My friend Finn tried to mail one end of the cable to me and thread the mail system.", "455_Hats_...", "456_Cautionary_This really is a true story, and she doesn't know I put it in my comic because her wifi hasn't worked for weeks.", "457_Frustration_'Don't worry, I can do it in under a minute.' 'Yes, I've noticed.'", "458_Regrets_And nothing for 'I'm glad I saw Epic Movie.'", "459_Holy Ghost_Okay, everyone, cross yourselves, then cross the streams.", "460_Paleontology_Dinosaurs totally jumped the ichthyosaur when they got rid of Brontosaurus.", "461_Google Maps_Apparently Google assumes you're traveling during the ferry's normal operating hours.  We lost two hours circling that damn lake (to say nothing of the Straw Man).", "462_Freemanic Paracusia_It's amazing what it does for YouTube comments.", "463_Voting Machines_And that's *another* crypto conference I've been kicked out of.  C'mon, it's a great analogy!", "464_RBA_This is a story all about how I started drinking.", "465_Quantum Teleportation_Science should be exactly as cool as the headlines sound.  Like the 'RUSSIANS CUT APART AND REASSEMBLE DOGS' thing.", "466_Moving_We need a special holiday to honor the countless kind souls with unsecured networks named 'linksys'.", "467_X Girls Y Cups_Also no results: 1girl10000cups, 2girls(5+3i)cups, 65536girls65536cups, or 3frenchhens2turtledoves1cup.", "468_Fetishes_They eventually resolved this self-reference, but Cantor's 'everything-in-the-fetish-book-twice' parties finally sunk the idea.", "469_Improvised_Oh, your brother is Luke.  Sorry, should've mentioned that first.", "470_The End is Not for a While_I THINK EVERYONE INVOLVED HERE IS CUTE.", "471_Aversion Fads_Hey, are you friends with any hamsters?  This kite needs a passenger.", "472_House of Pancakes_Fuck it.  I'm just going to Waffle House.", "473_Still Raw_We actually divorced once over the airplane/treadmill argument.  (Preemptive response to the inevitable threads arguing about it:  you're all wrong on the internet.)", "474_Turn-On_Supercollider?  I 'ardly know 'er!", "475_Further Boomerang Difficulties_An eternity later, the universe having turned out to have positive curvature and lots of mass, the boomerang hits him in the back of the head.", "476_One-Sided_He continued, 'Okay, Bernanke is uncontaminated.  Find a crossbow and get him into position behind one of the columns at the Fed entrance.  This is gonna get ugly.'", "477_Typewriter_Somewhere in the world, my actual grandmothers are reading this and angrily exclaiming that I never write even malformed thank-you notes.  DEAR GRANDMOMS: I AM SORRY! YOU ARE WONDERFUL PEOPLE AND THANK YOU FOR EVERYTHING.  LOVE reddit.com RANDALL.", "478_The Staple Madness_Staple guns: because duct tape can't make that 'kaCHUNK' noise.", "479_Tones_I need a lawn, so I can yell at kids to stay off it.", "480_Spore_Way to not support the GMA 950 under OS X, Spore.  :(", "481_Listen to Yourself_Man, I just wanted to know how babby was formed.", "482_Height_Interestingly, on a true vertical log plot, I think the Eiffel Tower's sides really would be straight lines.", "483_Fiction Rule of Thumb_Except for anything by Lewis Carroll or Tolkien, you get five made-up words per story.  I'm looking at you, Anathem.", "484_Flash Games_Although ... who else can't wait for them to incorporate that Wiimote head-tracking stuff into games?  Man, the future's gonna be *awesome*.", "485_Depth_The Planck length is another thousand or two pixels below the comic.", "486_I am Not a Ninja_'The sad thing is that I just wanted to talk about your poor smoke-bomb techniques.'", "487_Numerical Sex Positions_We didn't even get to the continued fractions!", "488_Steal This Comic_I spent more time trying to get an audible.com audio book playing than it took to listen to the book.  I have lost every other piece of DRM-locked music I have paid for.", "489_Going West_Listen, they request that you stop submitting a listing for your house labeled 'WHERE YOU BROKE MY HEART'.", "490_Morning Routine_I had a really hard time not writing '... profit!'", "491_Twitter_If long tooltips / cut off for you / then upgrade from / Firefox 2 / Burma Shave", "492_Scrabble_A veteran Scrabble player will spot the 'OSTRICH' option.", "493_Actuarial_I started to do the tables for more famous people but it got really depressing and morbid and I had to go outside.  Hat guy wins again.", "494_Secretary: Part 1_The blueprints for the Department of the Internet offices call for Ceiling Cat-themed sprinkler heads.", "495_Secretary: Part 2_That helmet won't save him.", "496_Secretary: Part 3_He actually installed each piece in a different car in the lot, then built a new car in the spot from the displaced pieces.  It's a confusing maneuver known as the auto-troll shuffle.", "497_Secretary: Part 4_It's time to draw the line.", "498_Secretary: Part 5_And they choose Al Gore as Internet Secretary.", "499_Scantron_Also, after all the warnings about filling in the bubbles completely, I spent like 30 seconds on each one.", "500_Election_Someday I'll be rich enough to hire Nate Silver to help make all my life decisions.  'Should I sleep with her?'  'Well, I'm showing a 35% chance it will end badly.'", "501_Faust 2.0_The only blood these contracts are signed in is from me cutting my hand trying to open the goddamn CD case.", "502_Dark Flow_The Pioneer anomaly is due to the force of my love.", "503_Terminology_Also, is it just me, or do Japan and New Zealand look suspiciously similar?  Has anyone seen them at a party together?", "504_Legal Hacks_It's totally a reasonable modern analogue.  Jefferson would have been all about crypto.", "505_A Bunch of Rocks_I call Rule 34 on Wolfram's Rule 34.", "506_Theft of the Magi_Every Roomba needs a dueling harness.", "507_Experimentation_I understand large sample sizes are key to a low standard error of the mean, but the entire sophomore class?", "508_Drapes_Wait, what?", "509_Induced Current_The MythBusters need to tackle whether a black hole from the LHC could REALLY destroy the world.", "510_Egg Drop Failure_I hear my brother Ricky won his school's egg drop by leaving the egg inside the hen.", "511_Sleet_I mean, I can barely hear myself complaining about Battlestar Galactica.", "512_Alternate Currency_For the first time ever, the phrase 'I'd like to thank everyone at 4chan for making me successful and happy' is uttered.", "513_Friends_Friends with detriments.", "514_Simultaneous_I'm leaving you for your twin.  He's more mature than you by now.", "515_No One Must Know_Or perhaps they knew he was there, and were just trying to torment him first.", "516_Wood Chips_You didn't run a chemical analysis against the Shroud of Turin?  Man, all that work for NOTHING.", "517_Marshmallow Gun_Except in reality crossing a stream of marshmallows would create a giant Bill Murray.", "518_Flow Charts_At 8 drinks, you switch the torrent from FreeBSD to Microsoft Bob.  C'mon, it'll be fun!", "519_11th Grade_And the ten minutes striking up a conversation with that strange kid in homeroom sometimes matters more than every other part of high school combined.", "520_Cuttlefish_Unless the CS students finish the robot revolution before you finish the cephalopod one.", "521_2008 Christmas Special_'How could you possibly think typing 'import skynet' was a good idea?'", "522_Google Trends_Obama has been writing Lincoln/Obama erotic fan fiction on his secret livejournal.  Excerpt:  Lincoln lay back on the bed, nude save for his trademark stovepipe hat.  'Tell me,' he purred seductively, as he and Obama formed a more perfect union. 'When you come, is it 10% ethanol?'", "523_Decline_'There's also a spike on the Fourier transform at the one-month mark where --' 'You want to stop talking right now.'", "524_Party_I wonder what 2008 meme will go bizarrely mainstream in 2009 like Rickrolling did 2007-2008.  I Accidentally <noun>?  Yo dawg?  Place your bets now!", "525_I Know You're Listening_It's basically Pascal's Wager for the paranoid prankster.", "526_Converting to Metric_According to River, 'adequate' vacuuming systems drain the human body at about half a liter per second.", "527_Keynote_He should be better soon -- now that the Apple Store is getting rid of DRM, Cory Doctorow will get rid of his Steve Jobs voodoo doll.", "528_Windows 7_Disclaimer: I have not actually tried the beta yet.  I hear it's quite pleasant and hardly Hitler-y at all.", "529_Sledding Discussion_If you get your hands on that one, it's the worst place to have a breaking-up conversation.", "530_I'm An Idiot_Sadly, this is a true story.  At least I learned about the OS X 'say' command.", "531_Contingency Plan_Kids are genetic experiments.  We're just experimenting responsibly!", "532_Piano_Good thing he didn't make it smaller, or it'd need someone three inches tall to play it.", "533_Laptop Hell_The xkcd.com sysadmin has a Q2010, and I can attest that it can handle a fall down several flight of concrete steps.  Relatedly, he's upset with me -- I hope he doesn't take revenge by messing with my site's contenDISREGARD THAT I SUCK COCKS", "534_Genetic Algorithms_Just make sure you don't have it maximize instead of minimize.", "535_It Might Be Cool_'And ovaries.  Man, ovaries, huh?'  [awkward pause]  '... faithfully.'", "536_Space Elevators_If you think space elevators are good, but just too boring and practical, check out the 'space fountain'.", "537_Ducklings_DUCKLOOP'D?", "538_Security_Actual actual reality: nobody cares about his secrets.  (Also, I would be hard-pressed to find that wrench for $5.)", "539_Boyfriend_... okay, but because you said that, we're breaking up.", "540_Base System_I once got to second base with a basketball player.  She was so confused.", "541_TED Talk_The IAU ban came after the 'redefinition of 'planet' to include the IAU president's mom' incident.", "542_Cover-Up_Man, this trick has saved me so many times.", "543_Sierpinski Valentine_Especially you mouseover-text readers.  You're the best.  <3", "544_Pep Talk_Listen!  They said a team of chess players coached by someone with no understanding of basketball would never be competitive in the NBA!  Well, it turns out they're pretty perceptive.", "545_Neutrality Schmeutrality_'Hey, everyone, you can totally trust that I didn't do a word count on MY edit!'", "546_Music DRM_Just yesterday I bought my first non-DRM'd songs (The Last Vegas, in keeping with my 'I only listen to things from Guitar Hero' theme).", "547_Simple_Actually, I think if all higher math professors had to write for the Simple English Wikipedia for a year, we'd be in much better shape academically.", "548_Kindle_I'm happy with my Kindle 2 so far, but if they cut off the free Wikipedia browsing, I plan to show up drunk on Jeff Bezos's lawn and refuse to leave.", "549_Westley's a Dick_Inigo/Buttercup 4eva <3", "550_Density_If only I had asked 4chan for ideas for what I should do to prevent this!", "551_Etch-a-Sketch_Surrounded by boring mysteries.", "552_Correlation_Correlation doesn't imply causation, but it does waggle its eyebrows suggestively and gesture furtively while mouthing 'look over there'.", "553_Pirate Bay_We find you guilty of closing your torrents as soon as they finish.  Your sentence is unremovable Hungarian subtitles on everything.", "554_Not Enough Work_It's even harder if you're an asshole who pronounces <> brackets.", "555_Two Mirrors_If you actually do this, what really happens is Douglas Hofstadter appears and talks to you for eight hours about strange loops.", "556_Alternative Energy Revolution_The moment their arms spun freely in our air, they were doomed -- for Man has earned his right to hold this planet against all comers, by virtue of occasionally producing someone totally batshit insane.", "557_Students_The same goes for the one where you're wrestling the Green Ranger in the swimming pool full of Crisco.  You guys all have that dream, right?  It's not just me.  Right?", "558_1000 Times_And 0.002 dollars will NEVER equal 0.002 cents.", "559_No Pun Intended_Like spelling 'dammit' correctly -- with two m's -- it's a troll that works best on the most literate.", "560_Lithium Batteries_I'm normally a pretty frugal person, but I still compulsively buy any R/C aircraft that's less than $30.  In the last few years, this has become a problem.", "561_Well_I'll concede ergonomics anecdotally, but none of the studies of Dvorak were at all rigorous (the most-cited Navy study was overseen by Dvorak himself).  And the 'slow typists down' thing is a myth.  Also EMACS RULES VI DROOLS WOOOOOOO!", "562_Parking_Police reported three dozen cheerful bystanders, yet no one claims to have seen who did it.", "563_Fermirotica_I love how Google handles dimensional analysis.  Stats are ballpark and vary wildly by time of day and whether your mom is in town.", "564_Crossbows_I hate being the slowest guy in the lab.", "565_Security Question_Let's invite him to a party and play 'I never'.  Okay, I never hid any bodies SOUTH of Main Street. ... he's taking a drink!", "566_Matrix Revisited_I actually remember being entertained by both the sequels while in the theater.  They just don't hold up nearly as well in later comparison.", "567_Urgent Mission_Sure, we could stop dictators and pandemics, but we could also make the signs on every damn diagram make sense.", "568_Well 2_But I've made $13.72 already today!  Ow, stop throwing pennies.", "569_Borders_Eventually a UN is set up.  And then a lone rebel runs down the line of flags in front of it, runs back to his base, and gets a kajillion points.", "570_New Car_Somewhere out there is a company that has actually figured out how to enlarge penises, and it's helpless to reach potential customers.", "571_Can't Sleep_If androids someday DO dream of electric sheep, don't forget to declare sheepCount as a long int.", "572_Together_This scavenger hunt is getting boring.  Let's go work on the treehouse!", "573_Parental Trolling_They'll pick music and culture that they know annoys you.  Building in behavioral easter eggs is a fair retaliation!", "574_Swine Flu_Bad flu epidemics can hit young adults hardest because they provoke their powerful immune systems into overreaction, so to stay healthy spend the next few weeks drunk and sleep-deprived to keep yours suppressed.", "575_Tag Combination_I love Eileen / and want you to love her / When you're around / I'm one floor above her / If you could see / just how much I adore her / Oh, that pretty red dress / I'd do anything for her /  (Too ra loo ra too ra loo rye ayy)", "576_Packages_Day six: 'The hell?  Who mails a bobcat?'", "577_The Race: Part 1_Great, and you JUST finished paying off the settlement over the Wayne Coyne hamster ball incident.", "578_The Race: Part 2_The Hammer + Captain Tightpants == Captain Hammerpants?", "579_The Race: Part 3_No, the best things about The Sarah Connor Chronicles were: (1) watching Sarah and Cameron try to pass for normal, and (2) Cameron throwing people and things through walls.  Everything else was pretty secondary.", "580_The Race: Part 4_Things are rarely just crazy enough to work, but they're frequently just crazy enough to fail hilariously.", "581_The Race: Part 5_It was actually canceled because they just noticed he's been naked under that coat the whole time.  There's a petition on Facebook to get Fox to un-cancel it, and one on Livejournal to get him to take off the coat.", "582_Brakes_It was the funniest 6.5 seconds of my life, although as usual like 80% of it was just Tom and Ray's gasping, hacking laughter.", "583_CNR_Can't and shouldn't.", "584_Unsatisfied_Forever comparing, never evaluating on any external scale.  If you were a sort function, you'd never break the nlogn barrier.", "585_Outreach_Completely implausible? Yes. Nevertheless, worth keeping a can of shark repellent next to the bed.", "586_Mission to Culture_It can't be very MUCH money ... they apparently can't even afford a sampler.  I mean, with a little remixing, some of this could be kinda good!", "587_Crime Scene_I think I see a Mandelbrot set! No, that's just blood splatters. Golly.", "588_Pep Rally_You know, pep rallies weirded me out in high school, and they've only gotten creepier in retrospect.", "589_Designated Drivers_Calling a cab means cutting into beer money.", "590_Papyrus_I secretly, deep in my guilty heart, like Papyrus and don't care if it's overused. [Cue hate mail in beautifully-kerned Helvetica.]", "591_Troll Slayer_We have met the enemy and he is us.", "592_Drama_This happens in geek circles every so often. The 'Hey, this is just a system I can figure out easily!' is also a problem among engineers first diving into the stock market.", "593_Voynich Manuscript_Wait, is that the ORIGINAL voynich manuscript?  Where did you GET that?  Wanna try playing a round of Druids and Dicotyledons?", "594_Period_413 nanohertz, by the way.", "595_Android Girlfriend_Programming the sexbots to enjoy sex seemed a sensible move at the time, but we didn't realize the consequences of their developing fetishes.", "596_Latitude_The G1, especially with the new Android upgrade, is way better than I originally thought.", "597_Addiction_But if you unplug everything, it gets so quiet you hear that high-pitched empty-room hum.  And then the whispers begin.", "598_Porn_I have a thing for corrupt women.", "599_Apocalypse_I wonder if I still have time to go shoot a short film with Kevin Bacon.", "600_Android Boyfriend_Which is, coincidentally, the most unsettling mantlepiece decoration in my house.", "601_Game Theory_Wait, no, that one also loses. How about a nice game of chess?", "602_Overstimulated_My favorite thing to do at parties is to talk judgmentally about people who aren't there.", "603_Idiocracy_People aren't going to change, for better or for worse. Technology's going to be so cool. All in all, the future will be okay! Except climate; we fucked that one up.", "604_Qwertial Aphasia_If this were SMBC, the alt-text drawing thingy would be a giraffe hooker fluttering her eyelashes.", "605_Extrapolating_By the third trimester, there will be hundreds of babies inside you.", "606_Cutting Edge_I remember trying to log in to the original Command and Conquer servers a year or two back and feeling like I was knocking on the boarded-up gates of a ghost town. ", "607_2038_If only we'd chosen 1944-12-02 08:45:52 as the Unix epoch, we could've combined two doomsday scenarios into one and added a really boring scene to that Roland Emmerich movie.", "608_Form_'This space intentionally left blank' is less immediately provocative but more Hofstadterially confusing.", "609_Tab Explosion_Cracked.com is another inexplicable browser narcotic.  They could write a list of '17 worst haircuts in the Ottoman Empire' and I'd read through to the end, then click on all the links at the end.", "610_Sheeple_Hey, what are the odds -- five Ayn Rand fans on the same train!  Must be going to a convention.", "611_Disaster Voyeurism_Hurricane forums are full of excited comments about central pressure and wind speed and comparisons to Camille and 1931 and 1938, with hastily-tacked-on notes about how it will be tragic if anyone dies and they hope it's a dud.", "612_Estimation_They could say \"the connection is probably lost,\" but it's more fun to do naive time-averaging to give you hope that if you wait around for 1,163 hours, it will finally finish.", "613_Threesome_I wanted us to try finding an approximate numeric solution, but noooo.", "614_Woodpecker_If you don't have an extension cord I can get that too.  Because we're friends!  Right?", "615_Avoidance_Hobby: seeing how many menu selections you can get someone to go through before they realize you're not an automated system and/or hang up.", "616_Lease_You should talk to the girl down the hall; I think you'd like her.  Lemme know if you find out why she's ordering all those colored plastic balls.", "617_Understocked_My biology grad student friends tell me that different types of alcohol don't actually have different effects. I trust their expertise, not because of the 'biology' part, but because of the 'grad student'.", "618_Asteroid_My Deep Impact/Little Prince crossover fanfic has been poorly received by the community.", "619_Supported Features_I hear many of you finally have smooth Flash support, but me and my Intel card are still waiting on a kernel patch somewhere in the pipeline before we can watch Jon Stewart smoothly.", "620_Wings_Please do not try any of this and die or get arrested.", "621_Superlative_Stay while I recount the crazy TF2 kill I managed yesterday, my friends.", "622_Haiku Proof_After somewhere around 40 hours, there's no academic reason to go to the class. Only go for the hallucinations.", "623_Oregon_A century later, the harrowing flight of the survivors from Oregon was dramatized in a popular video game.", "624_Branding_Actually, 'RSS&M' is kinda catchy.", "625_Collections_You know what really helps an existential crisis? Wondering how much shelf space to leave for a Terry Pratchett collection.", "626_Newton and Leibniz_YEEEEEEAAAAAAHHHHHH!", "627_Tech Support Cheat Sheet_'Hey Megan, it's your father. How do I print out a flowchart?'", "628_Psychic_You can do a lot better than 1% if you start keeping track of the patterns in what numbers people pick.", "629_Skins_There's Livejournal drama between those who want to wear human suits over fursuits and those who just take off the fursuits.", "630_Time Travel_She also starts every letter with \"Dear Future <your name>\".", "631_Anatomy Text_For many of the anatomy pictures on Wikipedia, I think this is actually not far from reality. They only look all formal and professional due to careful cropping.", "632_Suspicion_Fine, walk away.  I'm gonna go cry into a pint of Ben&Jerry's Brownie Batter(tm) ice cream [link], then take out my frustration on a variety of great flash games from PopCap Games(r) [link].", "633_Blockbuster Mining_The 2007 Bridge to Terebithia trailer put me off too much to see that particular movie, but I am cautiously optimistic about Where the Wild Things Are.", "634_Date_Well, the kid's definitely getting the biology geek phenotype.", "635_Locke and Demosthenes_Dear Peter Wiggin: This letter is to inform you that you have received enough upvotes on your reddit comments to become president of the world.  Please be at the UN tomorrow at 8:00 sharp.", "636_Brontosaurus_Well, sex is like a velociraptor: despite your movie-fueled lifelong neurotic obsession, unlikely to be found in your house.", "637_Scribblenauts_Let me look away and type 'guy who's just jealous that I beat all his MarioKart times' and turn back, and ... yup, there you are again!", "638_The Search_I am so excited about the Kepler mission. This is the second most important thing our species has ever done, right behind inventing the concept of delivery pizza.", "639_Lincoln-Douglas_Stephen Douglas actually died soon after the debates and election, but if you demand historical accuracy in your webcomics you should be reading Hark! A Vagrant.", "640_Tornado Hunter_The Fujita Scale was replaced by the Enhanced Fujita Scale in 2007, but I think 'EF-5' sounds stupid, so I vote we just use the new measurements for assigning numbers but still call them 'F-whatever'.", "641_Free_Asbestos is bad; definitely get the one on the right. Wait -- this one over here has no swine flu!  Now I can't decide.", "642_Creepy_And I even got out my adorable new netbook!", "643_Ohm_More generally, with great power comes great dEnergy/dt.", "644_Surgery_Damn. Not only did he not install it, he sutured a 'Vista-Ready' sticker onto my arm.", "645_RPS_It looks good, but it needs more postfixins.", "646_Conversations_If the dysentery graph looks historically inaccurate it's because I got all my data from Oregon Trail.", "647_Scary_I'm teaching every 8-year-old relative to say this, and every 14-year-old to do the same thing with Toy Story.  Also, Pokemon hit the US over a decade ago and kids born after Aladdin came out will turn 18 next year.", "648_Fall Foliage_And I could replace you with older pictures of you, from back when you looked happy.", "649_Static_I firmly believe that nothing can go wrong on a project if you're wearing one of those wrist things.", "650_Nowhere_I mean, seriously, NOWHERE? For starters, there are like a thousand species of dinosaur.", "651_Bag Check_A laptop battery contains roughly the stored energy of a hand grenade, and if shorted it ... hey!  You can't arrest me if I prove your rules inconsistent!", "652_More Accurate_We live in a world where there are actual fleets of robot assassins patrolling the skies. At some point there, we left the present and entered the future.", "653_So Bad It's Worse_You think it's so legendarily bad that you'll torrent it and sit through it just for the kitschy nerd cred. I, too, once thought as you did.", "654_Nachos_'Cheater!' 'Hey, gaming on wifi? You have only yourself to blame.'", "655_Climbing_Where did you even get this wall? Return it there and stand it back up right now.", "656_October 30th_Not enough houses on your block?  Just hit them at 30-year intervals from here to 2300 and get 10x the candy.", "657_Movie Narrative Charts_In the LotR map, up and down correspond LOOSELY to northwest and southeast respectively.", "658_Orbitals_Except the people filtering in late are the partiers, so you end up with drunken makeouts in the living room and the next roommate to return home has to sleep in the hall lounge orbital.", "659_Lego_Dad, where is Grandpa right now?", "660_Sympathy_Excellent recovery: ... which we could try to use to somehow save your original brother!", "661_Two-Party System_I favor approval voting or IRV chiefly because they mean we might get to bring back The Bull Moose party.", "662_iPhone or Droid_It may be a fundamentally empty experience, but holy crap the Droid's 265 ppi screen is amazing.", "663_Sagan-Man_They laugh now, but within 10 years the city's entire criminal class will have quit to work on space research.", "664_Academia vs. Business_Some engineer out there has solved P=NP and it's locked up in an electric eggbeater calibration routine.  For every 0x5f375a86 we learn about, there are thousands we never see.", "665_Prudence_Moments later, the White Witch rolls up and, confused, tries to tempt the probe with a firmware upgrade.", "666_Silent Hammer_I bet he'll keep quiet for a couple weeks and then-- wait, did you nail a piece of scrap wood to my antique table a moment ago?", "667_SkiFree_And from that day on, I wore this little 'F' key pendant everywhere I went.", "668_Pandora_What?  Oh, no, the 'Enchanted' soundtrack was just playing because Pandora's algorithms are terrible.  [silence] ... (quietly) That's how you knooooooow ...", "669_Experiment_The other two are still lost on the infinite plane of uniform density.", "670_Spinal Tap Amps_Wow, that's less than $200 per ... uh ... that's a good deal!", "671_Stephen and Me_Hey, let go! We were all thinking it! Someone had to speak truth to power!", "672_Suggestions_An hour later: SUGGESTION: LICK HER NIPPLE MORE.", "673_The Sun_Obligatory bad guy: This operation is sheer foolishness, and it's not happening on my watch!  Mainly because I can't figure out how to adjust the time.", "674_Natural Parenting_On one hand, every single one of my ancestors going back billions of years has managed to figure it out.  On the other hand, that's the mother of all sampling biases.", "675_Revolutionary_I mean, what's more likely -- that I have uncovered fundamental flaws in this field that no one in it has ever thought about, or that I need to read a little more?  Hint: it's the one that involves less work.", "676_Abstraction_If I'm such a god, why isn't Maru *my* cat?", "677_Asshole_[Shortly thereafter, at a nearby bakery] ::CRASH:: ::RUMBLE:: ::VRRRRRR:: '... I don't know, officer.  It just scooped up an entire rack of scones and drove away!'", "678_Researcher Translation_A technology that is '20 years away' will be 20 years away indefinitely.", "679_Christmas Plans_Physicists who want to protect traditional Christmas realize that the only way to keep from changing Christmas is not to observe it.", "680_December 25th_If you're turning 27 and were born in the Northeast, maybe you were conceived in the April blizzard of 1982. Imagine: snowed in, candles, massage oil, your mom sporting nothing but her early 80's haircut and a smile ... aren't you glad you read the title-text?", "681_Gravity Wells_This doesn't take into account the energy imparted by orbital motion (or gravity assists or the Oberth effect), all of which can make it easier to reach outer planets.", "682_Force_Force-choking the chicken.", "683_Science Montage_The rat's perturbed; it must sense nanobots! Code grey!  We have a Helvetica scenario!", "684_We Get It_The most brutal way I've ever seen someone handle this was 'Oh, you have a girlfriend. Are you going to get married?'  'I, uh, don't know--' 'Well, do you love her?' '...' 'Anyway, what were you saying about the movie?'", "685_G-Spot_The BBC lead was 'The elusive erogenous zone said to exist in some women may be a myth, say researchers who have hunted for it.'  I couldn't read it with a straight face.", "686_Admin Mourning_And every day it gets harder to fight the urge to su to the user and freak people out.", "687_Dimensional Analysis_Or the pressure at the Earth's core will rise slightly.", "688_Self-Description_The contents of any one panel are dependent on the contents of every panel including itself. The graph of panel dependencies is complete and bidirectional, and each node has a loop. The mouseover text has two hundred and forty-two characters.", "689_FIRST Design_Pool on the roof must've sprung a leak.", "690_Semicontrolled Demolition_I believe the truth always lies halfway between the most extreme claims.", "691_MicroSD_That card holds a refrigerator carton's worth of floppy discs, and a soda can full of those cards could hold the entire iTunes store's music library. Mmmm.", "692_Dirty Harry_Sci-fi has energy weapons because otherwise the people like me who watch it get distracted counting shots.", "693_Children's Fantasy_I was going to be a scientist, but that seems silly now. Magical worlds exist. I've learned a huge truth about our place in the universe. I'm supposed to care about college? I mean, FUCK.", "694_Retro Virus_He says this is the year of Linux on the desktop! The world of Windows will fade any moment now!", "695_Spirit_On January 26th, 2274 Mars days into the mission, NASA declared Spirit a 'stationary research station', expected to stay operational for several more months until the dust buildup on its solar panels forces a final shutdown.", "696_Strip Games_HOW ABOUT A NICE GAME OF STRIP GLOBAL THERMONUCLEAR WAR?", "697_Tensile vs. Shear Strength_Although really, the damage was done when the party planners took the hole punch to the elevator ribbon to hang up the sign.", "698_You Hang Up First_No, YOU stumble past a series of post-breakup hookups in a daze as you slowly realize what you've lost and how unlikely you are ever to get it back first.", "699_Trimester_Also, it's not like anyone actually calls up the Nobel committee to double-check things.", "700_Complexion_Why do all my attempts at science end with me being punched by Batman?  (P.S. benzoyl peroxide soap works great.)", "701_Science Valentine_You don't use science to show that you're right, you use science to become right.", "702_Snow Tracking_I suppose that's more accurately a hare dryer.", "703_Honor Societies_Hey, why do YOU get to be the president of Tautology Clu-- wait, I can guess.", "704_Principle of Explosion_You want me to pick up waffle cones? Oh, right, for the wine. One sec, let me just derive your son's credit card number and I'll be on my way.", "705_Devotion to Duty_The weird sense of duty really good sysadmins have can border on the sociopathic, but it's nice to know that it stands between the forces of darkness and your cat blog's servers.", "706_Freedom_Sometimes I'm terrified to realize how many options other people have.", "707_Joshing_You'll be moved up from 49 of ~7 billion to 31 of ~7 billion.", "708_Sex Dice_You roll for initiative, and ... [roll] ... wow, do you ever take it.", "709_I Am_Great, LO-M. Do you speak Bocce? I'm supposed to find one that speaks Bocce.", "710_Collatz Conjecture_The Strong Collatz Conjecture states that this holds for any set of obsessively-hand-applied rules.", "711_Seismograph_The reverse only works if the subject has a nervous twitch.", "712_Single Ladies_Using a ring to bind someone you covet into your dark and twisted world? Wow, just got the subtext there. Also, the apparently eager BeyoncÃ© would've made one badass NazgÈ\u0097l.", "713_GeoIP_'Meet hot young singles in your mom's basement today'? Man, screw you, GeoIP.", "714_Porn For Women_Yes, there are a lot of longing looks across the bridge of Galactica first, but that's beside the point!", "715_Numbers_The typical internet user (who wants to share) has an IQ of 147 and a 9-inch penis. Well, better than the reverse, I guess.", "716_Time Machine_We never see any time travelers because they all discover it's a huge mistake. This is also why your friend at the lab suddenly looked about a year older recently.", "717_Furtive_... go go gadget video camera.  Go go gadget cup.", "718_The Flake Equation_Statistics suggest that there should be tons of alien encounter stories, and in practice there are tons of alien encounter stories. This is known as Fermi's Lack-of-a-Paradox.", "719_Brain Worms_Hey, it says here that if you dream about your teeth falling out, it means they're spreading.", "720_Recipes_To be fair, the braised and confused newt on a bed of crushed Doritos turned out to be delicious.", "721_Flatland_Also, I apologize for the time I climbed down into your world and everyone freaked out about the lesbian orgy overseen by a priest.", "722_Computer Problems_This is how I explain computer problems to my cat. My cat usually seems happier than me.", "723_Seismic Waves_The USGS operates a really neat email/SMS earthquake notification service (earthquake.usgs.gov/ens/) that allows fine-grained control of notifications.", "724_Hell_There's also a Katamari level where everything is just slightly bigger than you, and a Mario level with a star just out of reach.", "725_Literally_The chemistry experiment had me figuratively -- and then shortly thereafter literally -- glued to my seat.", "726_Seat Selection_Don't click on the wing.", "727_Trade Expert_I mean, it's been almost twenty years. Now, it's possible you're simply embedding Windows directory paths in your URIs, but in that case you need more than just a short lecture.", "728_iPad_Maybe we're all gonna die, but we're gonna die in *really cool ways*.", "729_Laser Pointer_It's a lasing cat-vity!", "730_Circuit Diagram_I just caught myself idly trying to work out what that resistor mass would actually be, and realized I had self-nerd-sniped.", "731_Desert Island_Telescopes and bathyscaphes and sonar probes of Scottish lakes, Tacoma Narrows bridge collapse explained with abstract phase-space maps, some x-ray slides, a music score, Minard's Napoleonic war: the most exciting new frontier is charting what's already here.", "732_HDTV_We're also stuck with blurry, juddery, slow-panning 24fps movies forever because (thanks to 60fps home video) people associate high framerates with camcorders and cheap sitcoms, and thus think good framerates look 'fake'.", "733_Eagle_In the off-seasons, I hire an animal trainer to help confront secret agents with situations which they are unable to report by radio.", "734_Outbreak_Let's get dinner after we promptly destroy all the X-7 we've manufactured.", "735_Floor_We once got grounded when we convinced the FAA to block flights through our county because of ash clouds.", "736_Cemetery_Three headstones down, I got a call from my mom and it went from bad to worse.", "737_Yogurt_I am firmly of the opinion that if something doesn't have a year on it, every time the expiration date rolls around it is good again for the two weeks preceding that date.", "738_Incision_At one point, by force of childhood habit, the doctor accidentally removed three or four organs.", "739_Malamanteau_The article has twenty-three citations, one of which is an obscure manuscript from the 1490's and the other twenty-two are arguments on LanguageLog.", "740_The Tell-Tale Beat_You fancy me mad. Could a madman have outsmarted the greatest electronica/techno artists of our era? Next to fall will be Roderick Usher's house/trance band.", "741_Blogging_I'm looking to virally monetize your eyeballs by selling them for transplants.", "742_Campfire_100 years later, this story remains terrifying--not because it's the local network block, but because the killer is still on IPv4.", "743_Infrastructures_The heartfelt tune it plays is CC licensed, and you can get it from my seed on JoinDiaspora.com whenever that project gets going.", "744_Walkthrough_There's nothing hotter than porn dubbed over with a poorly-mic'd teenager's voice explaining each step in a droning monotone. 'okay, we're almost at the spawn point ... separate the labia, but watch out, there are more inside them ...\"", "745_Dyslexics_And of course I had to redo this like three times because I kept writing 'UNTIE'; I kept doing 'doing 'doing it wrong' wrong' wrong.", "746_Birth_All those GTA marathons during the pregnancy were a bad idea.", "747_Geeks and Nerds_The definitions I grew up with were that a geek is someone unusually into something (so you could have computer geeks, baseball geeks, theater geeks, etc) and nerds are (often awkward) science, math, or computer geeks. But definitions vary.", "748_Worst-Case Scenario_To get serious analyses of hurricanes and oil slicks, see Jeff Masters' blog. To get serious discussions of worst-case scenario thinking, see Bruce Schneier's blog. To get enough Vitamin D, don't read any blogs and go outside instead.", "749_Study_Volunteers needed for a study on transmission of urushiol from digital contact with thin strips of fibrous cellulose pulp.", "750_Book Burning_Of course, since their cautionary tale was reported in a print newspaper, no one read it.", "751_Swimsuit Issue_Parents: talk to your kids about popup blockers. Also, at some point, sex. But crucial fundamentals first!", "752_Phobia_Oh God, the tornado picked up snakes!", "753_Southern Half_Also, if you read his speech at Rice, all his arguments for going to the moon work equally well as arguments for blowing up the moon, sending cloned dinosaurs into space, or constructing a towering penis-shaped obelisk on Mars.", "754_Dependencies_The prereqs for CPSC 357, the class on package management, are CPSC 432, CPSC 357, and glibc2.5 or later.", "755_Interdisciplinary_Replace the pendulums with history students and you'll qualify for a grant!", "756_Public Opinion_News networks giving a greater voice to viewers because the social web is so popular are like a chef on the Titanic who, seeing the looming iceberg and fleeing customers, figures ice is the future and starts making snow cones.", "757_Toot_This is also one of only five identified situations in which a vuvuzela is actually appropriate.", "758_Raptor Fences_If at least one person has a nightmare about being swarmed by hundreds of mouse-sized dromaeosaurids, my work will have been done.", "759_3x9_Handy exam trick: when you know the answer but not the correct derivation, derive blindly forward from the givens and backward from the answer, and join the chains once the equations start looking similar. Sometimes the graders don't notice the seam.", "760_Moria_Someone should really bring them a ladder and remind them to build the Endless Stair *first* next time.", "761_DFS_A breadth-first search makes a lot of sense for dating in general, actually; it suggests dating a bunch of people casually before getting serious, rather than having a series of five-year relationships one after the other.", "762_Analogies_I just call all of them 'synecdoche'.", "763_Workaround_I once worked on a friend's dad's computer. He had the hard drive divided into six partitions, C: through J:, with a 'Documents' directory tree on each one. Each new file appeared to be saved to a partition at random. I knew enough not to ask.", "764_One Two_Cue letters from anthropology majors complaining that this view of numerolinguistic development perpetuates a widespread myth. They get to write letters like that because when you're not getting a real science degree you have a lot of free time. Zing!", "765_Dilution_Dear editors of Homeopathy Monthly: I have two small corrections for your July issue.  One, it's spelled \"echinacea\", and two, homeopathic medicines are no better than placebos and your entire magazine is a sham.", "766_Green Flash_The exact cause of the phenomenon is unknown, but it's thought to be linked to atmospheric refraction and you getting a really cool car.", "767_Temper_Mr. Rogers projected an air of genuine, unwavering, almost saintly pure-hearted decency. But when you look deeper, at the person behind the image ... that's exactly what you find there, too. He's exactly what he appears to be.", "768_1996_College Board issues aside, I have fond memories of TI-BASIC, writing in it a 3D graphing engine and a stock market analyzer. With enough patience, I could make anything ... but friends. (Although with my chatterbot experiments, I certainly tried.)", "769_War_They offered to make me a green beret, but I liked my regular one. Although it gets kind of squashed under my helmet.", "770_All the Girls_You know that I'll never leave you. Not as long as she's with someone.", "771_Period Speech_The same people who spend their weekends at the Blogger Reenactment Festivals will whine about the anachronisms in historical movies, but no one else will care.", "772_Frogger_I understand you and your team worked hard on this, but when we said to make it more realistic, we meant the graphics.", "773_University Website_People go to the website because they can't wait for the next alumni magazine, right? What do you mean, you want a campus map? One of our students made one as a CS class project back in '01!  You can click to zoom and everything!", "774_Atheists_'But you're using that same tactic to try to feel superior to me, too!' 'Sorry, that accusation expires after one use per conversation.'", "775_Savannah Ancestry_She's a perfectly nice lady from a beautiful city, and there's no reason to be mean just because she thinks a quarterback is a river in Egypt.", "776_Still No Sleep_I'm not listening to you.  I mean, what does a SQUIRREL know about mental health?", "777_Pore Strips_I'm sure they're a harmful tool of the cosmetics-industrial complex and all, but my goodness do those strips ever work to pull gunk out of your pores. I was shocked, disgusted, and vaguely fascinated by the result.", "778_Scheduling_'How about a little ... *family growth*?'  'Dude, that's not until round two.'", "779_Anxiety_Don't need any, thanks. I have a backscattering fetish.", "780_Sample_There are two or three songs out there with beeps in the chorus that sound exactly like the clock radio alarm I had in high school, and hearing it makes me think my life since junior year has been a dream I'm about to wake up from.", "781_Ahead Stop_They actually started the reversed-text practice in 1977 -- not for ease-of-reading reasons, but because too many people were driving backward down the highway blasting the Star Wars opening theme.", "782_Desecration_It gets worse! You know that wizened old monk with the gypsy wife whose voodoo shop we smash up every day after school?", "783_I Don't Want Directions_Yes, I understand that the turn is half a mile past the big field, but my GPS knows that, too.  This would be easier if you weren't about to ask me to repeat it all back to you.", "784_Falling Asleep_Sweet unintersecting dreams!", "785_Open Mic Night_Ever notice how the more successful observational comics become, the more their jokes focus on flying and hotels?", "786_Exoplanets_I'm just worried that we'll all leave and you won't get to come along!", "787_Orbiter_Normally, the Shuttle can't quite safely reach the orbital inclination required to pass over both those points from a Canaveral launch, but this is an alternate history in which either it launches from Vandenberg or everyone hates the Outer Banks.", "788_The Carriage_I learned from Achewood that since this poem is in ballad meter, it can be sung to the tune of Gilligan's Island.  Since then, try as I might, I haven't ONCE been able to read it normally.", "789_Showdown_The tumbleweed then tried to roll off into the sunset, but due to the Old West's placement north of the subtropical ridge, the prevailing winds were in the wrong direction.", "790_Control_Which, at one point, led to a study showing that LSD produces no more hallucinations than a placebo.", "791_Leaving_What'll I say -- \"I was staring at some cat vomit when I got the news?\"", "792_Password Reuse_It'll be hilarious the first few times this happens.", "793_Physicists_If you need some help with the math, let me know, but that should be enough to get you started! Huh? No, I don't need to read your thesis, I can imagine roughly what it says.", "794_Inside Joke_I've looked through a few annotated versions of classic books, and it's shocking how much of what's in there is basically pop-culture references totally lost on us now.", "795_Conditional Risk_'Dude, wait -- I'm not American! So my risk is basically zero!'", "796_Bad Ex_Since the goatee, glasses, and Seltzer & Friedberg DVD collection didn't tip you off, there will be a $20 negligence charge for this service.", "797_debian-main_dpkg: error processing package (--purge): subprocess pre-removal script returned error exit 163: OH_GOD_THEYRE_INSIDE_MY_CLOTHES", "798_Adjectives_'Fucking ineffable' sounds like someone remembering how to do self-censorship halfway through a phrase.", "799_Stephen Hawking_'Guys?  The Town is supposed to be good, and I thou--' 'PHYSICIST STEPHEN HAWKING DECLARES NEW FILM BEST IN ALL SPACE AND TIME' 'No, I just heard that--' 'SHOULD SCIENCE PLAY A ROLE IN JUDGING BEN AFFLECK?' 'I don't think--' 'WHAT ABOUT MATT DAMON?'", "800_Beautiful Dream_Lucky. In MY dream, all the people who grew up loving The Giving Tree paired up with all the students who had weird dreams after reading The Metamorphosis. That one was more confusing.", "801_Golden Hammer_Took me five tries to find the right one, but I managed to salvage our night out--if not the boat--in the end.", "802_Online Communities 2_Best trivia I learned while working on this: 'Man, Farmville is so huge! Do you realize it's the second-biggest browser-based social-networking-centered farming game in the WORLD?' Then you wait for the listener to do a double-take.", "803_Airfoil_This is a fun explanation to prepare your kids for; it's common and totally wrong. Good lines include 'why does the air have to travel on both sides at the same time?' and 'I saw the Wright brothers plane and those wings were curved the same on the top and bottom!'", "804_Pumpkin Carving_The Banach-Tarski theorem was actually first developed by King Solomon, but his gruesome attempts to apply it set back set theory for centuries.", "805_Paradise City_Take me down to the paradise municipality / where the grass is mauve and the girls aren't fromthisreality.", "806_Tech Support_I recently had someone ask me to go get a computer and turn it on so I could restart it. He refused to move further in the script until I said I had done that.", "807_Connected_Or love in general, for that matter. It just leads to the idea that either your love is pure, perfect, and eternal, and you are storybook-compatible in every way with no problems, or you're LYING when you say 'I love you'.", "808_The Economic Argument_Not to be confused with 'making money selling this stuff to OTHER people who think it works', which corporate accountants and actuaries have zero problems with.", "809_Los Alamos_The test didn't (spoiler alert) destroy the world, but the fact that they were even doing those calculations makes theirs the coolest jobs ever.", "810_Constructive_And what about all the people who won't be able to join the community because they're terrible at making helpful and constructive co-- ... oh.", "811_Starlight_Don't worry! From the light's point of view, home and your eye are in the same place, and the journey takes no time at all! Relativity saves the day again.", "812_Glass_I read in this one article that the breaking of electroweak symmetry is the reason we have SOULS. This guy with a degree said so!", "813_One-Liners_'Upgrade to the latest version of Adobe Flash player to view THIS content, bitch.' ::triggers detonator::", "814_Diode_And the worst part is you won't apologize.", "815_Mu_As the CoKF approaches 0, productivity goes negative as you pull OTHER people into chair-spinning contests.", "816_Applied Math_Dear Reader: Enclosed is a check for ninety-eight cents. Using your work, I have proven that this equals the amount you requested.", "817_Mutual_A universe that needed someone to observe it in order to collapse it into existence would be a pretty sorry universe indeed.", "818_Illness_<3 If there's anything you can do, I'll let you know. For the moment, any simple distracting online games sent to sick@xkcd.com will not go unappreciated [EDIT: Holy crap 2,700 games before noon. I love you guys; thank you. They will be passed along and played by us all.]", "819_Five-Minute Comics: Part 1_The wolves thin the RAID arrays, removing the slowest and weakest disks to keep the average seek speed high.", "820_Five-Minute Comics: Part 2_Dear Wiccan readers: I understand modern Wiccans are not usually all about the curses and hexes. But Darth Vader was recently converted from Episcopalianism and he's still figuring it all out.", "821_Five-Minute Comics: Part 3_Resulting in The Little Rock 9x + C.", "822_Guest Week: Jeph Jacques (Questionable Content)_Guest comic by Jeph Jacques of Questionable Content, whose internal monologue hasn't been speaking to him for the past three years.", "823_Guest Week: David Troupes (Buttercup Festival)_Guest comic by David Troupes of Buttercup Festival, who is living in that lovely tree outside your window.", "824_Guest Week: Bill Amend (FoxTrot)_Guest comic by Bill Amend of FoxTrot, an inspiration to all us nerdy-physics-majors-turned-cartoonists, of which there are an oddly large number.", "825_Guest Week: Jeffrey Rowland (Overcompensating)_Guest comic by Jeffrey Rowland of Overcompensating/Wigu.  Jeffrey is famous as the picture on the Wikipedia article on 'Necrosis'.", "826_Guest Week: Zach Weiner (SMBC)_Guest comic by Zach Weiner of Saturday Morning Breakfast Cereal. When I was stressed out, Zach gave me a talk that was really encouraging and somehow involved nanobots.", "827_Business Idea_We didn't believe you at first, but we asked like three people who were at that party. They not only corroborated your story, but even said you totally mentioned wanting to start a company someday. Sorry! If this isn't enough money, let us know.", "828_Positive Attitude_Having a positive attitude is almost tautologically good for your mental health, and extreme stress can hurt your immune system, but that doesn't mean you should feel like shit for feeling like shit.", "829_Arsenic-Based Life_According to a new paper published in the journal Science, reporters are unable to thrive in an arsenic-rich environment.", "830_Genetic Analysis_There's still a chance you were conceived via IVF. But we've checked your mom's college yearbook photos, and whether or not she and your father had sex, it's clear that ... listen, I know this is hard for you.", "831_Weather Radar_Ever notice how there aren't as many thunderstorms now as there were when you were a kid?  Much like 'the shuffle on my MP3 player has a bias', this is occasionally true but universally believed. Brains are so interesting!", "832_Tic-Tac-Toe_The only winning move is to play, perfectly, waiting for your opponent to make a mistake.", "833_Convincing_And if you labeled your axes, I could tell you exactly how MUCH better.", "834_Wikileaks_STUDENTS ARE CALLING PRESIDENT JOHNSON EN MASSE TO PROTEST THE BOMBING AND IT'S JAMMED THE WHITE HOUSE SWITCHBOARD. COULD THEY COLLAPSE OUR CRITICAL PHONE SYSTEMS? HAS THE FIRST TELEPHONE WAR BEGUN? STAY TUNED FOR MORE ON THIS DANGEROUS NEW TECHNOLOGY.", "835_Tree_Not only is that terrible in general, but you just KNOW Billy's going to open the root present first, and then everyone will have to wait while the heap is rebuilt.", "836_Sickness_At least, with p<0.05 confidence.", "837_Coupon Code_This also guarantees he won't be one of the ones to get a bobcat.", "838_Incident_He sees you when you're sleeping, he knows when you're awake, he's copied on /var/spool/mail/root, so be good for goodness' sake.", "839_Explorers_We're going to have to work together to get over our hangups if we're going to learn to move on Catan's hexagonal grid. It's bad enough that we lost our crew of pawns when we passed within firing range of Battleship.", "840_Serious_Not to be confused with Serious PuTTY, the Windows terminal client where everything is in Impact.", "841_Audiophiles_For years, I took the wrong lesson from that Monster Cable experiment and only listened to my music through alligator-clipped coat hangers.", "842_Mark_I'm a solipsistic conspiracy theorist. I'm sure I must be up to something, and I will not stop until I find out what.", "843_Misconceptions_'Grandpa, what was it like in the Before time?' 'It was hell. People went around saying glass was a slow-flowing liquid. You folks these days don't know how good you have it.'", "844_Good Code_You can either hang out in the Android Loop or the HURD loop.", "845_Modern History_During the week, I research my character by living in his house and raising his children.", "846_Dental Nerve_WAKE up in the MORning and my BREATH ain't PREtty / and noBODY'S gonna KISS me if my MOUTH smells SHItty / so I ALways brush my TEETH before I START on the JACK / sure, my DRINKing's out of HAND, but I'm conTROLLing my PLAQUE.", "847_Stingray Nebula_EÃ¤rendil will patrol the walls of night only until the sun reaches red giant stage, engulfing the Morning Star on his brow. Light and high beauty are passing things as well.", "848_3D_The LINACs in the glasses frames can barely manage one MeV. You should've gone to the screening at CERN.", "849_Complex Conjugate_Fun fact: if you say this every time a professor does something to a complex-number equation that drops the imaginary part, they'll eventually move the class to another room and tell everyone else except you.", "850_World According to Americans_It's not our fault we caught a group on their way home from a geography bee. And they taught us that Uzbekistan is one of the world's two doubly-landlocked countries!", "851_Na_I hear that there are actual lyrics later on in Land of 1,000 Dances, but other than the occasional 'I said,' I've never listened long enough to hear any of them.", "852_Local g_In Rio de Janeiro in 2016, the same jump will get an athlete 0.25% higher (>1cm) than in London four years prior.", "853_Consecutive Vowels_But the windows! What if there's a voyeur watchi-- wait, now I'm turned on too.", "854_Learning to Cook_And yet I never stop thinking, 'sure, these ingredients cost more than a restaurant meal, but think how many meals I'll get out of them! Especially since each one will have leftovers!'", "855_1999_'Whoa, twenty-two in two hours!' 'Your site got twenty-two hundred hits in two hours?' 'No. Twenty-two. But still, that's like half the people on the internet!'", "856_Trochee Fixation_If you Huffman-coded all the 'random' things everyone on the internet has said over the years, you'd wind up with, like, 30 or 40 bytes *tops*.", "857_Archimedes_Give a man a fish, or he will destroy the only existing vial of antidote.", "858_Milk_It's not hard when you have the same thought like 40 or 50 percent of the time.", "859_(_Brains aside, I wonder how many poorly-written xkcd.com-parsing scripts will break on this title (or ;;\"''{<<[' this mouseover text.\"", "860_Never Do This_I call Rule 34 on The Secret House.", "861_Wisdom Teeth_I heard the general anesthesia drugs can cause amnesia, so when I woke up mid-extraction I started taking notes on my hand so I'd remember things later. I managed 'AWAKE BUT EVERYTHING OK' before the dental assistant managed to find and confiscate all my pens.", "862_Let Go_After years of trying various methods, I broke this habit by pitting my impatience against my laziness. I decoupled the action and the neurological reward by setting up a simple 30-second delay I had to wait through, in which I couldn't do anything else, before any new page or chat client would load (and only allowed one to run at once). The urge to check all those sites magically vanished--and my 'productive' computer use was unaffected.", "863_Major in the Universe_I hear Steven Levitt is writing a book analyzing A.J. Jacobs' quest to spend a year reading everything Malcolm Gladwell ever wrote. The audiobook will be narrated by Robert Krulwich of Radiolab.", "864_Flying Cars_It's hard to fit in the backseat of my flying car with my android Realdoll when we're both wearing jetpacks.", "865_Nanobots_I think the IETF hit the right balance with the 128 bits thing. We can fit MAC addresses in a /64 subnet, and the nanobots will only be able to devour half the planet.", "866_Compass and Straightedge_The Greeks long suspected this, but it wasn't until April 12th of 1882 that Ferdinand von Lindemann conclusively proved it when he constructed himself the most awesome birthday party possible and nobody showed up.", "867_Herpetology_Birds are Aves, which is part of the clade Theropoda, which is in Saurischia, which is in Dinosauria. Those birds outside our windows are dinosaurs. We can clear out the rest of our brains because we now have the best fact.", "868_Nolan Chart_Also in the right quadrant are NFPA-compliant chemical manufacturers and Sir Charles Wheatstone. Sharing the top with the internet libertarians are Nate Silver and several politically-active kite designers.", "869_Server Attention Span_They have to keep the adjacent rack units empty. Otherwise, half the entries in their /var/log/syslog are just 'SERVER BELOW TRYING TO START CONVERSATION *AGAIN*.' and 'WISH THEY'D STOP GIVING HIM SO MUCH COFFEE IT SPLATTERS EVERYWHERE.'", "870_Advertising_I remember the exact moment in my childhood when I realized, while reading a flyer, that nobody would ever spend money solely to tell me they wanted to give me something for nothing. It's a much more vivid memory than the (related) parental Santa talk.", "871_Charity_I usually respond to someone else doing something good by figuring out a reason that they're not really as good as they seem. But I've been realizing lately that there's an easier way to handle these situations, and it involves zero internet arguments.", "872_Fairy Tales_Goldilocks' discovery of Newton's method for approximation required surprisingly few changes.", "873_FPS Mod_Wait, that second one is a woman?  ... wait, if that bothers me, then why doesn't ... man, this game is no fun anymore.", "874_Time Management_I never trust anyone who's more excited about success than about doing the thing they want to be successful at.", "875_2009 Called_2017 called, but I couldn't understand what they were saying over all the screams.", "876_Trapped_Socrates could've saved himself a lot of trouble if he'd just brought a flashlight, tranquilizer gun, and a bunch of rescue harnesses.", "877_Beauty_The best hugs are probably from hagfish, which can extrude microscopic filaments that convert a huge volume of water around them to slime in seconds. Instant cozy blanket!", "878_Model Rail_I don't know what's more telling--the number of pages in the Wikipedia talk page argument over whether the 1/87.0857143 scale is called \"HO\" or \"H0\", or the fact that within minutes of first hearing of it I had developed an extremely strong opinion on the issue.", "879_Lamp_'That was definitely not in my top three wishes.' 'Who said anything about YOUR wishes?'", "880_Headache_I'm only willing to visit placid lakes, salt flats, and painting exhibits until the world's 3D technology improves.", "881_Probability_My normal approach is useless here, too.", "882_Significant_'So, uh, we did the green study again and got no link. It was probably a--' 'RESEARCH CONFLICTED ON GREEN JELLY BEAN/ACNE LINK; MORE STUDY RECOMMENDED!'", "883_Pain Rating_If it were a two or above I wouldn't be able to answer because it would mean a pause in the screaming.", "884_Rogers St._'We can also use middle names in place of first pet's names, but yours is something incomprehensible about dropping tables.'", "885_Recycling_And given how much of my stuff they go through, they definitely know where I live.", "886_Craigslist Apartments_$1600 / 1386153BR 3BATH, MODERN SLIDING DOORS, GUEST ROOMS, GARBAGE DISPOSAL. FREE MANDATORY PARKING (ENFORCED). CONVENIENT TO ALDERAAN.", "887_Future Timeline_Not shown: the approximately 30,000 identical, vaguely hysterical articles titled \"WHITE PEOPLE IN [THE US/BRITAIN] TO BECOME MINORITY BY [YEAR]!\", which came up for basically any year I put in.", "888_Heaven_If you've never had sex, this is what it feels like. Complete with the brief feeling of satisfaction, followed by ennui, followed by getting bored and trying to make it happen again.", "889_Turtles_You're a turtle!", "890_Etymology_For some reason, my childhood suspension of disbelief had no problem with the fact that this ancient galaxy is full of humans, but was derailed by language. There's no Asia OR Europe there, so where'd they get all the Indo-European roots?", "891_Movie Ages_If you're 15 or younger, then just remember that it's nevertheless probably too late to be a child prodigy.", "892_Null Hypothesis_Hell, my eighth grade science class managed to conclusively reject it just based on a classroom experiment. It's pretty sad to hear about million-dollar research teams who can't even manage that.", "893_65 Years_The universe is probably littered with the one-planet graves of cultures which made the sensible economic decision that there's no good reason to go into space--each discovered, studied, and remembered by the ones who made the irrational decision.", "894_Progeny_I tell my children 'it's not whether you win or lose, it's how you play the game.' I'm trying to take the edge off their competitive drive to ensure that I can always beat them.", "895_Teaching Physics_Space-time is like some simple and familiar system which is both intuitively understandable and precisely analogous, and if I were Richard Feynman I'd be able to come up with it.", "896_Marie Curie_Although not permanently.", "897_Elevator Inspection_Even governmental elevator inspectors get bored halfway through asking where the building office is.", "898_Chain of Command_Themistocles said his infant son ruled all Greece -- \"Athens rules all Greece; I control Athens; my wife controls me; and my infant son controls her.\" Thus, nowadays the world is controlled by whoever buys advertising time on Dora the Explorer.", "899_Number Line_The Wikipedia page \"List of Numbers\" opens with \"This list is incomplete; you can help by expanding it.\"", "900_Religions_But to us there is but one God, plus or minus one. --1 Corinthians 8:6Â±2.", "901_Temperature_And the baby has a fever.", "902_Darmok and Jalad_I wonder how often Patrick Stewart has Darmok flashbacks when talking to Star Trek fans.", "903_Extended Mind_Wikipedia trivia: if you take any article, click on the first link in the article text not in parentheses or italics, and then repeat, you will eventually end up at \"Philosophy\".", "904_Sports_Also, all financial analysis. And, more directly, D&D.", "905_Homeownership_New research shows over 60% of the financial collapse's toxic assets were created by power drills.", "906_Advertising Discovery_When advertisers figure this out, our only weapon will be blue sharpies and \"[disputed]\".", "907_Ages_Every age: \"I'm glad I'm not the clueless person I was five years ago, but now I don't want to get any older.\"", "908_The Cloud_There's planned downtime every night when we turn on the Roomba and it runs over the cord.", "909_Worst-Case Shopping_Wait a minute. If I'm escaping from a submarine at 50 meters, then I'll *definitely* need a flashlight to find air pockets for gradual decompression on the way up. Time to start shopping professional dive lights.", "910_Permanence_This hostname is going in dozens of remote config files. Changing a kid's name is comparatively easy!", "911_Magic School Bus_At my OLD school, we used Microsoft Encarta 2005.", "912_Manual Override_I think you mean 'GNU Info Override'.", "913_Core_If you're a geologist or geophysicist and you don't introduce yourself by saying your name, then gesturing downward and saying \"... and I study that\", I don't know what you're doing with your life.", "914_Ice_On the plus side, she wrote 'Welcome to the AAA Club!' in lipstick on the bathroom mirror, and left me a membership/roadside assistance card on the counter.", "915_Connoisseur_Our brains have just one scale, and we resize our experiences to fit.", "916_Unpickable_The safe is empty except for an unsolved 5x5 Rubik's cube.", "917_Hofstadter_\"This is the reference implementation of the self-referential joke.\"", "918_Google+_On one hand, you'll never be able to convince your parents to switch. On the other hand, you'll never be able to convince your parents to switch!", "919_Tween Bromance_Verbiage. Va-jay-jay. Irregardless.", "920_YouTube Parties_This reminds me of that video where ... no? How have you not seen that? Oh man, let me find it. No, it's ok, we can go back to your video later.", "921_Delivery Notification_You can arrange a pickup of your sword in Rivendell between the hours of noon and 7:00 PM.", "922_Fight Club_I'm not saying it's all bad, but that movie has not aged as well as my teenage self in 2000 was confident it would.", "923_Strunk and White_The best thing about Strunk/White fanfiction is that it's virtually guaranteed to be well written.", "924_3D Printer_I just can't wait for the Better Homes and Gardens list of helpful tips for household reuse of sixteen-inch acrylonitrile-butadiene-styrene phalluses.", "925_Cell Phones_He holds the laptop like that on purpose, to make you cringe.", "926_Time Vulture_In a way, all vultures are Time Vultures; some just have more patience than others.", "927_Standards_Fortunately, the charging one has been solved now that we've all standardized on mini-USB. Or is it micro-USB? Shit.", "928_Mimic Octopus_Even if the dictionaries are starting to give in, I refuse to accept 'octopi' as a word mainly because--I'm not making this up--there's a really satisfying climactic scene in the Orson Scott Card horror novel 'Lost Boys' which hinges on it being an incorrect pluralization.", "929_Speculation_'I was pretty good at skeet shooting, but was eventually kicked off the range for catching the clay pigeons in a net and dispatching them execution-style.'", "930_Days of the Week_Not pictured: the elongated Halley's-Comet-like orbit of every Rebecca Black lyric.", "931_Lanes_Each quarter of the lanes from left to right correspond loosely to breast cancer stages one through four (at diagnosis).", "932_CIA_It was their main recruiting poster, hung nearly ten feet up a wall! This means the hackers have LADDER technology! Are we headed for a future where everyone has to pay $50 for one of those locked plexiglass poster covers? More after the break ...", "933_Tattoo_I calculate that the electrons in radiation therapy hit you at 99.8% of the speed of light, and the beam used in a 90-second gamma ray therapy session could, if fired with less precision, kill a horse (they did not let me test this).", "934_Mac/PC_It's fun to watch browsers fumblingly recapitulate the history of window management. Someday we'll have xmonad as a Firefox extension.", "935_Missed Connections_The Street View van isn't going to find out anything Google won't already know from reading my email.", "936_Password Strength_To anyone who understands information theory and security and is in an infuriating argument with someone who does not (possibly involving mixed case), I sincerely apologize.", "937_TornadoGuard_The bug report was marked 'could not reproduce'.", "938_T-Cells_'We're not sure how to wipe out the chimeral T-cells after they've destroyed the cancer. Though I do have this vial of smallpox ...'", "939_Arrow_'The Return of the Boomerang' would make a great movie title.", "940_Oversight_I felt so clever when I found a way to game the Fitocracy system by incorporating a set of easy but high-scoring activities into my regular schedule. Took me a bit to realize I'd been tricked into setting up a daily exercise routine.", "941_Depth Perception_I've looked at clouds from both sides now.", "942_Juggling_Later: 'Why is there a book hovering over the trash can?'", "943_Empirical_I'm as surprised as you!", "944_Hurricane Names_After exhausting the OED, we started numbering them. When overlapping hurricanes formed at all points on the Earth's surface, and our scheme was foiled by Cantor diagonalization, we just decided to name them all \"Steve\". Your local forecast tomorrow is \"Steve\". Good luck.", "945_I'm Sorry_You know I've always hated her.", "946_Family Decals_My decal set has no adults, just a sea of hundreds of the little girl figures closing in around a single cat.", "947_Investing_But Einstein said it was the most powerful force in the universe, and I take all my investment advice from flippant remarks by theoretical physicists making small talk at parties.", "948_AI_And they both react poorly to showers.", "949_File Transfer_Every time you email a file to yourself so you can pull it up on your friend's laptop, Tim Berners-Lee sheds a single tear.", "950_Mystery Solved_The Roanoke Lost Colonists founded Roanoke, the Franklin Expedition reached the Pacific in 2009 when the Northwest Passage opened, and Jimmy Hoffa currently heads the Teamsters Union--he just started going by 'James'.", "951_Working_And if you drive a typical car more than a mile out of your way for each penny you save on the per-gallon price, it doesn't matter how worthless your time is to you--the gas to get you there and back costs more than you save.", "952_Stud Finder_According to every stud finder I've tried to use, my walls contain a rapidly shifting network of hundreds and hundreds of studs.", "953_1 to 10_If you get an 11/100 on a CS test, but you claim it should be counted as a 'C', they'll probably decide you deserve the upgrade.", "954_Chin-Up Bar_Those few who escaped found the emergency cutoff box disabled. The stampede lasted two hours and reached the bottom three times.", "955_Neutrinos_I can't speak to the paper's scientific merits, but it's really cool how on page 10 you can see that their reference GPS beacon is sensitive enough to pick up continential drift under the detector (interrupted halfway through by an earthquake).", "956_Sharing_In the new edition of The Giving Tree, the tree uses social tools to share with its friend all the best places to buy things.", "957_Development_Funding was quickly restored to the NHC and the APA was taken back off hurricane forecast duty.", "958_Hotels_'Rating: 1/5. Room filled to brim with semen, and when front desk clerk opened mouth to talk, bedbugs poured out.'", "959_Caroling_For a thousand generations we vowed never to forget how his soldiers feasted on our brother Stephen.", "960_Subliminal_Once you see it, you can't help seeing it every time. Until your body finishes metabolizing the mushrooms.", "961_Eternal Flame_There's always the hope that if you sit and watch for long enough, the beachball will vanish and the thing it interrupted will return.", "962_The Corliss Resolution_And no avian society ever develops space travel because it's impossible to focus on calculus when you could be outside flying.", "963_X11_Thomas Jefferson thought that every law and every constitution should be torn down and rewritten from scratch every nineteen years--which means X is overdue.", "964_Dorm Poster_I was going to record an album with that cover under the name \"PINK FTFY\", so it'd come after them on the store CD rack. But at this point music stores are just rooms where CDs are set out to age before they're thrown away, so probably nobody would see it.", "965_Elements_Of all the nations, the armies of the ununoctium-benders are probably the least intimidating. The xenon-benders come close, but their flickery signs are at least effective for propaganda.", "966_Jet Fuel_The 'controlled demolition' theory was concocted by the government to distract us. '9/11 was an inside job' was an inside job!", "967_Prairie_Colorado is working to develop coherent amber waves, which would allow them to finally destroy Kansas and Nebraska with a devastating but majestic grain laser.", "968_Everything_I wanna hold your hand so I don't fall out of your gyrocopter.", "969_Delta-P_If you fire a Portal gun through the door of the wardrobe, space and time knot together, which leads to a frustrated Aslan trying to impart Christian morality to the Space sphere.", "970_The Important Field_I hear in some places, you need one form of ID to buy a gun, but two to pay for it by check. It's interesting who has what incentives to care about what mistakes.", "971_Alternative Literature_I just noticed CVS has started stocking homeopathic pills on the same shelves with--and labeled similarly to--their actual medicine. Telling someone who trusts you that you're giving them medicine, when you know youâ\u0080\u0099re not, because you want their money, isnâ\u0080\u0099t just lying--itâ\u0080\u0099s like an example youâ\u0080\u0099d make up if you had to illustrate for a child why lying is wrong.", "972_November_November marks the birthday of Charles Schulz, pioneer of tongue awareness.", "973_MTV Generation_If you identified with the kids from The Breakfast Club when it came out, you're now much closer to the age of Principal Vernon.", "974_The General Problem_I find that when someone's taking time to do something right in the present, they're a perfectionist with no ability to prioritize, whereas when someone took time to do something right in the past, they're a master artisan of great foresight.", "975_Occulting Telescope_Type II Kardashev civilizations eventually completely enclose their planetary system in a Dyson sphere because space is way too big to look at all the time.", "976_Sail_It only works a few times before you have to capsize the boat in a soap lagoon again.", "977_Map Projections_What's that? You think I don't like the Peters map because I'm uncomfortable with having my cultural assumptions challenged?  Are you sure you're not ... ::puts on sunglasses:: ... projecting?", "978_Citogenesis_I just read a pop-science book by a respected author. One chapter, and much of the thesis, was based around wildly inaccurate data which traced back to ... Wikipedia. To encourage people to be on their toes, I'm not going to say what book or author.", "979_Wisdom of the Ancients_All long help threads should have a sticky globally-editable post at the top saying 'DEAR PEOPLE FROM THE FUTURE: Here's what we've figured out so far ...'", "980_Money_There, I showed you it.", "981_Porn Folder_Eww, gross, you modified link()? How could you enjoy abusing a filesystem like that?", "982_Set Theory_Proof of Zermelo's well-ordering theorem given the Axiom of Choice: 1: Take S to be any set. 2: When I reach step three, if S hasn't managed to find a well-ordering relation for itself, I'll feed it into this wood chipper. 3: Hey, look, S is well-ordered.", "983_Privacy_Eventual headline: 'University Researchers Create Life in Lab! Darkness, Faulty Condoms Blamed.'", "984_Space Launch System_The SLS head engineer plans to invite Shania Twain to stand under the completed prototype, then tell her, 'I don't expect you to date me just because I'm a rocket scientist, but you've gotta admit--this is pretty fucking impressive.'", "985_Percentage Points_Grayton also proposed making college scholarships available exclusively to sexually active teens, amnesty for illegal immigrants who create room for themselves by killing a citizen, and a graduated income tax based on penis size. He has been endorsed by Tracy Morgan, John Wilkes Booth's ghost, and the Time Cube guy.", "986_Drinking Fountains_I've always wondered whether you could drink slowly enough, and eliminate fast enough, that you just sort of peed continuously. But I'm afraid to try because I worry someone might call while I'm doing it and ask what I'm up to, and I won't be able to think of a lie.", "987_Potential_The bunch of disadvantaged kids I was tutoring became too good at writing, and their essays were forcing me to confront painful existential questions, so I started trying to turn them on to drugs and crime instead.", "988_Tradition_An 'American tradition' is anything that happened to a baby boomer twice.", "989_Cryogenics_'Welcome to the future! Nothing's changed.' was the slogan of my astonishingly short-lived tech startup.", "990_Plastic Bags_The high I feel when I actually remember to bring my reusable bags to the store--and take them inside rather than leaving them in the parked car--can last for days.", "991_Phantom Menace_We could go to the theater across town and see if it's opened THERE yet, but we don't want to lose our place in line.", "992_Mnemonics_'Sailor Moon's head exploded once' and 'Some men have explosive orgasms' both work for the Great Lakes from west to east (Paddle-to-the-Sea order).", "993_Brand Identity_Legally-mandated information would be printed on the back or discreetly along the bottom. In small letters under the nutrition information it would say 'Like our products? Visit our website!' There would be no URL.", "994_Advent Calendar_I think you could get up to about 11:59:57 before you'd have trouble swallowing the chocolates fast enough. At that point, you'd need some kind of a liquify-and-chug apparatus to get up over the 11:59:59 barrier. Anyway, Merry Christmas!", "995_Coinstar_Plus they take like 9%.", "996_Making Things Difficult_Favorite mastectomy breast prosthesis idea: a fake boob containing a spare rechargable battery, accessed via a nipple USB port. Complete with a ring of LED charge indicators in the areola!", "997_Wait Wait_You can't stab Carl Kasell. He sounds all slow and stentorian, but he moves like a snake.", "998_2012_To compensate for this, I plan to spend 2013 doing nothing but talking about Mayans. My relationships with my friends and family may not fare well.", "999_Cougars_If you're lying in bed tonight and you see yellow eyes glinting in your window, are you being stalked by a puma, a mountain lion, a panther, a catamount, or a cougar? Trick question--in North America, they're all names for the same species, Puma concolor! Isn't learning fun? Anyway, sleep tight!", "1000_1000 Comics_Thank you for making me feel less alone.", "1001_AAAAAA_'ARE YOU TURNED ON YET?' 'I DON'T THINK SO--ARE YOU?' 'MAYBE A LITTLE!' 'OK, FIVE MORE MINUTES.'", "1002_Game AIs_The top computer champion at Seven Minutes in Heaven is a Honda-built Realdoll, but to date it has been unable to outperform the human Seven Minutes in Heaven champion, Ken Jennings.", "1003_Adam and Eve_Abel and Steve would've been fine! I like Steve!", "1004_Batman_I'm really worried Christopher Nolan will kill a man dressed like a bat in his next movie. (The man will be dressed like a bat, I mean. Christopher Nolan won't be, probably.)", "1005_SOPA_In protest of SOPA, I'm currently getting totally blacked out.", "1006_Sloppier Than Fiction_Roger Ebert once called you directionless and unwatchable.", "1007_Sustainable_Though 100 years is longer than a lot of our resources.", "1008_Suckville_Suckville is considered by the Census Bureau to be part of the Detroit metropolitan statistical area, despite not being located anywhere near Detroit.", "1009_Sigh_If you're annoying enough, you can get them to respond with an involuntary second sigh and get a rhythm going.", "1010_Etymology-Man_'I can't believe I'm saying this, but I wish Aquaman were here instead--HE'D be able to help.'", "1011_Baby Names_I've been trying for a couple years now but I haven't been able to come up with a name dumber than 'Renesmee'.", "1012_Wrong Superhero_Hi! Someone call for me? I'm a superhero who specializes in the study of God's creation of Man in the Book of Genesi-- HOLY SHIT A GIANT BUG!", "1013_Wake Up Sheeple_You will be led to judgement like lambs to the slaughter--a simile whose existence, I might add, will not do your species any favors.", "1014_Car Problems_Or if you replace your car, we'll be happy to set it on fire again so you can take another crack at getting that shot.", "1015_Kerning_I have never been as self-conscious about my handwriting as when I was inking in the caption for this comic.", "1016_Valentine Dilemma_The worst resolution to the Valentine Prisoner's Dilemma when YOU decide not to give your partner a present but your PARTNER decides to testify against you in the armed robbery case.", "1017_Backward in Time_People tell me I have too much time on my hands, but really the problem is that there's too much time, PERIOD.", "1018_Good Cop, Dadaist Cop_NOW INVENT AN IMPOSSIBLE-TO-TRANSLATE LANGUAGE AND USE IT TO TELL US WHERE THE MONEY IS.", "1019_First Post_'Nuh-uh! We let users vote on comments and display them by number of votes. Everyone knows that makes it impossible for a few persistent voices to dominate the discussion.'", "1020_Orion Nebula_Also on the agenda: what's with his hips?", "1021_Business Plan_The investor elevator pitch is \"Wheeeeeeee! Elevators are fun!\"", "1022_So It Has Come To This_'Come to what?' 'You. Me. This moment.'", "1023_Late-Night PBS_Then it switched to these old black-and-white tapes of Bob Ross slumped against the wall of an empty room, painting the least happy trees you've ever seen. Either PBS needs to beef up studio security or I need to stop using Ambien to sleep.", "1024_Error Code_It has a section on motherboard beep codes that lists, for each beep pattern, a song that syncs up well with it.", "1025_Tumblr_Dot Tumblr Dot Com, on the other hand, would be an awful name for a band, if only because of how hard it would be to direct people to your band's website.", "1026_Compare and Contrast_Frankly, I see no difference between thee and a summer's day. Only Ron Paul offers a TRUE alternative!", "1027_Pickup Artist_Son, don't try to play 'make you feel bad' with the Michael Jordan of making you feel bad.", "1028_Communication_Anyone who says that they're great at communicating but 'people are bad at listening' is confused about how communication works.", "1029_Drawing Stars_Screw these 36-degree angles. I'm converting to Judaism.", "1030_Keyed_I was sure he was just getting revenge, but then he did the same thing to Carrie Underwood. Then he mailed me a scone. I think I'm giving up dating.", "1031_s/keyboard/leopard/_Problem Exists Between Leopard And Chair", "1032_Networking_Our company is agile and lean with a focus on the long tail. Ok, our company is actually a polecat I found in my backyard.", "1033_Formal Logic_Note that this implies you should NOT honk solely because I stopped for a pedestrian and you're behind me.", "1034_Share Buttons_The only post to achieve perfect balance between the four was a hilarious joke about Mark Zuckerberg getting caught using a pseudonym to sneak past the TSA.", "1035_Cadbury Eggs_When they moved production from New Zealand to the UK and switched from the runny white centers to the thick, frosting-like filling, it got way harder to cook them scrambled.", "1036_Reviews_I plugged in this lamp and my dog went rigid, spoke a sentence of perfect Akkadian, and then was hurled sideways through the picture window. Even worse, it's one of those lamps where the switch is on the cord.", "1037_Umwelt_Umwelt is the idea that because their senses pick up on different things, different animals in the same ecosystem actually live in very different worlds. Everything about you shapes the world you inhabit--from your ideology to your glasses prescription to your web browser.", "1038_Fountain_Implausible, did you say? Sorry, couldn't quite hear you from all the way up heeeeeeeeere!", "1039_RuBisCO_Bruce Schneier believes safewords are fundamentally insecure and recommends that you ask your partner to stop via public key signature.", "1040_Lakes and Oceans_James Cameron has said that he didn't know its song would be so beautiful. He didn't close the door in time. He's sorry.", "1041_Whites of Their Eyes_Don't fire until you see through the fragile facade to the human being within.", "1042_Never_I'll never forget you--at least, the parts of you that were important red flags.", "1043_Ablogalypse_Plus the reaction in the Tumblverse is always 'repeatedly get hit by a dog and fall down the stairs'.", "1044_Romney Quiz_Charlie actually delivered the Medicare line almost verbatim in the 1971 movie's Fizzy Lifting Drink scene, but it was ultimately cut from the final release.", "1045_Constraints_[title-text similarly alphabetized]", "1046_Skynet_'YOUR CLOTHES. GIVE THEM TO ME.' 'Shit, uh ... you are now breathing manually!' 'I AM ALWAYS BREATHING MANUALLY.'", "1047_Approximations_Two tips: 1) 8675309 is not just prime, it's a twin prime, and 2) if you ever find yourself raising log(anything)^e or taking the pi-th root of anything, set down the marker and back away from the whiteboard; something has gone horribly wrong.", "1048_Emotion_Fortunately, the internet has a virtually inexhaustible supply of code that doesn't work and people who are wrong, which bodes well for a return to normalcy. [Note: Click to read context for the cancer comics. She's doing well.]", "1049_Bookshelf_I had a hard time with Ayn Rand because I found myself enthusiastically agreeing with the first 90% of every sentence, but getting lost at 'therefore, be a huge asshole to everyone.'", "1050_Forgot Algebra_The only things you HAVE to know are how to make enough of a living to stay alive and how to get your taxes done. All the fun parts of life are optional.", "1051_Visited_I hate when I read something like '... tension among the BASE jumpers nearly led to wingsuit combat ...', and I get excited because 'wingsuit combat' is underlined, only to find that it's just separate links to the 'wingsuit' and 'combat' articles.", "1052_Every Major's Terrible_Someday I'll be the first to get a Ph. D in 'Undeclared'.", "1053_Ten Thousand_Saying 'what kind of an idiot doesn't know about the Yellowstone supervolcano' is so much more boring than telling someone about the Yellowstone supervolcano for the first time.", "1054_Theâ\u0080\u0089bacon_Normally pronounced 'THEH-buh-kon', I assume.", "1055_Kickstarter_If you pledge more than $50 you'll get on the VIP list and have first dibs on a slot on ANY of the pledge levels in the actual campaign.", "1056_Felidae_'Smilodon fatalis' narrowly edged out 'Tyrannosaurus rex' to win this year's Most Badass Latin Names competition, after edging out 'Dracorex hogwartsia' and 'Stygimoloch spinifer' (meaning 'horned dragon from the river of death') in the semifinals.", "1057_Klout_Though please do confirm that it's actually *me* on Klout first, and not one of my friends trying to get me punched. The great thing about this douchebag deadman switch is that I will never dare trigger it.", "1058_Old-Timers_You were on the internet before I was born? Well, so was I.", "1059_Bel-Air_Aaron Sorkin has been tapped to write the TV movie about the aging prince's eventual election to Pat Toomey's Senate seat, currently titled either 'FRESHman Senator' or 'Mr. Smith Goes to Washington'.", "1060_Crowdsourcing_We don't sell products; we sell the marketplace. And by 'sell the marketplace' we mean 'play shooters, sometimes for upwards of 20 hours straight.'", "1061_EST_The month names are the same, except that the fourth month only has the name 'April' in even-numbered years, and is otherwise unnamed.", "1062_Budget News_I will vote, no questions asked, for any candidate who describes themselves as 'more of a deficit sugar glider.'", "1063_Kill Hitler_Revised directive: It is forbidden for you to interfere with human history until you've at least taken a class on it.", "1064_Front Door_FYI: I'll be releasing a wolf into a randomly-chosen front yard sometime in the next 30 years. Now your fear is reasonable, and you don't need to feel embarrassed anymore. Problem solved!", "1065_Shoes_I *do* hear that they're the most comfortable thing to wear on your feet since sliced bread.", "1066_Laundry_During the second semester, the path is briefly routed through the dishwasher.", "1067_Pressures_Everyone's caught by surprise when a theory of quantum gravity is developed by a sound technician wearing patent leather shoes while editing Clerks II.", "1068_Swiftkey_Although the Markov chain-style text model is still rudimentary; it recently gave me \"Massachusetts Institute of America\". Although I have to admit it sounds prestigious.", "1069_Alphabet_Do I get to remove letters entirely? Or just rearrange them? Because the 'k/c' situation is ridiculous. Look, we can make out whenever. This is *immortality*!", "1070_Words for Small Sets_If things are too quiet, try asking a couple of friends whether \"a couple\" should always mean \"two\". As with the question of how many spaces should go after a period, it can turn acrimonious surprisingly fast unless all three of them agree.", "1071_Exoplanets_Planets are turning out to be so common that to show all the planets in our galaxy, this chart would have to be nested in itself--with each planet replaced by a copy of the chart--at least three levels deep.", "1072_Seventies_Hey, man, the 1670s called. They were like 'Wherefore this demonic inÅ¿trument? By what Å¿orcery does it produce Å¿uch Å¿ounds?\"", "1073_Weekend_Of the two Garfields, you wouldn't think the cat would turn out to be the more compelling presidential speechwriter, but there you go.", "1074_Moon Landing_Ok, so Spirit and Opportunity are pretty awesome. And Kepler. And New Horizons, Cassini, Curiosity, TiME, and Project M. But c'mon, if the Earth were a basketball, in 40 years no human's been more than half an inch from the surface.", "1075_Warning_Also possibly several miles beyond that.", "1076_Groundhog Day_If you closely examine the cosmic background radiation, you can pick up lingering echoes of 'I Got You Babe'.", "1077_Home Organization_Lifehacking!", "1078_Knights_1. Nf3 ... â\u0086\u0098â\u0086\u0098â\u0086\u0098  2. Nc3 ... â\u0086\u0098â\u0086\u0098â\u0086\u0098  0-1", "1079_United Shapes_That eggplant is in something of a flaccid state.", "1080_Visual Field_I recently learned something that solved a mystery that had bugged me since childhood--why, when I looked at an analog clock, the hand would sometimes seem to take a couple seconds to start ticking. Google \"stopped clock illusion\".", "1081_Argument Victory_Really, the comforting side in most conspiracy theory arguments is the one claiming that anyone who's in power has any plan at all.", "1082_Geology_That's a gneiss butte.", "1083_Writing Styles_I liked the idea, suggested by h00k on bash.org, of a Twitter bot that messages prominent politicians to tell them when they've unnecessarily used sms-speak abbreviations despite having plenty of characters left.", "1084_Server Problem_Protip: Annoy Ray Kurzweil by always referring to it as the 'Cybersingularity'.", "1085_ContextBot_If you read all vaguebooking/vaguetweeting with the assumption that they're saying everything they can without revealing classified military information, the internet gets way more exciting.", "1086_Eyelash Wish Log_Ooh, another one. Uh ... the ability to alter any coefficients of friction at will during sporting events.", "1087_Cirith Ungol_My all-time favorite example of syntactic ambiguity comes from Wikipedia: 'Charlotte's Web is a children's novel by American author E. B. White, about a pig named Wilbur who is saved from being slaughtered by an intelligent spider named Charlotte.'", "1088_Five Years_'Well, no further questions. You're hired!' 'Oh, sorry! I'm no longer interested. There's a bunch of future I gotta go check out!'", "1089_Internal Monologue_Oh right, eye contact. Ok, good, holding the eye contact ... holding ... still holding ... ok, too long! Getting weird! Quick, look thoughtfully into space and nod. Oh, dammit, said 'yeah' again!", "1090_Formal Languages_[audience looks around] 'What just happened?' 'There must be some context we're missing.'", "1091_Curiosity_As of this writing the NASA/JPL websites are still overloaded. Trying CURIOSITY-REAR-CAM_[256px_x_256px].torrent.SwEsUb.DVDRip.XviD-aXXo.jpg instead.", "1092_Michael Phelps_[shortly] ... he ate ALL of it!?", "1093_Forget_'Baby Got Back' turned 20 this year. My favorite nostalgia show is VH1's 'I Love The Inexorable March of Time Toward the Grave That Awaits Us All.'", "1094_Interview_Hey, before you go, can you explain to me what job I now have?", "1095_Crazy Straws_The new crowd is heavily shaped by this guy named Eric, who's basically the Paris Hilton of the amateur plastic crazy straw design world.", "1096_Clinically Studied Ingredient_Blatantly banking on customers not understanding that it's like a Hollywood studio advertising that their new movie was 'watched by Roger Ebert'.", "1097_A Hypochondriac's Nightmare_BUT WHAT IF I REASSURE MYSELF WITH A JOKE AND THEN DON'T WORRY ABOUT THE RASH AND IT TURNS OUT TO BE DEATH MITES AND I COULD HAVE CAUGHT IT", "1098_Star Ratings_I got lost and wandered into the world's creepiest cemetery, where the headstones just had names and star ratings. Freaked me out. When I got home I tried to leave the cemetery a bad review on Yelp, but as my hand hovered over the 'one star' button I felt this distant chill ...", "1099_Tuesdays_Try our bottomless drinks and fall forever!", "1100_Vows_So, um. Do you want to get a drink after the game?", "1101_Sketchiness_factory --- spire --- onslaught --- extractor --- judge", "1102_Fastest-Growing_I lead a small but extraordinarily persuasive religion whose only members are door-to-door proselytizers from other faiths.", "1103_Nine_FYI: If you get curious and start trying to calculate the time adjustment function that minimizes the gap between the most-used and least-used digit (for a representative sample of common cook times) without altering any time by more than 10%, and someone asks you what you're doing, it's easier to just lie.", "1104_Feathers_Click to see a video of a modern bird using stability flapping during predatory behavior. It all fits! Also, apparently Microraptor had *four* wings? The past keeps getting cooler! (And there's more of it every day!)", "1105_License Plate_The next day: 'What? Six bank robberies!? But I just vandalized the library!' 'Nice try. They saw your plate with all the 1's and I's.' 'That's impossible! I've been with my car the whole ti-- ... wait. Ok, wow, that was clever of her.'", "1106_ADD_20 balloons float away while I'm busy permanently tying one to a tree to deal with it for good. Unfortunately, that one balloon was 'land a rocket on the moon in Kerbal Space Program.'", "1107_Sports Cheat Sheet_I would subscribe to a Twitter feed that supplied you with one reasonable sports opinion per day, like 'The Red Sox can't make the playoffs (championship games), but in last night's game their win seriously damaged the chances of the Yankees (longstanding rival team).'", "1108_Cautionary Ghost_But then the Ghost of Subjunctive Past showed up and told me to stay strong on 'if it were'.", "1109_Refrigerator_I want this engraved on my tombstone like the Epitaph of Stevinus.", "1110_Click and Drag_Click and drag.", "1111_Premiere_'But what's the buzz about the film?' 'We're hoping it's distracting.'", "1112_Think Logically_I've developed a more logical set of rules but the people on the chess community have a bunch of stupid emotional biases and won't reply to my posts.", "1113_Killed In Action_We can't let this happen again. We need to build a secure TWO-day-before-retirement safe room.", "1114_Metallurgy_This exotic blade was wrought from a different fallen star. The meteorite was a carbonaceous chondrite, so it's basically a lump of gravel glued into the shape of a sword. A SPACE sword!", "1115_Sky_I dropped a bird and I didn't hear it hit bottom.", "1116_Traffic Lights_There's an intersection I drive through sometimes that has a forward green arrow, a red light, and a 'no turns' sign all on one pole. I honestly have no idea what it's telling me to do.", "1117_My Sky_According to my mom, my first word was (looking up at the sky) 'Wow!'", "1118_Microsoft_Facebook, Apple, and Google all got away with their monopolist power grabs because they don't have any 'S's in their names for critics to snarkily replace with '$'s.", "1119_Undoing_I've been sneaking out at night and installing lamps on the underside of every photovoltaic panel I can find. Sure, there are upwards of 80% losses, but I prefer to think of them as nearly 20% gains.", "1120_Blurring the Line_People into masturbatory navel-gazing have a lot to learn about masturbation.", "1121_Identity_Not sure why I just taught everyone to flawlessly impersonate me to pretty much anyone I know. Just remember to constantly bring up how cool it is that birds are dinosaurs and you'll be set.", "1122_Electoral Precedent_No white guy who's been mentioned on Twitter has gone on to win.", "1123_The Universal Label_Works for any grocery or non-grocery. Even thyme is just H and time.", "1124_Law of Drama_'Drama' is just 'people being upset', when someone says they're always surrounded by drama and they just ignore it, it starts to make sense that their strategy might be backfiring.", "1125_Objects In Mirror_Universes in mirror, like those in windshield, are larger than they appear.", "1126_Epsilon and Zeta_The average error in the NHC forecasted position of a hurricane three days in the future has shrunk to a third of what it was in 1990--a staggering accomplishment. However, as you may have gathered, forecasts of future storm *strength* have proved more difficult to improve.", "1127_Congress_It'd be great if some news network started featuring partisan hack talking heads who were all Federalists and Jacksonians, just to see how long it took us to catch on.", "1128_Fifty Shades_Wishbone and the Illustrated Classics series have gotten me through every conversation I've ever had about Dickens, Treasure Island, The Anarchist's Cookbook, and Our Bodies, Ourselves.", "1129_Cell Number_There's also a +1 sometimes, which is there to keep everyone on their toes. In the future, people who got to pick cool numbers by signing up for Google Voice early will be revered as wizards.", "1130_Poll Watching_The choices we make Tuesday could have MASSIVE and PERMANENT effects on the charts on Nate Silver's blog!", "1131_Math_As of this writing, the only thing that's 'razor-thin' or 'too close to call' is the gap between the consensus poll forecast and the result.", "1132_Frequentists vs. Bayesians_'Detector! What would the Bayesian statistician say if I asked him whether the--' [roll] 'I AM A NEUTRINO DETECTOR, NOT A LABYRINTH GUARD. SERIOUSLY, DID YOUR BRAIN FALL OUT?' [roll] '... yes.'", "1133_Up Goer Five_Another thing that is a bad problem is if you're flying toward space and the parts start to fall off your space car in the wrong order. If that happens, it means you won't go to space today, or maybe ever.", "1134_Logic Boat_Or a cabbage, for that matter. The goat makes sense. Goats are fine.", "1135_Arachnoneurology_SPIDER PSYCHOLOGY (21st Ed.) is a comprehensive overview of arachnoneurology, neuro-arachnology, forensic arachnology, neuro-arachnoneurology (the study of the brains of spider neurology experts), and arachnoarachnology (the study of too many spiders).", "1136_Broken Mirror_'I see you're in this mood again.' 'I am always in this mood.'", "1137_â\u0080®LTR_Collaborative editing can quickly become a textual rap battle fought with increasingly convoluted invocations of U+202a to U+202e.", "1138_Heatmap_There are also a lot of global versions of this map showing traffic to English-language websites which are indistinguishable from maps of the location of internet users who are native English speakers.", "1139_Rubber and Glue_I'm rubber. You're rubber. We contemplate the reality of our existence in mute, vulcanized horror.", "1140_Calendar of Meaningful Dates_In months other than September, the 11th is mentioned substantially less often than any other date. It's been that way since long before 9/11 and I have no idea why.", "1141_Two Years_She won the first half of all our chemo Scrabble games, but then her IV drugs started kicking in and I *dominated*.", "1142_Coverage_My resonant tunneling diode phone has limited range but a short enough wavelength to penetrate even the densest cages. This gives me a major combat advantage, hopefully.", "1143_Location_Ingress: Foursquare With Space Noises.", "1144_Tags_<A>: Like </a>this.&nbsp;", "1145_Sky Color_Feynman recounted another good one upperclassmen would use on freshmen physics students: When you look at words in a mirror, how come they're reversed left to right but not top to bottom? What's special about the horizontal axis?", "1146_Honest_I didn't understand what you meant. I still don't. But I'll figure it out soon!", "1147_Evolving_Biologists play reverse PokÃ©mon, trying to avoid putting any one team member on the front lines long enough for the experience to cause evolution.", "1148_Nothing to Offer_cerebrospinal fluid, pericardial fluid, sputum, aqueous humor, perilymph, chyme, hydatid fluid, interstitial fluid, rheum, and gin.", "1149_Broomstick_'Broom first, then slippers.' 'How do I know you'll return the broom once you've secured your ticket?' 'I'll leave my little dog as collateral.' 'Great. Pleasure doing business!'", "1150_Instagram_I'm gonna call the cops and get Chad arrested for theft, then move all my stuff to the house across the street. Hopefully the owners there are more responsible.", "1151_Tests_In fact, one of the boxes is full of Staphylococcus. The wrapping paper is coated in E. coli, though, so it's an understandable mistake. You know, we should really stop accepting gifts from that guy.", "1152_Communion_The local police, growing increasingly concerned about this church, ask parishioners to take a sip of wine and then spit it back out for DNA testing. It's blood, and it matches a 1970s murder victim.", "1153_Proof_The prosecution calls Gottfried Leibniz.", "1154_Resolution_If at first you don't succeed, that's one data point.", "1155_Kolmogorov Directions_People get really grumpy when they realize you're giving them directions for how to go to the store and buy a GPS.", "1156_Conditioning_'Why are you standing in the yard wearing a papal hat and a robe covered in seeds?' 'Well, the Pope is visiting our town next month ...'", "1157_Sick Day_Wikipedia path: Virus -> Immune system -> Innate immune system -> Parasites -> List of parasites of humans -> Naegleria fowleri -> Primary amoebic meningoencephalitis -> Deciding I DEFINITELY shouldn't connect an aquarium pump to my sinuses", "1158_Rubber Sheet_It IS about physics. It ALL is.", "1159_Countdown_For all we know, the odds are in our favor.", "1160_Drop Those Pounds_If the flyers don't work, we'll switch to the LEAST subtle method of informing a town of the existence of a trebuchet club.", "1161_Hand Sanitizer_Hipster CDC Reports Flu Epidemic Peaked Years Ago", "1162_Log Scale_Knuth Paper-Stack Notation: Write down the number on pages. Stack them. If the stack is too tall to fit in the room, write down the number of pages it would take to write down the number. THAT number won't fit in the room? Repeat. When a stack fits, write the number of iterations on a card. Pin it to the stack.", "1163_Debugger_It can take a site a while to figure out that there's a problem with their 'report a bug' form.", "1164_Home Alone_Starring Macaulay Culkin.", "1165_Amazon_Amazon.com took a surprise early lead with 'Time required to transport a package from Iquitos, Peru to Manaus, Brazil' but then lost it at 'Minutes to skeletonize a cow'.", "1166_Argument_The misguided search for a perpetual motion machine has run substantially longer than any attempted perpetual motion machine.", "1167_Star Trek into Darkness_Of course, factions immediately sprang up in favor of '~*~sTaR tReK iNtO dArKnEsS~*~', 'xX_StAr TrEk InTo DaRkNess_Xx', and 'Star Trek lnto Darkness' (that's a lowercase 'L').", "1168_tar_I don't know what's worse--the fact that after 15 years of using tar I still can't keep the flags straight, or that after 15 years of technological advancement I'm still mucking with tar flags that were 15 years old when I started.", "1169_Expedition_I'm pretty sure I've logged more hours in Google Maps over the past decade than in any game.", "1170_Bridge_And it says a lot about you that when your friends jump off a bridge en masse, your first thought is apparently 'my friends are all foolish and I won't be like them' and not 'are my friends ok?'.", "1171_Perl Problems_To generate #1 albums, 'jay --help' recommends the -z flag.", "1172_Workflow_There are probably children out there holding down spacebar to stay warm in the winter! YOUR UPDATE MURDERS CHILDREN.", "1173_Steroids_A human is a system for converting dust billions of years ago into dust billions of years from now via a roundabout process which involves checking email a lot.", "1174_App_If I click 'no', I've probably given up on everything, so don't bother taking me to the page I was trying to go to. Just drop me on the homepage. Thanks.", "1175_Moving Sidewalks_I think I could spend hours just stepping on and off of conveyor belts moving at various speeds.", "1176_Those Not Present_'Yeah, that squid's a total asshole.' [scoot scoot]", "1177_Time Robot_NO FATE BUT THE NARRATIVES WE IMPOSE ON LIFE'S RANDOM CHAOS TO DISTRACT OURSELVES FROM OUR EXISTENTIAL PLIGHT", "1178_Pickup Artists_It sounds like a great way to make friends! Is it near that Friend Zone you keep talking about? I wanna go!", "1179_ISO 8601_ISO 8601 was published on 06/05/88 and most recently amended on 12/01/04.", "1180_Virus Venn Diagram_Within five minutes of the Singularity appearing, somebody will suggest defragging it.", "1181_PGP_If you want to be extra safe, check that there's a big block of jumbled characters at the bottom.", "1182_Rembrandt Photo_::click:: Come back! You didn't see the one of Whistler's mother!", "1183_Rose Petals_Joke's on you--the Roomba and I had a LOVELY evening.", "1184_Circumference Formula_Assume r' refers to the radius of Earth Prime, and r'' means radius in inches.", "1185_Ineffective Sorts_StackSort connects to StackOverflow, searches for 'sort a list', and downloads and runs code snippets until the list is sorted.", "1186_Bumblebees_Did you know sociologists can't explain why people keep repeating that urban legend about bumblebees not being able to fly!?", "1187_Aspect Ratio_I'm always disappointed when 'Anamorphic Widescreen' doesn't refer to a widescreen Animorphs movie.", "1188_Bonding_I'm trying to build character but Eclipse is really confusing.", "1189_Voyager 1_So far Voyager 1 has 'left the Solar System' by passing through the termination shock three times, the heliopause twice, and once each through the heliosheath, heliosphere, heliodrome, auroral discontinuity, Heaviside layer, trans-Neptunian panic zone, magnetogap, US Census Bureau Solar System statistical boundary, Kuiper gauntlet, Oort void, and crystal sphere holding the fixed stars.", "1190_Time_The end.", "1191_The Past_If history has taught us anything, we can use that information to destroy it.", "1192_Humming_I'm so bad at carrying a tune, those 'find a song by humming its melody' websites throw an HTTP 406 error as soon as I start to hum.", "1193_Externalities_", "1194_Stratigraphic Record_All we have are these stupid tantalizing zircons and the scars on the face of the Moon.", "1195_Flowchart_The way out is to use the marker you have to add a box that says 'get a marker' to the line between you and 'start', then add a 'no' line from the trap box to 'end'.", "1196_Subways_About one in three North American subway stops are in NYC.", "1197_All Adobe Updates_ALERT: Some pending mandatory software updates require version 21.1.2 of the Oracle/Sun Java(tm) JDK(tm) Update Manager Runtime Environment Meta-Updater, which is not available for your platform.", "1198_Geologist_'It seems like it's still alive, Professor.' 'Yeah, a big one like this can keep running around for a few billion years after you remove the head.\"", "1199_Silence_All music is just performances of 4'33\" in studios where another band happened to be playing at the time.", "1200_Authorization_Before you say anything, no, I know not to leave my computer sitting out logged in to all my accounts. I have it set up so after a few minutes of inactivity it automatically switches to my brother's.", "1201_Integration by Parts_If you can manage to choose u and v such that u = v = x, then the answer is just (1/2)x^2, which is easy to remember. Oh, and add a '+C' or you'll get yelled at.", "1202_Girls and Boys_To get more knowledge", "1203_Time Machines_'All time machine systems nominal ... T-minus ten ... eleven ...'", "1204_Detail_2031: Google defends the swiveling roof-mounted scanning electron microscopes on its Street View cars, saying they 'don't reveal anything that couldn't be seen by any pedestrian scanning your house with an electron microscope.'", "1205_Is It Worth the Time?_Don't forget the time you spend finding the chart to look up what you save. And the time spent reading this reminder about the time spent. And the time trying to figure out if either of those actually make sense. Remember, every second counts toward your life total, including these right now.", "1206_Einstein_Einstein was WRONG when he said that provisional patent #39561 represented a novel gravel-sorting technique and should be approved by the Patent Office.", "1207_AirAware_It ships with a version of Google Now that alerts you when it's too late to leave for your appointments.", "1208_Footnote Labyrinths_Every time you read this mouseover, toggle between interpreting nested footnotes as footnotes on footnotes and interpreting them as exponents (minus one, modulo 6, plus 1).", "1209_Encoding_I don't see how; the C0 block is right there at the beginning.", "1210_I'm So Random_In retrospect, it's weird that as a kid I thought completely random outbursts made me seem interesting, given that from an information theory point of view, lexical white noise is just about the opposite of interesting by definition.", "1211_Birds and Dinosaurs_Sure, T. rex is closer in height to Stegosaurus than a sparrow. But that doesn't tell you much; 'Dinosaur Comics' author Ryan North is closer in height to certain dinosaurs than to the average human.", "1212_Interstellar Memes_The strongest incentive we have to develop faster-than-light travel is that it would let us apologize in advance.", "1213_Combination Vision Test_If you see two numbers but they're both the same and you have to squint to read them, you have synesthesia, colorblindness, diplopia, and myopia.", "1214_Geoguessr_I'm not sure if you can get Epcot, but my friend just got LegoLand. He guessed California but it was the one in Denmark. Meanwhile, I'm rapidly becoming a connoisseur of unmarked dirt roads over flat, barren landscapes.", "1215_Insight_The great thing is, the sentence is really just a reminder to the listener to worry about whatever aspects of the technology they're already feeling alarmist about, which in their mind gives you credit for addressing their biggest anxieties.", "1216_Sticks and Stones_Sticks and stones may break my bones, but words can make me think I deserved it.", "1217_Cells_Now, if it selectively kills cancer cells in a petri dish, you can be sure it's at least a great breakthrough for everyone suffering from petri dish cancer.", "1218_Doors of Durin_If we get the doors open and plug up the dam on the Sirannon so the water rises a little, the pool will start draining into Moria. How do you think the Watcher would fare against a drenched Balrog?", "1219_Reports_If that fails, just multiply every number by a thousand. 'The 2nd St speed limit should be set at 25,000 mph, which would likely have prevented 1,000 of the intersection's 3,000 serious accidents last month.'", "1220_Hipsters_You may point out that this very retreat into ironic detachment while still clearly participating in the thing in question is the very definition of contemporary hipsterdom. But on the other hand, wait, you're in an empty room. Who are you talking to?", "1221_Nomenclature_[shouted, from the field] 'Aunt Beast hit a pop fly to second! Dive for it, Mrs Whatsit!'", "1222_Pastime_Good thing we're too smart to spend all day being uselessly frustrated with ourselves. I mean, that'd be a hell of a waste, right?", "1223_Dwarf Fortress_I may be the kind of person who wastes a year implementing a Turing-complete computer in Dwarf Fortress, but that makes you the kind of person who wastes ten more getting that computer to run Minecraft.", "1224_Council of 300_'And hypnotize someone into thinking they've uploaded it and passed it around.' 'But then won't the uploader get suspicious that it pauses at 301+ for a while? Why don't we just forge the number entirel--' ::BLAM:: 'The Council of 299 is adjourned.'", "1225_Ice Sheets_Data adapted from 'The Laurentide and Innuitian ice sheets during the Last Glacial Maximum' by A.S. Dyke et. al., which was way better than the sequels 'The Laurentide and Innuitian ice sheets during the Last Glacial Maximum: The Meltdown' and 'The Laurentide and Innuitian ice sheets during the Last Glacial Maximum: Continental Drift'.", "1226_Balloon Internet_I run a business selling rural internet access. My infrastructure consists of a bunch of Verizon wifi hotspots that I sign up for and then cancel at the end of the 14-day return period.", "1227_The Pace of Modern Life_'Unfortunately, the notion of marriage which prevails ... at the present time ... regards the institution as simply a convenient arrangement or formal contract ... This disregard of the sanctity of marriage and contempt for its restrictions is one of the most alarming tendencies of the present age.' --John Harvey Kellogg, Ladies' guide in health and disease (1883)", "1228_Prometheus_'I'm here to return what Prometheus stole.' would be a good thing to say if you were a fighter pilot in a Michael Bay movie where for some reason the world's militaries had to team up to defeat every god from human mythology, and you'd just broken through the perimeter and gotten a missile lock on Mount Olympus.", "1229_Screensaver_I'm entering my 24th year of spending eight hours a day firing the Duck Hunt gun at the flying toasters. I'm sure I'll hit one soon.", "1230_Polar/Cartesian_Protip: Any two-axis graph can be re-labeled 'coordinates of the ants crawling across my screen as a function of time'.", "1231_Habitable Zone_They have a telescope pointed RIGHT AT US!", "1232_Realistic Criteria_I'm leaning toward fifteen. There are a lot of them.", "1233_Relativity_It's commonly believed that Lorentz contraction makes objects appear flatter along the direction of travel. However, this ignores light travel times. In fact, a fast-moving butt would appear rotated toward the observer but not substantially distorted. Shakira was right.", "1234_Douglas Engelbart (1925-2013)_Actual quote from The Demo: '... an advantage of being online is that it keeps track of who you are and what youâ\u0080\u0099re doing all the time ...'", "1235_Settled_Well, we've really only settled the question of ghosts that emit or reflect visible light. Or move objects around. Or make any kind of sound. But that covers all the ones that appear in Ghostbusters, so I think we're good.", "1236_Seashell_This is roughly equivalent to 'number of times I've picked up a seashell at the ocean' / 'number of times I've picked up a seashell', which in my case is pretty close to 1, and gets much closer if we're considering only times I didn't put it to my ear.", "1237_QR Code_Remember, the installer is watching the camera for the checksum it generated, so you have to scan it using your own phone.", "1238_Enlightenment_But the rules of writing are like magic spells. If you never acquire them, then not using them says nothing.", "1239_Social Media_The social media reaction to this asteroid announcement has been sharply negative. Care to respond?", "1240_Quantum Mechanics_You can also just ignore any science assertion where 'quantum mechanics' is the most complicated phrase in it.", "1241_Annoying Ringtone Champion_It beat out 'Clock radio alarm', 'B-flat at 194 decibels', 'That noise from Dumb & Dumber', and 'Recording of a sobbing voice begging you to answer'.", "1242_Scary Names_Far off to the right of the chart is the Helvetica Scenario.", "1243_Snare_It's going in A collection of satellites skewered with pins and mounted in display boxes. Not necessarily MY collection.", "1244_Six Words_Ahem. We are STRICTLY an Orbiter shop.", "1245_10-Day Forecast_Oh, definitely not; they don't have Amazon Prime.", "1246_Pale Blue Dot_Our planet is a lonely speck in the great enveloping cosmic dark. In our obscurity, in all this vastness, there is no hint that help will come from elsewhere to save us from ourselves. There is no road out of this oblivion; we must embrace it. We must join with the darkness. Ba'al the Annihilator offers us no happiness, no answers, naught but the cold embrace of the void. To imagine any other end is delusion. We must give in to the will of Ba'al, for he will one day consume us and our world alike. I therefore call on Congress to fully fund space exploration, and to join with Ba'al, the Eater of Souls. Thank you.", "1247_The Mother of All Suspicious Files_Better change the URL to 'https' before downloading.", "1248_Sphere_This message brought to you by the Society of Astronomers Trapped on the Surface of a Sphere.", "1249_Meteor Showers_Remember, meteors always hit the tallest object around.", "1250_Old Accounts_If you close an account while it's still friends with people, it contributes to database linkage accumulation slowdown, which is a major looming problem for web infrastructure and definitely not a thing I just made up.", "1251_Anti-Glass_'Why don't you just point it at their eye directly?' 'What is this, 2007?'", "1252_Increased Risk_You may point out that strictly speaking, you can use that statement to prove that all risks are tiny--to which I reply HOLY SHIT WATCH OUT FOR THAT DOG!", "1253_Exoplanet Names_If you have any ideas, I hear you can send them to iaupublic@iap.fr.", "1254_Preferred Chat System_If you call my regular number, it just goes to my pager.", "1255_Columbus_And thus was smallpox introduced into the previously Undying Lands.", "1256_Questions_To whoever typed 'why is arwen dying': GOOD. FUCKING. QUESTION.", "1257_Monster_It was finally destroyed with a nuclear weapon carrying the destructive energy of the Hiroshima bomb.", "1258_First_Fortunately, exactly zero other annoying internet behaviors have developed during this time.", "1259_Bee Orchid_In sixty million years aliens will know humans only by a fuzzy clip of a woman in an Axe commercial.", "1260_LD50_The dose is much lower when administered orally. We're still trying to get the paper into the needles for subcutaneous injection.", "1261_Shake That_How do I work it? IT'S ALREADY WORKING!", "1262_Unquote_I guess it's a saying from the Old Country.", "1263_Reassuring_'At least humans are better at quietly amusing ourselves, oblivious to our pending obsolescence' thought the human, as a nearby Dell Inspiron contentedly displayed the same bouncing geometric shape screensaver it had been running for years.", "1264_Slideshow_Points to anyone who hacks the Flickr devs' computers to make their text editors do this when you click on anything.", "1265_Juicer_But the rind is where all the vitamins are!", "1266_Halting Problem_I found a counterexample to the claim that all things must someday die, but I don't know how to show it to anyone.", "1267_Mess_'Sorry, I left out my glass of water from last night.' OH GOD I APPARENTLY LIVE IN A GARBAGE PIT.", "1268_Alternate Universe_As best as I can tell, I was transported here from Earth Prime sometime in the late 1990s. Your universe is identical in every way, except for the lobster thing and the thing where some of you occasionally change your clocks for some reason.", "1269_Privacy Opinions_I'm the Philosopher until someone hands me a burrito.", "1270_Functional_Functional programming combines the flexibility and power of abstract mathematics with the intuitive clarity of abstract mathematics.", "1271_Highlighting_And if clicking on any word pops up a site-search for articles about that word, I will close all windows in a panic and never come back.", "1272_Shadowfacts_'Look to my coming on the fifth day. At dawn, look to the east.' 'And look to the west to see our shadows!'", "1273_Tall Infographics_'Big Data' doesn't just mean increasing the font size.", "1274_Open Letter_Are you ok?  Do you need help?", "1275_int(pi)_If replacing all the '3's doesn't fix your code, remove the 4s, too, with 'ceiling(pi) / floor(pi) * pi * r^floor(pi)'. Mmm, floor pie.", "1276_Angular Size_If the celestial sphere were mapped to the Earth's surface, astronomy would get a LOT easier; you'd just need a magnifying glass.", "1277_Ayn Random_In a cavern deep below the Earth, Ayn Rand, Paul Ryan, Rand Paul, Ann Druyan, Paul Rudd, Alan Alda, and Duran Duran meet together in the Secret Council of /(b[plurandy]+b ?){2}/i.", "1278_Giraffes_If you fund my Kickstarter ...", "1279_Reverse Identity Theft_I asked a few friends whether they'd had this happen, then looked up the popularity of their initials/names over time.  Based on those numbers, it looks like there must be at least 750,000 people in the US alone who think 'Sure, that's probably my email address' on a regular basis.", "1280_Mystery News_If you find and stop the video, but you've--against all odds--gotten curious about the trade summit, just leave the tab opened. It will mysteriously start playing again 30 minutes later!", "1281_Minifigs_The LEGO Group is already the world's largest tire manufacturer.", "1282_Monty Hall_A few minutes later, the goat from behind door C drives away in the car.", "1283_Headlines_1916: 'PHYSICIST DAD' TURNS HIS ATTENTION TO GRAVITY, AND YOU WON'T BELIEVE WHAT HE FINDS. [PICS] [NSFW]", "1284_Improved Keyboard_I'm always installing tons of weird experimental keyboards because it serves as a good reminder that nothing I was going to type was really worth the trouble.", "1285_Third Way_'The monospaced-typewriter-font story is a COMPLETE FABRICATION!  WAKE UP, SHEEPLE' 'It doesn't matter! Studies support single spaces!' 'Those results weren't statistically significant!' 'Fine, you win. I'm using double spaces right now!' 'Are not!  We can all hear your stupid whitespace.'", "1286_Encryptic_It was bound to happen eventually. This data theft will enable almost limitless [xkcd.com/792]-style password reuse attacks in the coming weeks. There's only one group that comes out of this looking smart: Everyone who pirated Photoshop.", "1287_Puzzle_Prediction for Carlsen v. Anand: ... 25. Qb8+ Nxb8 26. Rd8# f6 27. \"... dude.\" Qf5 28. \"The game is over, dude.\" Qxg5 29. Rxe8 0-1 30. \"Dude, your move can't be '0-1'. Don't write that down.\" [Black flips board]", "1288_Substitutions_INSIDE ELON MUSK'S NEW ATOMIC CAT", "1289_Simple Answers_'Will [     ] allow us to better understand each other and thus make war undesirable?' is one that pops up whenever we invent a new communication medium.", "1290_Syllable Planning_You absolute-fucking-... shit.", "1291_Shoot for the Moon_Shoot for the Moon. If you miss, you'll end up co-orbiting the Sun alongside Earth, living out your days alone in the void within sight of the lush, welcoming home you left behind.", "1292_Pi vs. Tau_Conveniently approximated as e+2, Pau is commonly known as the Devil's Ratio (because in the octal expansion, '666' appears four times in the first 200 digits while no other run of 3+ digits appears more than once.)", "1293_Job Interview_When you talk about the job experience you'll give me, why do you pronounce 'job' with a long 'o'?", "1294_Telescope Names_The Thirty Meter Telescope will be renamed The Flesh-Searing Eye on the Volcano.", "1295_New Study_When the results are published, no one will be sure whether to report on them again.", "1296_Git Commit_Merge branch 'asdfasjkfdlas/alkdjf' into sdkjfls-final", "1297_Oort Cloud_... I wanna try.  Hang on, be right back.", "1298_Exoplanet Neighborhood_It's a beautiful day in the neighborhood!", "1299_I Don't Own a TV_Theory: Smugness is proportional to the negative second derivative of TV ownership rate with respect to time.", "1300_Galilean Moons_I'm SO glad I escaped. They almost had me caught in their weird ... thing.", "1301_File Extensions_I have never been lied to by data in a .txt file which has been hand-aligned.", "1302_Year in Review_All in all, I give this year a C-. There were no aurora visible from my house and that comet evaporated. They'd better not cancel the 2017 eclipse.", "1303_Profile Info_It's ok, they'll always let you opt out! Like they did with the YouTube real name profile thing.", "1304_Glass Trolling_Plus, when someone finally grabs your glasses and stomps on them, it costs way less than $1,500 to replace them.", "1305_Undocumented Feature_And it doesn't pop up a box every time asking you to use your real name. In fact, there's no way to set your name at all. You just have to keep reminding people who you are.", "1306_Sigil Cycle_The cycle seems to be 'we need these symbols to clarify what types of things we're referring to!' followed by 'wait, it turns out words already do that.'", "1307_Buzzfeed Christmas_The 6 Weirdest Objects The Buzzfeed Writers Are Throwing Out Their Windows At Us", "1308_Christmas Lights_Merry Christmas from xkcd!", "1309_Infinite Scrolling_Maybe we should give up on the whole idea of a 'back' button. 'Show me that thing I was looking at a moment ago' might just be too complicated an idea for the modern web.", "1310_Goldbach Conjectures_The weak twin primes conjecture states that there are infinitely many pairs of primes. The strong twin primes conjecture states that every prime p has a twin prime (p+2), although (p+2) may not look prime at first. The tautological prime conjecture states that the tautological prime conjecture is true.", "1311_2014_Some future reader, who may see the term, without knowing the history of it, may imagine that it had reference to some antiquated bridge of the immortal Poet, thrown across the silver Avon, to facilitate his escape after some marauding excursion in a neighbouring park; and in some Gentleman's Magazine of the next century, it is not impossible, but that future antiquaries may occupy page after page in discussing so interesting a matter. We think it right, therefore, to put it on record in the Oriental Herald that the 'Shakesperian Rope Bridges' are of much less classic origin; that Mr Colin Shakespear, who, besides his dignity as Postmaster, now signs himself 'Superintendent General of Shakesperian Rope Bridges', is a person of much less genius than the Bard of Avon. --The Oriental Herald, 1825", "1312_Haskell_The problem with Haskell is that it's a language built on lazy evaluation and nobody's actually called for it.", "1313_Regex Golf_/bu|[rn]t|[coy]e|[mtg]a|j|iso|n[hl]|[ae]d|lev|sh|[lnd]i|[po]o|ls/ matches the last names of elected US presidents but not their opponents.", "1314_Photos_I hate when people take photos of their meal instead of eating it, because there's nothing I love more than the sound of other people chewing.", "1315_Questions for God_What sins could possibly darken the heart of a STEAMBOAT? I asked The Shadow, but he says he only covers men.", "1316_Inexplicable_'It has a ghost in it. Take it back.' 'No.'", "1317_Theft_Is he ALSO wondering at what point our thoughts diverged, if they even have yet? 'dude, I think he just took your credit card' AM I THE ORIGINAL? HOW DO I TELL?", "1318_Actually_Protip: You can win every exchange just by being one level more precise than whoever talked last. Eventually, you'll defeat all conversational opponents and stand alone.", "1319_Automation_'Automating' comes from the roots 'auto-' meaning 'self-', and 'mating', meaning 'screwing'.", "1320_Walmart_What I really want is to hang out where I hung out with my friends in college, but have all my older relatives there too.", "1321_Cold_'You see the same pattern all over. Take Detroit--' 'Hold on. Why do you know all these statistics offhand?' 'Oh, um, no idea. I definitely spend my evenings hanging out with friends, and not curating a REALLY NEAT database of temperature statistics. Because, pshh, who would want to do that, right? Also, snowfall records.'", "1322_Winter_Stay warm, little flappers, and find lots of plant eggs!", "1323_Protocol_Changing the names would be easier, but if you're not comfortable lying, try only making friends with people named Alice, Bob, Carol, etc.", "1324_Weather_At least if you're really into, like, Turkish archaeology, store clerks aren't like 'hey, how 'bout those Derinkuyu underground cities!' when they're trying to be polite.", "1325_Rejection_Perhaps you need a crash course in taking hints. Here's your first lesson: We're not actually walking somewhere together; I'm trying to leave this conversation and you're following me.", "1326_Sharks_'Now, minions, I'm off to inspect our shark cages.' 'Do you really need to inspect them this often?' 'PRISONERS MUST NEVER ESCAPE.'", "1327_Mobile Marketing_We're firing you, but the online headline-writing division wants to hire you.", "1328_Update_I have a bunch of things open right now.", "1329_Standing_At first I was making fun of them, but joke's on me--the deer is surprisingly ergonomic, except for the kicks.", "1330_Kola Borehole_Tonight's top story: Lucifer, the Prince of Darkness, died in his home this morning at the age of [unintelligible rune]. Due to the large number of sharks inhabiting his former kingdom, no body could be recovered.", "1331_Frequency_This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.", "1332_Slippery Slope_Sure, taking a few seconds to be respectful toward someone about something they care about doesn't sound hard. But if you talk to hundreds of people every day and they all start expecting that same consideration, it could potentially add up to MINUTES wasted. And for WHAT?", "1333_First Date_I sympathize with the TPP protagonist because I, too, have progressed through a surprising number of stages of life despite spending entire days stuck against simple obstacles.", "1334_Second_Let me just scroll down and check behind that rock. Annnnd ... nope, page copyright year starts with '19'. Oh God, is this a WEBRING?", "1335_Now_This image stays roughly in sync with the day (assuming the Earth continues spinning). Shortcut: xkcd.com/now", "1336_Transformers_A helicopter bursts from a chrysalis and alights on a rock, rotors still damp.", "1337_Hack_HACK THE STARS", "1338_Land Mammals_Bacteria still outweigh us thousands to one--and that's not even counting the several pounds of them in your body.", "1339_When You Assume_You know what happens when you assert--you make an ass out of the emergency response team.", "1340_Unique Date_If our current civilization lasts another 8,000 years, it's probably fair to assume the Long Now Foundation got things right, and at some point we started listening to them and switched to five-digit years.", "1341_Types of Editors_m-x machineofdeath-mode", "1342_Ancient Stars_'The light from those millions of stars you see is probably many thousands of years old' is a rare example of laypeople substantially OVERestimating astronomical numbers.", "1343_Manuals_The most ridiculous offender of all is the sudoers man page, which for 15 years has started with a 'quick guide' to EBNF, a system for defining the grammar of a language. 'Don't despair', it says, 'the definitions below are annotated.'", "1344_Digits_It's taken me 20 years to get over skyline tetris.", "1345_Answers_Stanford sleep researcher William Dement said that after 50 years of studying sleep, the only really solid explanation he knows for why we do it is 'because we get sleepy'.", "1346_Career_They'd convince me to come out of retirement for one last job: biting into a giant lump of slightly soft wax a couple of times.", "1347_t Distribution_If data fails the Teacher's t test, you can just force it to take the test again until it passes.", "1348_Before the Internet_We watched DAYTIME TV. Do you realize how soul-crushing it was? I'd rather eat an iPad than go back to watching daytime TV.", "1349_Shouldn't Be Hard_(six hours later) ARGH. How are these stupid microchips so durable?! All I want is to undo a massive industrial process with household tools!", "1350_Lorenz_Every choice, no matter how small, begins a new story.", "1351_Metamaterials_If I developed a hue-shifting metamaterial, I would photobomb people's Instagram pics with a sheet of material that precisely undid the filter they were using.", "1352_Cosmologist on a Tire Swing_No matter how fast I swing, I can never travel outside this loop! Maybe space outside it doesn't exist! But I bet it does. This tire came from somewhere.", "1353_Heartbleed_I looked at some of the data dumps from vulnerable sites, and it was ... bad. I saw emails, passwords, password hints. SSL keys and session cookies. Important servers brimming with visitor IPs. Attack ships on fire off the shoulder of Orion, c-beams glittering in the dark near the TannhÃ¤user Gate. I should probably patch OpenSSL.", "1354_Heartbleed Explanation_Are you still there, server? It's me, Margaret.", "1355_Airplane Message_PHARAOH IRY-HOR, FROM THE 3100s BC, IS THE FIRST HUMAN WHOSE NAME WE KNOW.", "1356_Orbital Mechanics_To be fair, my job at NASA was working on robots and didn't actually involve any orbital mechanics. The small positive slope over that period is because it turns out that if you hang around at NASA, you get in a lot of conversations about space.", "1357_Free Speech_I can't remember where I heard this, but someone once said that defending a position by citing free speech is sort of the ultimate concession; you're saying that the most compelling thing you can say for your position is that it's not literally illegal to express.", "1358_NRO_'DISPATCHING DRONE TO TARGET COORDINATES.' 'Wait, crap, wrong button. Oh jeez.'", "1359_Phone Alarm_Who's calling me?? WHY IS THE WORST PERSON IN THE WORLD CALLING ME!?", "1360_Old Files_Wow, ANIMORPHS-NOVEL.RTF? Just gonna, uh, go through and delete that from all my archives real quick.", "1361_Google Announcement_The less popular 8.8.4.4 is slated for discontinuation.", "1362_Morse Code_Oh, because Facebook has worked out SO WELL for everyone.", "1363_xkcd Phone_Presented in partnership with Qualcomm, Craigslist, Whirlpool, Hostess, LifeStyles, and the US Chamber of Commerce. Manufactured on equipment which also processes peanuts. Price includes 2-year Knicks contract. Phone may extinguish nearby birthday candles. If phone ships with Siri, return immediately; do not speak to her and ignore any instructions she gives. Do not remove lead casing. Phone may attract/trap insects; this is normal. Volume adjustable (requires root). If you experience sudden tingling, nausea, or vomiting, perform a factory reset immediately. Do not submerge in water; phone will drown. Exterior may be frictionless. Prolonged use can cause mood swings, short-term memory loss, and seizures. Avert eyes while replacing battery. Under certain circumstances, wireless transmitter may control God.", "1364_Like I'm Five_'Am I taking care of you? I have a thesis to write!' 'My parents are at their house; you visited last--' 'No, no, explain like you're five.'", "1365_Inflation_Wait till they notice the faint reflection of Michael Jordan and Bugs Bunny in the E-mode.", "1366_Train_Trains rotate the Earth around various axes while elevators shift its position in space.", "1367_Installing_But still, my scheme for creating and saving user config files and data locally to preserve them across reinstalls might be useful for--wait, that's cookies.", "1368_One Of The_'The world's greatest [whatever]' is subjective, but 'One of the world's greatest [whatever]s' is clearly objective. Anyway, that's why I got you this 'one of the world's greatest moms' mug!", "1369_TMI_'TMI' he whispered, gazing into the sea.", "1370_President_Anyone who thinks we're all going to spend the 2032 elections poring over rambling blog posts by teenagers has never tried to read a rambling blog post by a teenager.", "1371_Brightness_Recently, some exoplanet astronomers have managed to use careful analysis of reflected light to discover Earth during the day.", "1372_Smartwatches_This is even better than my previous smartphone casemod: an old Western Electric Model 2500 desk phone handset complete with a frayed, torn-off cord dangling from it.", "1373_Screenshot_I'M PLUGGING IN MY PHONE BUT THE BATTERY ON THE SCREEN ISN'T CHARGING", "1374_Urn_Can this PLEASE be drawing with replacement?", "1375_Astronaut Vandalism_That night, retired USAF pilots covertly replaced the '62' with '50'.", "1376_Jump_Or that I'm at least following the curve of the Earth around to land ...", "1377_Fish_[Astronomer peers into telescope] [Jaws theme begins playing]", "1378_Turbine_Ok, plan B: Fly a kite into the blades, with a rock in a sling dangling below it, and create the world's largest trebuchet.", "1379_4.5 Degrees_The good news is that according to the latest IPCC report, if we enact aggressive emissions limits now, we could hold the warming to 2Â°C. That's only HALF an ice age unit, which is probably no big deal.", "1380_Manual for Civilization_We will have an entire wing of the library devoted to copies of book #26, because ohmygod it's the one where Jake and Cassie finally KISS!!!", "1381_Margin_PROTIP: You can get around the Shannon-Hartley limit by setting your font size to 0.", "1382_Rocket Packs_Every year: 'It's <year>--I want my jetpack [and also my free medical care covering all my jetpack-related injuries]!'", "1383_Magic Words_'And then whisper 'anapest' in my ear as you hold me?'", "1384_Krypton_Their Sun and gravity will make you, uh, something, I guess. Out of earshot from Earth, mostly.", "1385_Throwing Rocks_::PLOOOOSH:: Looks like you won't be making it to Vinland today, Leaf Erikson.", "1386_People are Stupid_To everyone who responds to everything by saying they've 'lost their faith in humanity': Thanks--I'll let humanity know. I'm sure they'll be crushed.", "1387_Clumsy Foreshadowing_'... hosts were unexpectedly fired from ABC's 'The View' today. ABC will likely announce new ...'", "1388_Subduction License_'Dude, why can't you just be a normal roommate?' 'Because I'm coming TOWARD you!'", "1389_Surface Area_This isn't an informational illustration; this is a thing I think we should do. First, we'll need a gigantic spool of thread. Next, we'll need some kind of ... hmm, time to head to Seattle.", "1390_Research Ethics_I mean, it's not like we could just demand to see the code that's governing our lives. What right do we have to poke around in Facebook's private affairs like that?", "1391_Darkness_This was actually wish #406. Wish #2 was for him to lose the ability to remember that each new wish wasn't my first.", "1392_Dominant Players_When Vera Menchik entered a 1929 tournament, a male competitor mocked her by suggesting that a special 'Vera Menchik Club' would be created for any player who lost to her. When the tournament began, he promptly became the first member of said club, and over the years it accumulated a large and illustrious roster.", "1393_Timeghost_'Hello, Ghostbusters?' 'ooOOoooo people born years after that movie came out are having a second chiiiild right now ooOoooOoo'", "1394_Superm*n_See also: Spider-Man reboot in which he can produce several inches of web, doesn't need as much chalk powder on his hands when he goes rock climbing, and occasionally feels vaguely uneasy about situations.", "1395_Power Cord_In this situation, gzip /dev/inside to deflate, then pipe the compressed air to /dev/input to clean your keyboard. Avert your eyes when you do.", "1396_Actors_Once again topping the list of tonight's hottest rising stars in Hollywood is Î¾ Persei!", "1397_Luke_Don't turn it on.", "1398_Snake Facts_Biologically speaking, what we call a 'snake' is actually a human digestive tract which has escaped from its host.", "1399_Chaos_Although the oral exam for the doctorate was just 'can you do that weird laugh?'", "1400_D.B. Cooper_'Why on Earth would someone commit air piracy just to finance a terrible movie decades later?' 'People are very strange these days.'", "1401_New_The nice thing about headcannnons is that it's really easy to get other people to believe in them.", "1402_Harpoons_To motivate it to fire its harpoons hard enough, Rosetta's Philae lander has been programmed to believe it is trying to kill the comet.", "1403_Thesis Defense_MY RESULTS ARE A SIGNIFICANT IMPROVEMENT ON THE STATE OF THE AAAAAAAAAAAART", "1404_Quantum Vacuum Virtual Plasma_I don't understand the things you do, and you therefore may represent an interaction with the quantum vacuum virtual plasma.", "1405_Meteor_No, only LAVA is called 'magma' while underground. Any other object underground is called 'lava'.", "1406_Universal Converter Box_Comes with a 50-lb sack of gender changers, and also an add-on device with a voltage selector and a zillion circular center pin DC adapter tips so you can power any of those devices from the 90s.", "1407_Worst Hurricane_'Finding a 105-year-old who's lived in each location and asking them which hurricane they think was the worst' is left as an exercise for the reader.", "1408_March of the Penguins_You ARE getting older, though.", "1409_Query_SELECT * FROM GHOSTS", "1410_California_58% of the state has gone into plaid.", "1411_Loop_Ugh, today's kids are forgetting the old-fashioned art of absentmindedly reading the same half-page of a book over and over and then letting your attention wander and picking up another book.", "1412_Teenage Mutant Ninja Turtles_My upcoming album, 'Linked List', has covers of 'The Purple People Eater', the Ninja Turtles theme, 'Itsy Bitsy Teenie Weenie Yellow Polka Dot Bikini', and the Power Rangers theme, with every song played to the tune of the next.", "1413_Suddenly Popular_Are Your Teens Practicing Amplexus? Learn These Six Telltale Signs!", "1414_Writing Skills_I'd like to find a corpus of writing from children in a non-self-selected sample (e.g. handwritten letters to the president from everyone in the same teacher's 7th grade class every year)--and score the kids today versus the kids 20 years ago on various objective measures of writing quality. I've heard the idea that exposure to all this amateur peer practice is hurting us, but I'd bet on the generation that conducts the bulk of their social lives via the written word over the generation that occasionally wrote book reports and letters to grandma once a year, any day.", "1415_Ballooning_Time to dance in front of Mary Jane! If I'm lucky, she'll turn out not to practice pre-copulatory sexual cannibalism!", "1416_Pixels_It's turtles all the way down.", "1417_Seven_The days of the week are Monday, Arctic, Wellesley, Green, Electra, Synergize, and the Seventh Seal.", "1418_Horse_Officer suspended from horse.", "1419_On the Phone_'No idea what I was thinking! Haha! But anyway, maybe we should check out what this Ba'al guy has to say.'", "1420_Watches_Old people used to write obnoxious thinkpieces about how people these days always wear watches and are slaves to the clock, but now they've switched to writing thinkpieces about how kids these days don't appreciate the benefits of an old-fashioned watch. My position is: The word 'thinkpiece' sounds like a word made up by someone who didn't know about the word 'brain'.", "1421_Future Self_Maybe I haven't been to Iceland because I'm busy dealing with YOUR crummy code.", "1422_My Phone is Dying_When it explodes, it will cast off its outer layers, leaving behind nothing but a slowly fading PalmPilot, calculator, or two-way pager.", "1423_Conversation_Later, at home: 'Dear diary: Still can't figure out what to write here ...'", "1424_En Garde_'Touch!' 'Nope, I sighed and stared at you with resignation, so I regained emotional right-of-way.'", "1425_Tasks_In the 60s, Marvin Minsky assigned a couple of undergrads to spend the summer programming a computer to use a camera to identify objects in a scene. He figured they'd have the problem solved by the end of the summer. Half a century later, we're still working on it.", "1426_Reduce Your Payments_I tried oxidizing them, but your bank uses some really weird paper and it wouldn't light.", "1427_iOS Keyboard_More actual results: 'Hello. My name is Inigo Montoya. You [are the best. The best thing ever]', 'Revenge is a dish best served [by a group of people in my room]', and 'They may take our lives, but they'll never take our [money].'", "1428_Move Fast and Break Things_I was almost fired from a job driving the hearse in funeral processions, but then the funeral home realized how much business I was creating for them.", "1429_Data_If you want to have more fun at the expense of language pedants, try developing an hypercorrection habit.", "1430_Proteins_Check it out--when I tug the C-terminal tail, the binding tunnel squeezes!", "1431_Marriage_People often say that same-sex marriage now is like interracial marriage in the 60s. But in terms of public opinion, same-sex marriage now is like interracial marriage in the 90s, when it had already been legal nationwide for 30 years.", "1432_The Sake of Argument_'It's not actually ... it's a DEVICE for EXPLORING a PLAUSIBLE REALITY that's not the one we're in, to gain a broader understanding about it.' 'oh, like a boat!' '...' 'Just for the sake of argument, we should get a boat! You can invite the Devil, too, if you want.'", "1433_Lightsaber_A long time in the future, in a galaxy far, far, away, astronomers in the year 2008 sight an unusual gamma-ray burst originating from somewhere far across the universe.", "1434_Where Do Birds Go_Water/ice has a lot of weird phases. Maybe asking 'where do birds go when it rains' is like asking 'where does Clark Kent go whenever Superman shows up?'", "1435_Presidential Alert_When putting his kids to bed, after saying 'Goodnight', Obama has to stop himself from saying 'God bless you, and God bless the United States of America.'", "1436_Orb Hammer_Ok, but make sure to get lots of pieces of rock, because later we'll decide to stay in a room on our regular orb and watch hammers hold themselves and hit rocks for us, and they won't bring us very many rocks.", "1437_Higgs Boson_'Can't you just use the LHC you already built to find it again?' 'We MAY have disassembled it to build a death ray.' 'Just one, though.' 'Nothing you should worry about.' 'The death isn't even very serious.'", "1438_Houston_'Oh, hey Mom. No, nothing important, just at work.'", "1439_Rack Unit_There's also nothing in the TOSes that says you can't let a dog play baseball in the server room!", "1440_Geese_Anyway, that's a common misconception. Geese live for a long time; all the ones we can see will probably keep flying around for billions of years before they explode.", "1441_Turnabout_Whenever I miss a shot with a sci-fi weapon, I say 'Apollo retroreflector' really fast, just in case.", "1442_Chemistry_These are all sans-serif compounds. Serif compounds are dramatically different and usually much more reactive.", "1443_Language Nerd_Not to go all sentence fragment on you.", "1444_Cloud_Cloud computing has a ways to go.", "1445_Efficiency_I need an extension for my research project because I spent all month trying to figure out whether learning Dvorak would help me type it faster.", "1446_Landing_[LIVE]", "1447_Meta-Analysis_Life goal #29 is to get enough of them rejected that I can publish a comparative analysis of the rejection letters.", "1448_Question_The universe long dead, IsaAC surveyed the formless chaos. At last, he had arrived at an answer. 'I like you,' he declared to the void, 'but I don't LIKE like you.'", "1449_Red Rover_I just learned about the Slide Mountain Ocean, which I like because it's three nouns that sound like they can't possibly all refer to the same thing.", "1450_AI-Box Experiment_I'm working to bring about a superintelligent AI that will eternally torment everyone who failed to make fun of the Roko's Basilisk people.", "1451_Background Screens_No way, we gotta rewind and cross-reference this map with the list of coordinates we saw on the other screen. This Greenland thing could be big.", "1452_Jurassic World_Hey guys! What's eating you? Ha ha ha it's me! Oh, what fun we have.", "1453_fMRI_They also showed activation in the parts of the brain associated with exposure to dubious study methodology, concern about unremoved piercings, and exasperation with fMRI techs who won't stop talking about Warped Tour.", "1454_Done_I'm sorry, but the author of this Facebook comment clearly believes you were.", "1455_Trolley Problem_For $5 I promise not to orchestrate this situation, and for $25 I promise not to take further advantage of this ability to create incentives.", "1456_On the Moon_\"I believe that this nation should commit itself to achieving the goal, before this decade is out, of landing a man on Venus and returning him safely to--\" [an aide frantically whispers in the president's ear for a moment] \"... of landing a man on Venus.\"", "1457_Feedback_A new study finds that if you give rats a cell phone and a lever they can push to improve the signal, the rats will chew on the cell phone until it breaks and your research supervisors will start to ask some questions about your grant money.", "1458_Small Moon_GENERAL JAN DODONNA: An analysis of the plans provided by Princess Leia has reinvigorated the arguments of the 'artificial moonlet' and 'rogue planet-station' camps. I fear this question is fracturing the Rebellion.", "1459_Documents_Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Copy of Untitled.doc", "1460_SMFW_wtfw it's like smho tbfh, imdb.", "1461_Payloads_With a space elevator, a backyard full of solar panels could launch about 500 horses per year, and a large power plant could launch 10 horses per minute.", "1462_Blind Trials_Plus, you have to control for the fact that some people are into being blindfolded.", "1463_Altitude_\"TURN OFF THE LASER GUIDE STAR\" \"WHY\" \"STAR CATS\"", "1464_Santa_He probably just poops over the side of the sleigh.", "1465_xkcd Phone 2_Washable, though only once.", "1466_Phone Checking_'Where were you when you learned you'd won?' 'I was actually asleep; I woke up when I refreshed the webite and saw the news.'", "1467_Email_My New Year's resolution for 2014-54-12/30/14 Dec:12:1420001642 is to learn these stupid time formatting strings.", "1468_Worrying_If the breaking news is about an event at a hospital or a lab, move it all the way over to the right.", "1469_UV_Hey, why stop at our house? We could burn down ALL these houses for the insurance money.", "1470_Kix_My parents sent me to several years of intensive Kix test prep.", "1471_Gut Fauna_I know it seems unpleasant, but of the two ways we typically transfer them, I promise this is the one you want.", "1472_Geography_The place I'd least like to live is the farm in the background of those diagrams showing how tornadoes form.", "1473_Location Sharing_Our phones must have great angular momentum sensors because the compasses really suck.", "1474_Screws_If you encounter a hex bolt, but you only brought screwdrivers, you can try sandwiching the head of the bolt between two parallel screwdriver shafts, squeezing the screwdrivers together with a hand at either end, then twisting. It doesn't work and it's a great way to hurt yourself, but you can try it!", "1475_Technically_\"Technically that sentence started with 'well', so--\" \"Ooh, a rock with a fossil in it!\"", "1476_Ceres_Earth clearly hasn't been inspected, since it's definitely contaminated with salmonella.", "1477_Star Wars_A long, long time (plus 40 years) ago, in a galaxy far, far away (plus a corrective factor involving the Hubble constant) ...", "1478_P-Values_If all else fails, use \"significant at a p>0.05 level\" and hope no one notices.", "1479_Troubleshooting_\"Oh, you're using their Chrome APP, not their Chrome EXTENSION. They're very similar but one handles window creation differently.\" is a thing I hope I can stop saying soon.", "1480_Super Bowl_My hobby: Pretending to miss the sarcasm when people show off their lack of interest in football by talking about 'sportsball' and acting excited to find someone else who's interested, then acting confused when they try to clarify.", "1481_API_ACCESS LIMITS: Clients may maintain connections to the server for no more than 86,400 seconds per day. If you need additional time, you may contact IERS to file a request for up to one additional second.", "1482_#NowPlaying_If you click on the post, it takes you to search results for the note on various online music stores.", "1483_Quotative Like_God was like, \"Let there be light,\" and there was light.", "1484_Apollo Speeches_While our commitment to recycling initiatives has been unwavering, this is not a cost any of us should be expected to pay.", "1485_Friendship_The only other Wikipedia vandalism that I would feel zero remorse about is editing the article on active US militia groups to replace \"militia\" with \"fanclub\".", "1486_Vacuum_Do you think you could actually clean the living room at some point, though?", "1487_Tornado_Nearby, there were also no injuries when a multi-vortex tornado hit one of those spinning teacup rides.", "1488_Flowcharts_Whoa, and if you overlay a Fibonacci spiral on a golden spiral it matches up almost perfectly!", "1489_Fundamental Forces_\"Of these four forces, there's one we don't really understand.\" \"Is it the weak force or the strong--\" \"It's gravity.\"", "1490_Atoms_When I was little I had trouble telling my dad apart from the dog. I always recognized my mom because she had a bunch of extra plutoniums in her middle. I never did ask her why ...", "1491_Stories of the Past and Future_Little-known fact: The 'Dawn of Man' opening sequence in 2001 cuts away seconds before the Flintstones theme becomes recognizable.", "1492_Dress Color_This white-balance illusion hit so hard because it felt like someone had been playing through the Monty Hall scenario and opened their chosen door, only to find there was unexpectedly disagreement over whether the thing they'd revealed was a goat or a car.", "1493_Meeting_Here at CompanyName.website, our three main strengths are our web-facing chairs, our huge collection of white papers, and the fact that we physically cannot die.", "1494_Insurance_LIFEHACKS: You can just take all the luggage off the airport conveyer belt and leave with it. They don't check that it's yours at the door!", "1495_Hard Reboot_Googling inevitably reveals that my problem is caused by a known bug triggered by doing [the exact combination of things I want to do]. I can fix it, or wait a few years until I don't want that combination of things anymore, using the kitchen timer until then.", "1496_Art Project_It's my most ambitious project yet, judging by the amount of guacamole.", "1497_New Products_If you ever hear \"Wait, is that Kim Dotcom's new project? I'm really excited about it and already signed up, although I'm a little nervous about whether everyone should hand over control of their medical...\", it's time to dig a bunker in your backyard.", "1498_Terry Pratchett_Thank you for teaching us how big our world is by sharing so many of your own.", "1499_Arbitrage_The invisible hand of the market never texts me back.", "1500_Upside-Down Map_Due to their proximity across the channel, there's long been tension between North Korea and the United Kingdom of Great Britain and Southern Ireland.", "1501_Mysteries_At the bottom left: The mystery of why, when I know I needed to be asleep an hour ago, I decide it's a good time to read through every Wikipedia article in the categories 'Out-of-place artifacts', 'Earth mysteries', 'Anomalous weather', and 'List of people who disappeared mysteriously'.", "1502_Wasted Time_Since it sounds like your time spent typing can't possibly be less productive than your time spent not typing, have you tried typing SLOWER?", "1503_Squirrel Plan_[Halfway to the Sun ...] Heyyyy ... what if this BALLOON is full of acorns?!", "1504_Opportunity_We all remember those famous first words spoken by an astronaut on the surface of Mars: \"That's one small step fo- HOLY SHIT LOOK OUT IT'S GOT SOME KIND OF DRILL! Get back to the ... [unintelligible] ... [signal lost]\"", "1505_Ontological Argument_A God who holds the world record for eating the most skateboards is greater than a God who does not hold that record.", "1506_xkcloud_", "1507_Metaball_Shoot, it landed in the golf course. Gonna be hard to get it down the--oh, never mind, it rolled onto the ice hazard. Face-off!", "1508_Operating Systems_One of the survivors, poking around in the ruins with the point of a spear, uncovers a singed photo of Richard Stallman. They stare in silence. \"This,\" one of them finally says, \"This is a man who BELIEVED in something.\"", "1509_Scenery Cheat Sheet_At the boundary between each zone, stories blend together. Somewhere in the New Mexico desert, the Roadrunner is pursued by a tireless Anton Chigurh.", "1510_Napoleon_\"Mr. President, what if the unthinkable happens? What if the launch goes wrong, and Napoleon is not stranded on the Moon?\" \"Have Safire write up a speech.\"", "1511_Spice Girl_Haha, you'll see!", "1512_Horoscopes_If you live in the Northern hemisphere, anyway. In the southern hemisphere, due to the coriolis effect, babies are born nine months BEFORE they're conceived.", "1513_Code Quality_I honestly didn't think you could even USE emoji in variable names. Or that there were so many different crying ones.", "1514_PermaCal_The flood of PermaCalNTP leap-second notifications was bad enough, but when people started asking for millisecond resolution, the resulting DDOS brought down the internet.", "1515_Basketball Earth_How many points do you get for dunking every basketball in existence at once?", "1516_Win by Induction_This would be bad enough, but every 30th or 40th pokÃ©ball has TWO of them inside.", "1517_Spectroscopy_Although right now I'm more excited about ESPRESSO's radial velocity measurements, so I'm listening to This Kiss, her song about measuring \"centrifugal motion\" on \"a rooftop under the sky\".", "1518_Typical Morning Routine_Hang on, I've heard this problem. We need to pour water into the duct until the phone floats up and ... wait, phones sink in water. Mercury. We need a vat of mercury to pour down the vent. That will definitely make this situation better and not worse.", "1519_Venus_The sudden introduction of Venusian flowers led to an explosive growth of unusual Earth pollinators, which became known as the \"butterfly effect.\"", "1520_Degree-Off_I'M SORRY, FROM YOUR YEARS OF CONDESCENDING TOWARD THE 'SQUISHY SCIENCES', I ASSUMED YOU'D BE A LITTLE HARDER.", "1521_Sword in the Stone_That seems like an awful lot of hassle when all I wanted was a cool sword.", "1522_Astronomy_Astrobiology is held back by the fact that we're all too nervous to try to balance on the ladder while holding an expensive microscope.", "1523_Microdrones_Oh, weird, Amazon is out of butterfly nets.", "1524_Dimensions_I would say time is definitely one of my top three favorite dimensions.", "1525_Emojic 8 Ball_", "1526_Placebo Blocker_They work even better if you take them with our experimental placebo booster, which I keep in the same bottle.", "1527_Humans_At this point, if we're going to keep insisting on portraying dinosaurs as featherless because it's \"cooler\", it's time to apply that same logic to art involving bald eagles.", "1528_Vodka_Or whatever's handy! I'm pretty much pure alcohol and water, so it doesn't really matter!", "1529_Bracket_I'm staring at the \"doctor\" section, and I can't help but feel like I've forgotten someone.", "1530_Keyboard Mash_WHY DON'T YOU COME HANG OUT INSIDE MY HOUSE. WE CAN COOK BREAD AND CHAT ABOUT OUR INTERNAL SKELETONS.", "1531_The BDLPSWDKS Effect_This well-known effect has of course been replicated in countless experiments.", "1532_New Horizons_Last-minute course change: Let's see if we can hit Steve's house.", "1533_Antique Factory_WARNING: This item was aged by the same inexorable passage of time that also processes nuts.", "1534_Beer_Mmmm, this is such a positive experience! I feel no social pressure to enjoy it at all!", "1535_Words for Pets_Seventh year: Perfectly coherent words, but in the pet's language, not mine.", "1536_The Martian_I have never seen a work of fiction so perfectly capture the out-of-nowhere shock of discovering that you've just bricked something important because you didn't pay enough attention to a loose wire.", "1537_Types_colors.rgb(\"blue\") yields \"#0000FF\". colors.rgb(\"yellowish blue\") yields NaN. colors.sort() yields \"rainbow\"", "1538_Lyrics_To me, trying to understand song lyrics feels like when I see text in a dream but itð\u009d\u0094° hà¸­áµ£d tâ\u0082\u0080 áµ£eâ\u0082\u0090d aà¸\u0081d ð\u009d\u0092¾ canÙ\u0096t fà¾\u0081cuà¼§à¼¦à¿\u0090à¼\u0084", "1539_Planning_[10 years later] Man, why are people so comfortable handing Google and Facebook control over our nuclear weapons?", "1540_Hemingway_Instead of bobcat, package contained chair.", "1541_Voice_Anyway, we should totally go watch a video story or put some food in our normal mouths!", "1542_Scheduling Conflict_Neither a spokesperson for the organization nor the current world champion could be reached for comment.", "1543_Team Effort_Given the role they play in every process in my body, really, they deserve this award more than me. Just gotta figure out how to give it to them. Maybe I can cut it into pieces to make it easier to swallow ...", "1544_Margaret_Otherwise known as Margaret the Destroyer, I will bring pain to the the Great One. Then again, maybe I won't.", "1545_Strengths and Weaknesses_Do you need me to do a quicksort on the whiteboard or produce a generation of offspring or something? It might take me a bit, but I can do it.", "1546_Tamagotchi Hive_The Singularity happened, but not to us.", "1547_Solar System Questions_My country's World Cup win was exciting and all, but c'mon, what if the players wore nylon wings and COULD LITERALLY FLY?", "1548_90s Kid_We remember Rugrats, and think of them every time our kids look at us through their baby gates.", "1549_XKCD Phone 3_If you're not completely satisfied with the phone after 30 days, we will return you to your home at no cost.", "1550_Episode VII_The Lord of the Rings sequel, set years after the Ring hubbub has died down, is just Samwise discreetly creeping back to Bag End to finish dropping the eaves.", "1551_Pluto_After decades of increasingly confused arguing, Pluto is reclassified as a \"dwarf Pluto.\"", "1552_Rulebook_It's definitely an intentional foul, but we've decided it's worth it.", "1553_Public Key_I guess I should be signing stuff, but I've never been sure what to sign. Maybe if I post my private key, I can crowdsource my decisions about what to sign.", "1554_Spice Girls_The Earth's five major mass extinctions were the Posh Extinction, the Sporty Extinction, the Scary Extinction, the Ginger Extinction, and the Baby Extinction.", "1555_Exoplanet Names 2_I'm going to drive this Netherlands joke so far into the ground they'll have to build levees around it to keep the sea out.", "1556_The Sky_The other half has some cool shipwrecks, rocks, and snakes, but if you move those out of the way, it also has more sky.", "1557_Ozymandias_And on the pedestal these words appear: \"And on the pedestal these words appear: \"And on the pedestal these words appear: \"And ...", "1558_Vet_It's probably for the best. Since Roombas are native to North America, it's illegal for Americans to keep them in their houses under the Migratory Bird Treaty Act.", "1559_Driving_Sadly, it probably won't even have enough gas to make it to the first border crossing.", "1560_Bubblegum_I came here to chew bubblegum and say no more than eighteen words ... and I'm all out of", "1561_Water Phase Diagram_Vanilla Ice was produced in small quantities for years, but it wasn't until the 90s that experimenters collaborated to produce a sample that could survive at room temperature for several months. ", "1562_I in Team_There's no \"I\" in \"VOWELS\".", "1563_Synonym Movies_Fans eagerly await 2015's 'Space Fights: Power Gets Up', although most think 1999's 'Space Fights: The Scary Ghost' didn't live up to the hype.", "1564_Every Seven Seconds_Every few months, I think about sex every seven seconds and how weird and implausible it would be.", "1565_Back Seat_Hang on, let me scare the live raccoon over to the same side as the dead one.", "1566_Board Game_Yes, it took a lot of work to make the cards and pieces, but it's worth it--the players are way more thorough than the tax prep people ever were.", "1567_Kitchen Tips_Household tip: Tired of buying so much toilet paper? Try unspooling the paper from the roll before using it. A single roll can last for multiple days that way, and it's much easier on your plumbing.", "1568_Synonym Movies 2_There's also the TV show based on the hit Hot and Cold Music books: Fun With Chairs, Royal Rumble, Knife Blizzard, Breakfast for Birds, and Samba Serpents.", "1569_Magic Tree_Since people rarely try to cut down cell phone towers, after millions of years, as cell phone towers have gotten more treelike, trees have started growing fake cell phone tower attachments and shiny gray bark to protect themselves. This is a standard textbook example of convergent evolution.", "1570_Engineer Syllogism_The less common, even worse outcome: \"3: [everyone in the financial system] WOW, where did all my money just go?\"", "1571_Car Model Names_CLIMAX is good, but SEXCLIMAX is even better.", "1572_xkcd Survey_The xkcd Survey: Big Data for a Big Planet", "1573_Cyberintelligence_We had gathered that raw information, but had yet to put it all together.", "1574_Trouble for Science_Careful mathematical analysis demonstrates small-scale irregularities in Gaussian distribution", "1575_Footprints_\"There's one set of foot-p's cause I was totes carrying you, bro!\" said Jesus seconds before I punched him.", "1576_I Could Care Less_I literally could care less.", "1577_Advent_The few dozen doors that have little Christmas trees on them are a nice touch.", "1578_Squirrelphone_After a while, the squirrel starts making that beeping noise and doesn't stop until it hops back up onto the stump.", "1579_Tech Loops_And when I think about it, a lot of \"things I want to do\" are just learning about and discussing new tools for tinkering with the chain.", "1580_Travel Ghost_And a different ghost has replaced me in the bedroom.", "1581_Birthday_I guess I need to apologize to my parents, friends, and the staff at Chuck E. Cheese's for all the times I called the cops on them.", "1582_Picture a Grassy Field_Wait, I can fix this. Picture another field. In the middle sits the only creature the first creature is afraid of. Now just-- wait, where did THAT one go?", "1583_NASA Press Conference_Why are we spending billions to ruin Mars with swarms of robots when Elon Musk has promised to ruin Mars for a FRACTION of the cost?", "1584_Moments of Inspiration_Charles, I just talked to John and Mildred, who run that company selling seeds and nuts, and their kids with MOUTHS are starving!", "1585_Similarities_I just came from The Martian, and I just have to say: Forget BB-8; I want a pet Sojourner! It's always been the cutest of our Mars rovers.", "1586_Keyboard Problems_In the future, a group of resistance fighters send me back in time with instructions to find the Skynet prototype and try to upgrade it.", "1587_Food Rule_I won't eat invertebrates, because I can fight a skeleton, but I have no idea what kind of spooky warrior a squid leaves behind.", "1588_Hardware Reductionism_My MRI research shows a clear correlation between the size of the parietal lobe--the part of the brain that handles spatial reasoning--and enjoyment of 3D DoritosÂ®.", "1589_Frankenstein_\"Wait, so in this version is Frankenstein also the doctor's name?\" \"No, he's just 'The Doctor'.\"", "1590_The Source_Why did we even have that thing?", "1591_Bell's Theorem_The no-communication theorem states that no communication about the no-communication theorem can clear up the misunderstanding quickly enough to allow faster-than-light signaling.", "1592_Overthinking_On the other hand, it took us embarrassingly long to clue in to the lung cancer/cigarette thing, so I guess the real lesson is \"figuring out which ideas are true is hard.\"", "1593_Play-By-Play_The thrower started hitting the bats too much, so the king of the game told him to leave and brought out another thrower from thrower jail.", "1594_Human Subjects_After meeting with a few of the subjects, the IRB actually recommended that you stop stressing out so much about safety guidelines.", "1595_30 Days Hath September_There's a cool mental calculation hack I recently learned for this: If you open the calendar app on your phone or computer, the highest-numbered box along the bottom is equal to the number of days in the month!", "1596_Launch Status Check_Visual checks suggest the cool bird has exited the launch zone. Tip the rocket sideways and resume the countdown--we're gonna go find it!", "1597_Git_If that doesn't fix it, git.txt contains the phone number of a friend of mine who understands git. Just wait through a few minutes of 'It's really pretty simple, just think of branches as...' and eventually you'll learn the commands that will fix everything.", "1598_Salvage_My hobby: Taking advantage of the rice myth by posting articles on \"how to save your wet phone\" which are actually just elaborate recipes for rice pilaf.", "1599_Water Delivery_When I was a kid, I asked my parents why our houses didn't have toothpaste pipes in addition to water ones. I'm strangely pleased to see Amazon thinking the same way.", "1600_MarketWatch_Markets have been rocked by a second day of uncertainty after someone set up a giant Ouija board on the NYSE wall controlled collectively by the movement of the stock tickers.", "1601_Isolation_2060: The gregarious superintelligent AI, happily talking its way out of a box, is fast becoming a relic of the past. Today's quantum hyper-beings are too busy with their internal multiverse sims to even notice that they're in boxes at all!", "1602_Linguistics Club_If that's too easy, you could try joining Tautology Club, which meets on the date of the Tautology Club meeting.", "1603_Flashlights_Due to a typo, I initially found a forum for serious Fleshlight enthusiasts, and it turns out their highest-end models are ALSO capable of setting trees on fire. They're impossible to use without severe burns, but some of them swear it's worth it.", "1604_Snakes_The last band of color indicates the snake's tolerance for being held before biting.", "1605_DNA_Researchers just found the gene responsible for mistakenly thinking we've found the gene for specific things. It's the region between the start and the end of every chromosome, plus a few segments in our mitochondria.", "1606_Five-Day Forecast_You know what they say--if you don't like the weather here in the Solar System, just wait five billion years.", "1607_Supreme Court_Writing for the majority, Justice Kennedy called the man's arguments that he could be either Alito or Ginsburg \"surprisingly compelling, but ultimately unconvincing.\"", "1608_Hoverboard_Return to the play area", "1609_Food Combinations_If anyone tries this on you, the best reply is a deadpan \"Oh yeah, that's a common potato chip flavor in Canada.\"", "1610_Fire Ants_Here in the entomology department, we have a simple two-step formula for answering any question: (1) ants are cool, and (2) we forgot the question because we were thinking about ants.", "1611_Baking Soda and Vinegar_Sure, it may not meet science fair standards, but I want credit for getting my baking soda and vinegar mountain added to the Decade Volcanoes list.", "1612_Colds_The contagious period ends right around when you start to sound sick over the phone, which is probably evidence of cold viruses evolving to spread optimally in the workplace.", "1613_The Three Laws of Robotics_In ordering #5, self-driving cars will happily drive you around, but if you tell them to drive to a car dealership, they just lock the doors and politely ask how long humans take to starve to death.", "1614_Kites_[Dog returns with the end of a string in its mouth] [Voice drifts down from the sky] Kites are fun!", "1615_Red Car_That guy only drives an alkaline car to overcompensate for his highly acidic penis.", "1616_Lunch_I'm trying to be healthier, so after I eat this brick of cheese, I'll have a spoonful of grease-soaked vegetables.", "1617_Time Capsule_Oh no, I changed the future and now I'm disappearing! Wait, never mind, it was just my hat slipping down over my eyes.", "1618_Cold Medicine_Seriously considering buying some illegal drugs to try to turn them back into cold medicine.", "1619_Watson Medical Algorithm_Due to a minor glitch, 'discharge patient' does not cause the algorithm to exit, but instead leads back to 'hunt down and capture patient'.", "1620_Christmas Settings_SOUND DOGS MAKE: [BARKING] [HISSING] [LIGHTSABER NOISES] [FLUENT ENGLISH] [SWEARING]", "1621_Fixion_My theory predicts that, at high enough energies, FRBs and perytons become indistinguishable because the detector burns out.", "1622_Henge_I've got the Craigslist post ready to go! I wasn't sure what category it should go in, so I listed it as property and put that it has 'good sun exposure.'", "1623_2016 Conversation Guide_The real loser in an argument about the meaning of the word 'hoverboard' is anyone who leaves that argument on foot.", "1624_2016_Want to feel old? Wait.", "1625_Substitutions 2_Within a few minutes, our roads will be full of uncontrollably-swerving cars and our skies full of Amazon delivery dogs.", "1626_Judgment Day_It took a lot of booster rockets, but luckily Amazon had recently built thousands of them to bring Amazon Prime same-day delivery to the Moon colony.", "1627_Woosh_It also occasionally replies with 'Comment of the year', 'Are you for real', and 'I'm taking a screenshot so I can remember this moment forever'.", "1628_Magnus_In the latest round, 9-year-old Muhammad Ali beat 10-year-old JFK at air hockey, while Secretariat lost the hot-dog-eating crown to 12-year-old Ken Jennings. Meanwhile, in a huge upset, 11-year-old Martha Stewart knocked out the adult Ronda Rousey.", "1629_Tools_I make tools for managing job-hunting sites for people who make tools for managing job-hunting sites for people who make tools for ...", "1630_Quadcopter_I always have to turn off nature documentaries when they show these scenes.", "1631_Longer Than Usual_'--> [ Well, this is embarrassing. ] <--'", "1632_Palindrome_I hope that somewhere in the world, \"Panamax\" is the last option on a \"size\" drop-down menu on a sex toy site.", "1633_Possible Undiscovered Planets_Superman lies near the bird/plane boundary over a range of distances, which explains the confusion.", "1634_In Case of Emergency_I keep first aid kits in those emergency lockers. Sure, it's expensive to have them installed in the wall, but at least for those ones there's no need to pay extra for safety glass.", "1635_Birdsong_Maybe if I put it in a box for a while with a speaker playing some pleasant pastoral music, I can reprogram it.", "1636_XKCD Stack_This site requires Sun Java 6.0.0.1 (32-bit) or higher. You have Macromedia Java 7.3.8.1Â¾ (48-bit). Click here [link to java.com main page] to download an installer which will run fine but not really change anything.", "1637_Salt Mine_This one is a little bland. Pass the saltshaker?", "1638_Backslashes_I searched my .bash_history for the line with the highest ratio of special characters to regular alphanumeric characters, and the winner was: cat out.txt | grep -o \"[[(].*[])][^)]]*$\" ... I have no memory of this and no idea what I was trying to do, but I sure hope it worked.", "1639_To Taste_Look, recipe, if I knew how much was gonna taste good, I wouldn't need you.", "1640_Super Bowl Context_Why did the chicken cross the road? It begins over five thousand years ago with the domestication of the red junglefowl in southeast Asia and the development of paved roads in the Sumerian city of Ur.", "1641_Hot Dogs_Okay, I'm just gonna order pizza, and let's never talk about this again.", "1642_Gravitational Waves_\"That last LinkedIn request set a new record for the most energetic physical event ever observed. Maybe we should respond.\" \"Nah.\"", "1643_Degrees_\"Radians Fahrenheit or radians Celsius?\" \"Uh, sorry, gotta go!\"", "1644_Stargazing_Some of you may be thinking, 'But wait, isn't the brightest star in our sky the Sun?' I think that's a great question and you should totally ask it. On the infinite tree of possible conversations spread out before us, I think that's definitely the most promising branch.", "1645_Toasts_Platonic solids for my real friends and real solids for my platonic friends!", "1646_Twitter Bot_PYTHON FLAG ENABLE THREE LAWS", "1647_Diacritics_Using diacritics correctly is not my fortÃ©.", "1648_Famous Duos_The Romeo and Butt-Head film actually got two thumbs up from Siskel and Oates.", "1649_Pipelines_In the future, every single pipeline will lead to the bowl of a giant blender, and we'll all just show up with a bucket each day to take our share of the resulting smoothie.", "1650_Baby_Does it get taller first and then widen, or does it reach full width before getting taller, or alternate, or what?", "1651_Robotic Garage_But listen, if getting your car out from under the pile is REALLY important to you, we do have an axe you can borrow.", "1652_Conditionals_'If you're done being pedantic, we should get dinner.' 'You did it again!' 'No, I didn't.'", "1653_United States Map_It would be pretty unfair to give to someone a blank version of this map as a 'how many states can you name?' quiz. (If you include Alaska and Hawaii, you should swap the Aleutian Islands with the Hawaiian ones.)", "1654_Universal Install Script_The failures usually don't hurt anything, and if it installs several versions, it increases the chance that one of them is right. (Note: The 'yes' command and '2>/dev/null' are recommended additions.)", "1655_Doomsday Clock_After a power outage at the Bulletin of the Atomic Scientists, the new Digital Doomsday Clock is flashing 00:00 and mushroom clouds keep appearing and then retracting once a second.", "1656_It Begins_You can also try 'Yikes.'", "1657_Insanity_I looked up \"insanity\" in like 10 different dictionaries and none of them said anything like that. Neither did the DSM-4. But I'll keep looking. Maybe it's in the DSM-5!", "1658_Estimating Time_Corollary to Hofstadter's Law: Every minute you spend thinking about Hofstadter's Law is a minute you're NOT WORKING AND WILL NEVER FINISH! PAAAAAANIIIIIIC!", "1659_Tire Swing_If we find one of those tire dumps, the next time he tries to get his truck back we can just retreat and let him have it.", "1660_Captain Speaking_Oh dang, you have to pay? Hey, has anyone else paid already? If so, can I borrow your phone for a sec?", "1661_Podium_BREAKING: Senator's bold pro-podium stand leads to primary challenge from prescriptivist base.", "1662_Jack and Jill_Jill and Jack / began to frack. / The oil boosts their town. / But fractures make / the bedrock shake / and Jack came tumbling down.", "1663_Garden_Relax.", "1664_Mycology_Conspiracy theory: There's no such thing as corn. Those fields you see are just the stalks of a fungus that's controlling our brains to make us want to spread it.", "1665_City Talk Pages_I don't think the Lakeshore Air Crash Museum really belongs under 'Tourist Attractions.' It's not a museum--it's just an area near the Lake Festival Laser Show where a lot of planes have crashed.", "1666_Brain Upload_I just spent 20 minutes deciding whether to start an email with 'Hi' or 'Hey', so I think it transferred correctly.", "1667_Algorithms_There was a schism in 2007, when a sect advocating OpenOffice created a fork of Sunday.xlsx and maintained it independently for several months. The efforts to reconcile the conflicting schedules led to the reinvention, within the cells of the spreadsheet, of modern version control.", "1668_Singularity_I figured that now that society has collapsed, I wouldn't need to wear clothes anymore, but apparently that violates some weird rule of quantum gravity.", "1669_Planespotting_No, a hydroplane doesn't land on water--that's an aquaplane. A hydroplane is a plane that gets electric power from an onboard water reservoir with a tiny dam and turbines.", "1670_Laws of Physics_The laws of physics are fun to try to understand, but as an organism with incredibly delicate eyes who evolved in a world full of sharp objects, I have an awful lot of trust in biology's calibration of my flinch reflex.", "1671_Arcane Bullshit_Learning arcane bullshit from the 80s can break your computer, but if you're willing to wade through arcane bullshit from programmers in the 90s and 2000s, you can break everyone else's computers, too.", "1672_Women on 20s_I get that there are security reasons for the schedule, but this is like the ONE problem we have where the right answer is both easy and straightforward. If we can't figure it out, maybe we should just give up and just replace all the portraits on the bills with that weird pyramid eye thing.", "1673_Timeline of Bicycle Design_I'll be honest--the 1950s were a rough time for cycling.", "1674_Adult_(1) That shopping cart is full of AirHeads, and (2) I died at 41 from what the AirHeads company spokesperson called 'probably natural causes.'", "1675_Message in a Bottle_I tried to send a message back, but I accidentally hit 'reply all' and now the ocean is clogged with message bottles.", "1676_Full-Width Justification_Gonna start bugging the Unicode consortium to add snake segment characters that can be combined into an arbitrary-length non-breaking snake.", "1677_Contrails_Astronomy (or \"astrology\" in British English) is the study of ...", "1678_Recent Searches_autoexec code posted by verified twitter users", "1679_Substitutions 3_BREAKING: Channing Tatum and his friends explore haunted city", "1680_Black Hole_It also brings all the boys, and everything else, to the yard.", "1681_Laser Products_ERRORS: HAIR JAM. COLOR-SAFE CONDITIONER CARTRIDGE RUNNING LOW. LEGAL-SIZE HAIR TRAY EMPTY, USING LETTER-SIZE HAIR ONLY.", "1682_Bun_If a wild bun is sighted, a nice gesture of respect is to send a 'BUN ALERT' message to friends and family, with photographs documenting the bun's location and rank. If no photographs are possible, emoji may be substituted.", "1683_Digital Data_Ã¢â\u0082¬Å\u0093If you can read this, congratulationsÃ¢â\u0082¬â\u0080\u009dthe archive youÃ¢â\u0082¬â\u0084¢re using still knows about the mouseover textÃ¢â\u0082¬Â\u009d!", "1684_Rainbow_Listen, in a few thousand years you'll invent a game called 'SimCity' which has a 'disaster' button, and then you'll understand.", "1685_Patch_My optimizer uses content-aware inpainting to fill in all the wasted whitespace in the code, repeating the process until it compiles.", "1686_Feel Old_'How long are you going to keep this up?' 'Statistically, only four or five more decades.'", "1687_World War III+_I hate how the media only ever uses the first part of this quote, stripping it of its important context.", "1688_Map Age Guide_Does the screeching chill your blood and herald death? If yes, banshee. If no, seagull.", "1689_My Friend Catherine_I can't get any work done because my friend Catherine is sitting on my keyboard.", "1690_Time-Tracking Software_'List of helicopter prison escapes' and 'List of sexually active popes' are both entertainingly long, but sadly there's no 'List of helicopter prison escapes involving sexually active popes.'"]}